mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/*

Module:	mcci_stm32h7xx.h

Function:
	Register definitions for STM32H7xx CPUs

Copyright and License:
	This file copyright (C) 2021 by

		MCCI Corporation
		3520 Krums Corners Road
		Ithaca, NY  14850

	See accompanying LICENSE file for copyright and license information.

Author:
	Terry Moore, MCCI Corporation	March 2021

*/

#ifndef _mcci_stm32h7xx_h_
#define _mcci_stm32h7xx_h_	/* prevent multiple includes */

#pragma once

#ifndef _mcci_bootloader_bits_h_
# include "mcci_bootloader_bits.h"
#endif

#ifndef _mcci_arm_cm7_h_
# include "mcci_arm_cm7.h"
#endif

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/****************************************************************************\
|
|	Register addresses
|
\****************************************************************************/

/// \name STM32H7xx top-level address breakdown
///	@{
#define	MCCI_STM32H7_MEMORY_FLASH	UINT32_C(0x08000000)	///< Flash program memory (up to 2M)
#define	MCCI_STM32H7_MEMORY_FLASH1	UINT32_C(0x08000000)	///< Flash program memory (up to 1M)
#define	MCCI_STM32H7_MEMORY_FLASH2	UINT32_C(0x08100000)	///< Flash program memory (up to 1M)
#define	MCCI_STM32H7_MEMORY_FLASH_END	UINT32_C(0x081FFFFF)	///< End of Flash program memory
#define	MCCI_STM32H7_MEMORY_SYSTEM	UINT32_C(0x1FF00000)	///< System memory (128K)
#define	MCCI_STM32H7_MEMORY_SYSTEM_END	UINT32_C(0x1FF1FFFF)	///< End of System memory
#define	MCCI_STM32H7_MEMORY_OTP		UINT32_C(0x08FFF000)	///< OTP Area (1K)
#define	MCCI_STM32H7_MEMORY_OTP_END	UINT32_C(0x08FFF3FF)	///< End of OTP Area
#define	MCCI_STM32H7_MEMORY_READ_ONLY	UINT32_C(0x08FFF800)	///< read-only area (512)
#define MCCI_STM32H7_MEMORY_ITCM_RAM	UINT32_C(0x00000000)	///< ITCM RAM (64K)
#define MCCI_STM32H7_MEMORY_DTCM_RAM	UINT32_C(0x20000000)	///< DTCM RAM (128K)
#define	MCCI_STM32H7_MEMORY_AXI_SRAM1	UINT32_C(0x24000000)	///< AXI SRAM1 (up to 256K)
#define	MCCI_STM32H7_MEMORY_AXI_SRAM2	UINT32_C(0x24040000)	///< AXI SRAM2 (up to 384K)
#define	MCCI_STM32H7_MEMORY_AXI_SRAM3	UINT32_C(0x240A0000)	///< AXI SRAM3 (up to 384K)
#define MCCI_STM32H7_MEMORY_AHB_SRAM1	UINT32_C(0x30000000)	///< AHB SRAM1 (up to 64K)
#define MCCI_STM32H7_MEMORY_AHB_SRAM2	UINT32_C(0x30010000)	///< AHB SRAM2 (up to 64K)
#define MCCI_STM32H7_MEMORY_SRD_SRAM	UINT32_C(0x38000000)	///< SRD SRAM (up to 32K)
#define MCCI_STM32H7_MEMORY_SRD_BKPSRAM	UINT32_C(0x38800000)	///< SRD Backup SRAM (up to 4K)
#define	MCCI_STM32H7_REG_TIMER2		UINT32_C(0x40000000)	///< Section 43.4: TIMx register map (1K)
#define	MCCI_STM32H7_REG_TIMER3		UINT32_C(0x40000400)	///< Section 43.4: TIMx register map (1K)
#define	MCCI_STM32H7_REG_TIMER4		UINT32_C(0x40000800)	///< Section 43.4: TIMx register map (1K)
#define	MCCI_STM32H7_REG_TIMER5		UINT32_C(0x40000C00)	///< Section 43.4: TIMx register map (1K)
#define	MCCI_STM32H7_REG_TIMER6		UINT32_C(0x40001000)	///< Section 46.4: TIM6/7 register map (1K)
#define	MCCI_STM32H7_REG_TIMER7		UINT32_C(0x40001400)	///< Section 46.4: TIM6/7 register map (1K)
#define	MCCI_STM32H7_REG_TIMER12	UINT32_C(0x40001800)	///< Section 43.4: TIM6/7 register map (1K)
#define	MCCI_STM32H7_REG_TIMER13	UINT32_C(0x40001C00)	///< Section 43.4: TIM6/7 register map (1K)
#define	MCCI_STM32H7_REG_TIMER14	UINT32_C(0x40002000)	///< Section 43.4: TIM6/7 register map (1K)
#define	MCCI_STM32H7_REG_LPTIM1		UINT32_C(0x40002400)	///< Section 47.7: LPTIM register map (1K)
#define	MCCI_STM32H7_REG_SPI2		UINT32_C(0x40003800)	///< Section 55.11: SPI register map (1K)
#define	MCCI_STM32H7_REG_SPI3		UINT32_C(0x40003C00)	///< Section 55.11: SPI register map (1K)
#define	MCCI_STM32H7_REG_SPDIFRX1	UINT32_C(0x40004000)	///< Section 57.5: SPDIFRX interface register map (1K)
#define	MCCI_STM32H7_REG_USART2		UINT32_C(0x40004400)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_USART3		UINT32_C(0x40004800)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_UART4		UINT32_C(0x40004C00)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_UART5		UINT32_C(0x40005000)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_I2C1		UINT32_C(0x40005400)	///< Section 52.7: I2C register map (1K)
#define	MCCI_STM32H7_REG_I2C2		UINT32_C(0x40005800)	///< Section 52.7: I2C register map (1K)
#define	MCCI_STM32H7_REG_I2C3		UINT32_C(0x40005C00)	///< Section 52.7: I2C register map (1K)
#define	MCCI_STM32H7_REG_HDMI_CEC	UINT32_C(0x40006C00)	///< Section 63.7: HDMI-CEC register map (1K)
#define	MCCI_STM32H7_REG_DAC1		UINT32_C(0x40007400)	///< Section 29.7: DAC register map (1K)
#define	MCCI_STM32H7_REG_UART7		UINT32_C(0x40007800)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_UART8		UINT32_C(0x40007C00)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_CRS		UINT32_C(0x40008400)	///< Section 9.8: CRS register map (1K)
#define	MCCI_STM32H7_REG_SWPMI		UINT32_C(0x40008800)	///< Section 58.6: SWPMI register map (1K)
#define	MCCI_STM32H7_REG_OPAMP		UINT32_C(0x40009000)	///< Section 32.6: OPAMP register map (1K)
#define	MCCI_STM32H7_REG_MDIOS		UINT32_C(0x40009400)	///< Section 59.4: MDIOS register map (1K)
#define	MCCI_STM32H7_REG_TT_FDCAN	UINT32_C(0x4000A000)	///< Section 61.5: FDCAN register map (1K)
#define	MCCI_STM32H7_REG_FDCAN		UINT32_C(0x4000A400)	///< Section 61.5: FDCAN register map (1K)
#define	MCCI_STM32H7_REG_CAN_CCU	UINT32_C(0x4000A800)	///< Section 61.5: FDCAN register map (1K)
#define	MCCI_STM32H7_REG_CAN_MSG_RAM	UINT32_C(0x4000AC00)	///< Section 61.5: FDCAN register map (1K)
#define	MCCI_STM32H7_REG_TIMER1		UINT32_C(0x40010000)	///< Section 42.4: TIMx register map (1K)
#define	MCCI_STM32H7_REG_TIMER8		UINT32_C(0x40010400)	///< Section 42.4: TIMx register map (1K)
#define	MCCI_STM32H7_REG_USART1		UINT32_C(0x40011000)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_USART6		UINT32_C(0x40011400)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_UART9		UINT32_C(0x40011800)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_USART10	UINT32_C(0x40011C00)	///< Section 53.7: USART register map (1K)
#define	MCCI_STM32H7_REG_SPI1		UINT32_C(0x40013000)	///< Section 55.11: SPI register map (1K)
#define	MCCI_STM32H7_REG_I2S1		UINT32_C(0x40013000)	///< Section 55.11: SPI register map (1K)
#define	MCCI_STM32H7_REG_SPI4		UINT32_C(0x40013400)	///< Section 55.11: SPI register map (1K)
#define	MCCI_STM32H7_REG_TIMER15	UINT32_C(0x40014000)	///< Section 45.5: TIMx register map (1K)
#define	MCCI_STM32H7_REG_TIMER16	UINT32_C(0x40014400)	///< Section 45.5: TIMx register map (1K)
#define	MCCI_STM32H7_REG_TIMER17	UINT32_C(0x40014800)	///< Section 45.5: TIMx register map (1K)
#define	MCCI_STM32H7_REG_SPI5		UINT32_C(0x40015000)	///< Section 55.11: SPI register map (1K)
#define	MCCI_STM32H7_REG_SAI1		UINT32_C(0x40015800)	///< Section 56.6: SAI register map (1K)
#define	MCCI_STM32H7_REG_SAI2		UINT32_C(0x40015C00)	///< Section 56.6: SAI register map (1K)
#define	MCCI_STM32H7_REG_DFSDM1		UINT32_C(0x40017800)	///< Section 33.7: 33.8: DFSDM register map (1K)
#define	MCCI_STM32H7_REG_DMA1		UINT32_C(0x40020000)	///< Section 15.5: DMA register map (1K)
#define	MCCI_STM32H7_REG_DMA2		UINT32_C(0x40020400)	///< Section 15.5: DMA register map (1K)
#define	MCCI_STM32H7_REG_DMAMUX1	UINT32_C(0x40020800)	///< Section 17.6: DMAMUX register map (1K)
#define	MCCI_STM32H7_REG_ADC1		UINT32_C(0x40022000)	///< Section 27.7: ADC register map (1K)
#define	MCCI_STM32H7_REG_CRC		UINT32_C(0x40023000)	///< Section 22.4: CRC register map (1K)
#define	MCCI_STM32H7_REG_OTG_HS		UINT32_C(0x40040000)	///< Section 62.14: OTG_HS register map (1K)
#define	MCCI_STM32H7_REG_DCMI		UINT32_C(0x48020000)	///< Section 34.5: DCMI register map (1K)
#define	MCCI_STM32H7_REG_PSSI		UINT32_C(0x48020400)	///< Section 35.5: PSSI register map (1K)
#define	MCCI_STM32H7_REG_HSEM		UINT32_C(0x48020800)	///< Section 10.4: HSEM register map (1K)
#define	MCCI_STM32H7_REG_CRYPTO		UINT32_C(0x48021000)	///< Section 39.7: CRYPTO register map (1K)
#define	MCCI_STM32H7_REG_HASH		UINT32_C(0x48021400)	///< Section 40.7: HASH register map (1K)
#define	MCCI_STM32H7_REG_RNG		UINT32_C(0x48021800)	///< Section 38.7: RNG register map (1K)
#define	MCCI_STM32H7_REG_SDMMC2		UINT32_C(0x48022400)	///< Section 60.10: SDMMC register map (1K)
#define	MCCI_STM32H7_REG_DLYB_SDMMC2	UINT32_C(0x48022800)	///< Section 26.4: DLYB register map (1K)
#define	MCCI_STM32H7_REG_BDMA1		UINT32_C(0x48022C00)	///< Section 16.6: BDMA register map (1K)
#define	MCCI_STM32H7_REG_LTDC		UINT32_C(0x50001000)	///< Section 36.7: LTDC register map (4K)
#define	MCCI_STM32H7_REG_WWDG		UINT32_C(0x50003000)	///< Section 48.4: WWDG register map (4K)
#define	MCCI_STM32H7_REG_GPV		UINT32_C(0x51000000)	///< Section 2.2.4: AXI interconnect register map (1M)
#define	MCCI_STM32H7_REG_MDMA		UINT32_C(0x52000000)	///< Section 14.5: MDMA register map (4K)
#define	MCCI_STM32H7_REG_DMA2D		UINT32_C(0x52001000)	///< Section 18.5: DMA2D register map (4K)
#define	MCCI_STM32H7_REG_FLASH		UINT32_C(0x52002000)	///< Section 4.9: FLASH register map (4K)
#define	MCCI_STM32H7_REG_JPEG		UINT32_C(0x52003000)	///< Section 4.9: JPEG register map (4K)
#define	MCCI_STM32H7_REG_FMC		UINT32_C(0x52004000)	///< Section 23.7.6: 23.8.7: 23.9.5: FMC register map (4K)
#define	MCCI_STM32H7_REG_OCTOSPI1	UINT32_C(0x52005000)	///< Section 24.7: OCTOSPI register map (4K)
#define	MCCI_STM32H7_REG_DLYB_OCTOSPI1	UINT32_C(0x52006000)	///< Section 26.4: DLYB register map (4K)
#define	MCCI_STM32H7_REG_SDMMC1		UINT32_C(0x52007000)	///< Section 60.10: SDMMC register map (4K)
#define	MCCI_STM32H7_REG_DLYB_SDMMC1	UINT32_C(0x52008000)	///< Section 26.4: DLYB register map (1K)
#define	MCCI_STM32H7_REG_RAMECC		UINT32_C(0x52009000)	///< Section 3.4: RAMECC register map (1K)
#define	MCCI_STM32H7_REG_OCTOSPI2	UINT32_C(0x5200A000)	///< Section 24.7: OCTOSPI register map (4K)
#define	MCCI_STM32H7_REG_DLYB_OCTOSPI2	UINT32_C(0x5200B000)	///< Section 26.4: DLYB register map (1K)
#define	MCCI_STM32H7_REG_OTCOSPIM	UINT32_C(0x5200B400)	///< Section 25.4: OTCOSPIM register map (1K)
#define	MCCI_STM32H7_REG_OTFDEC1	UINT32_C(0x5200B800)	///< Section 41.6: OTFDEC register map (1K)
#define	MCCI_STM32H7_REG_OTFDEC2	UINT32_C(0x5200BC00)	///< Section 41.6: OTFDEC register map (1K)
#define	MCCI_STM32H7_REG_GFXMMU		UINT32_C(0x5200C000)	///< Section 21.5: GFXMMU register map (8K)
#define	MCCI_STM32H7_REG_EXTI		UINT32_C(0x58000000)	///< Section 20.6: EXTI register map (1K)
#define	MCCI_STM32H7_REG_SYSCFG		UINT32_C(0x58000400)	///< Section 12.4: SYSCFG register map (1K)
#define	MCCI_STM32H7_REG_LPUART1	UINT32_C(0x58000C00)	///< Section 54.6: LPUART register map (1K)
#define	MCCI_STM32H7_REG_SPI6		UINT32_C(0x58001400)	///< Section 55.11: SPI register map (1K)
#define	MCCI_STM32H7_REG_I2S6		UINT32_C(0x58001400)	///< Section 55.11: I2S register map (1K)
#define	MCCI_STM32H7_REG_I2C4		UINT32_C(0x58001C00)	///< Section 52.7: I2C register map (1K)
#define	MCCI_STM32H7_REG_LPTIM2		UINT32_C(0x58002400)	///< Section 47.7: LPTIM register map (1K)
#define	MCCI_STM32H7_REG_LPTIM3		UINT32_C(0x58002800)	///< Section 47.7: LPTIM register map (1K)
#define	MCCI_STM32H7_REG_DAC2		UINT32_C(0x58003400)	///< Section 29.7: DAC register map (1K)
#define	MCCI_STM32H7_REG_COMP		UINT32_C(0x58003800)	///< Section 31.6: COMP register map (1K)
#define	MCCI_STM32H7_REG_VREF		UINT32_C(0x58003C00)	///< Section 30.3: VREF register map (1K)
#define	MCCI_STM32H7_REG_RTC		UINT32_C(0x58004000)	///< Section 50.6: RTC register map (1K)
#define	MCCI_STM32H7_REG_TAMP		UINT32_C(0x58004400)	///< Section 51.6: TAMP register map (1K)
#define	MCCI_STM32H7_REG_IWDG		UINT32_C(0x58004800)	///< Section 49.4: IWDG register map (1K)
#define	MCCI_STM32H7_REG_DTS		UINT32_C(0x58006800)	///< Section 28.6: DTS register map (1K)
#define	MCCI_STM32H7_REG_DFSDM2		UINT32_C(0x58006C00)	///< Section 33.7: DFSDM register map (1K)
#define	MCCI_STM32H7_REG_GPIOA		UINT32_C(0x58020000)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOB		UINT32_C(0x58020400)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOC		UINT32_C(0x58020800)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOD		UINT32_C(0x58020C00)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOE		UINT32_C(0x58021000)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOF		UINT32_C(0x58021400)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOG		UINT32_C(0x58021800)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOH		UINT32_C(0x58021C00)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOI		UINT32_C(0x58022000)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOJ		UINT32_C(0x58022400)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_GPIOK		UINT32_C(0x58022800)	///< Section 11.4: GPIO register map (1K)
#define	MCCI_STM32H7_REG_RCC		UINT32_C(0x58024400)	///< Section 8.7: RCC register map (1K)
#define	MCCI_STM32H7_REG_PWR		UINT32_C(0x58024800)	///< Section 6.8: PWR register map (1K)
#define	MCCI_STM32H7_REG_BDMA2		UINT32_C(0x58025400)	///< Section 16.6: BDMA register map (1K)
#define	MCCI_STM32H7_REG_DMAMUX2	UINT32_C(0x58025800)	///< Section 17.6: DMAMUX register map (1K)
///	@}

/****************************************************************************\
|
|	Option bytes, etc
|
\****************************************************************************/

/// \name System values in system option memory
///	@{
#define	MCCI_STM32H7_OPTIONS_U_ID_0	UINT32_C(0x08FFF800)			///< register address: unique ID bits 31:0
#define	MCCI_STM32H7_OPTIONS_U_ID_4	(MCCI_STM32H7_OPTIONS_U_ID_0 + 0x04)	///< register address: unique ID bits 63:32
#define	MCCI_STM32H7_OPTIONS_U_ID_8	(MCCI_STM32H7_OPTIONS_U_ID_0 + 0x08)	///< register address: unique ID bits 95:64

#define	MCCI_STM32H7_OPTIONS_SYSTEM_FLASH_SIZE	UINT32_C(0x08FFF80C)	///< memory size in k bytes (16 bits)

/// \brief convert flash_size_16 value to bytes
#define	MCCI_STM32H7_OPTIONS_SYSTEM_FLASH_SIZE_TO_BYTES(h)	\
	((h) & UINT32_C(0xFFFF)) == UINT32_C(0xFFFF)		\
		? UINT32_C(0x200000)				\
		: ((h) & UINT32_C(0xFFFF)) == UINT32_C(0)	\
			? UINT32_C(0x200000)			\
			: (((h) & UINT32_C(0xFFFF)) * 1024)

