mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
#define	MCCI_STM32H7_OPTIONS_PACKAGE_DATA	UINT32_C(0x08FFF80E)	///< package data (16 bits)
///	@}

/****************************************************************************\
|
|	Flash Control Registers (3.7)
|
\****************************************************************************/

/// \name FLASH registers
///	@{
#define MCCI_STM32H7_REG_FLASH_ACR		(MCCI_STM32H7_REG_FLASH + 0x000) ///< Flash access control register
#define MCCI_STM32H7_REG_FLASH_KEYR1		(MCCI_STM32H7_REG_FLASH + 0x004) ///< Flash key register for bank 1
#define MCCI_STM32H7_REG_FLASH_OPTKEYR		(MCCI_STM32H7_REG_FLASH + 0x008) ///< Flash option key register
#define MCCI_STM32H7_REG_FLASH_CR1		(MCCI_STM32H7_REG_FLASH + 0x00C) ///< Flash control register for bank 1
#define MCCI_STM32H7_REG_FLASH_SR1		(MCCI_STM32H7_REG_FLASH + 0x010) ///< Flash status register for bank 1
#define MCCI_STM32H7_REG_FLASH_CCR1		(MCCI_STM32H7_REG_FLASH + 0x014) ///< Flash clear control register for bank 1
#define MCCI_STM32H7_REG_FLASH_OPTCR		(MCCI_STM32H7_REG_FLASH + 0x018) ///< Flash option control register
#define MCCI_STM32H7_REG_FLASH_OPTSR_CUR	(MCCI_STM32H7_REG_FLASH + 0x01C) ///< Flash option status register
#define MCCI_STM32H7_REG_FLASH_OPTSR_PRG	(MCCI_STM32H7_REG_FLASH + 0x020) ///< Flash option status register
#define MCCI_STM32H7_REG_FLASH_OPTCCR		(MCCI_STM32H7_REG_FLASH + 0x024) ///< Flash option clear control register
#define MCCI_STM32H7_REG_FLASH_PRAR_CUR1	(MCCI_STM32H7_REG_FLASH + 0x028) ///< Flash protection address for bank 1
#define MCCI_STM32H7_REG_FLASH_PRAR_PRG1	(MCCI_STM32H7_REG_FLASH + 0x02C) ///< Flash protection address for bank 1
#define MCCI_STM32H7_REG_FLASH_SCAR_CUR1	(MCCI_STM32H7_REG_FLASH + 0x030) ///< Flash secure address for bank 1
#define MCCI_STM32H7_REG_FLASH_SCAR_PRG1	(MCCI_STM32H7_REG_FLASH + 0x034) ///< Flash secure address for bank 1
#define MCCI_STM32H7_REG_FLASH_WPSGN_CUR1	(MCCI_STM32H7_REG_FLASH + 0x038) ///< Flash write sector group protection for bank 1
#define MCCI_STM32H7_REG_FLASH_WPSGN_PRG1	(MCCI_STM32H7_REG_FLASH + 0x03C) ///< Flash write sector group protection for bank 1
#define MCCI_STM32H7_REG_FLASH_BOOT_CUR		(MCCI_STM32H7_REG_FLASH + 0x040) ///< Flash boot address
#define MCCI_STM32H7_REG_FLASH_BOOT_PRG		(MCCI_STM32H7_REG_FLASH + 0x044) ///< Flash boot address
#define MCCI_STM32H7_REG_FLASH_CRCCR1		(MCCI_STM32H7_REG_FLASH + 0x050) ///< Flash CRC control register for bank 1
#define MCCI_STM32H7_REG_FLASH_CRCSADD1		(MCCI_STM32H7_REG_FLASH + 0x054) ///< Flash CRC start address register for bank 1
#define MCCI_STM32H7_REG_FLASH_CRCEADD1		(MCCI_STM32H7_REG_FLASH + 0x058) ///< Flash CRC end address register for bank 1
#define MCCI_STM32H7_REG_FLASH_CRCDATA		(MCCI_STM32H7_REG_FLASH + 0x05C) ///< Flash CRC data register
#define MCCI_STM32H7_REG_FLASH_ECC_FA1		(MCCI_STM32H7_REG_FLASH + 0x060) ///< Flash ECC fail address for bank 1
#define MCCI_STM32H7_REG_FLASH_OTPBL_CUR	(MCCI_STM32H7_REG_FLASH + 0x068) ///< Flash OTP block lock
#define MCCI_STM32H7_REG_FLASH_OTPBL_PRG	(MCCI_STM32H7_REG_FLASH + 0x06C) ///< Flash OTP block lock
#define MCCI_STM32H7_REG_FLASH_KEYR2		(MCCI_STM32H7_REG_FLASH + 0x104) ///< Flash key register for bank 2
#define MCCI_STM32H7_REG_FLASH_CR2		(MCCI_STM32H7_REG_FLASH + 0x10C) ///< Flash control register for bank 2
#define MCCI_STM32H7_REG_FLASH_SR2		(MCCI_STM32H7_REG_FLASH + 0x110) ///< Flash status register  for bank 2
#define MCCI_STM32H7_REG_FLASH_CCR2		(MCCI_STM32H7_REG_FLASH + 0x114) ///< Flash clear control register for bank 2
#define MCCI_STM32H7_REG_FLASH_PRAR_CUR2	(MCCI_STM32H7_REG_FLASH + 0x128) ///< Flash protection address for bank 2
#define MCCI_STM32H7_REG_FLASH_PRAR_PRG2	(MCCI_STM32H7_REG_FLASH + 0x12C) ///< Flash protection address for bank 2
#define MCCI_STM32H7_REG_FLASH_SCAR_CUR2	(MCCI_STM32H7_REG_FLASH + 0x130) ///< Flash secure address for bank 2
#define MCCI_STM32H7_REG_FLASH_SCAR_PRG2	(MCCI_STM32H7_REG_FLASH + 0x134) ///< Flash secure address for bank 2
#define MCCI_STM32H7_REG_FLASH_WPSGN_CUR2	(MCCI_STM32H7_REG_FLASH + 0x138) ///< Flash write sector group protection for bank 2
#define MCCI_STM32H7_REG_FLASH_WPSGN_PRG2	(MCCI_STM32H7_REG_FLASH + 0x13C) ///< Flash write sector group protection for bank 2
#define MCCI_STM32H7_REG_FLASH_CRCCR2		(MCCI_STM32H7_REG_FLASH + 0x150) ///< Flash CRC control register for bank 2
#define MCCI_STM32H7_REG_FLASH_CRCSADD2		(MCCI_STM32H7_REG_FLASH + 0x154) ///< Flash CRC start address register for bank 2
#define MCCI_STM32H7_REG_FLASH_CRCEADD2		(MCCI_STM32H7_REG_FLASH + 0x158) ///< Flash CRC end address register for bank 2
#define MCCI_STM32H7_REG_FLASH_ECC_FA2		(MCCI_STM32H7_REG_FLASH + 0x160) ///< Flash ECC fail address for bank 2
///	@}

/// \name FLASH_ACR bits
///	@{
#define MCCI_STM32H7_REG_FLASH_ACR_RSV6			UINT32_C(0xFFFFFFC0)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_ACR_WRHIGHFREQ		(UINT32_C(3) << 4)	///< Flash signal delay
#define MCCI_STM32H7_REG_FLASH_ACR_WRHIGHFREQ_V(n)	(UINT32_C(n) << 4)	///< Flash signal delay
#define MCCI_STM32H7_REG_FLASH_ACR_LATENCY		(UINT32_C(0xF) << 0)	///< Read latency:
#define MCCI_STM32H7_REG_FLASH_ACR_LATENCY_V(n)		(UINT32_C(n) << 0)	///< Read latency: n wait state
///	@}

/// \name FLASH_KEYR1, FLASH_KEYR2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_KEYR_UNLOCK1	UINT32_C(0x45670123)	///< unlock word 1 for FLASH_CR1
#define MCCI_STM32H7_REG_FLASH_KEYR_UNLOCK2	UINT32_C(0xCDEF89AB)	///< unlock word 2 for FLASH_CR1
///	@}

/// \name FLASH_OPTKEYR bits
///	@{
#define MCCI_STM32H7_REG_FLASH_OPTKEYR_UNLOCK1	UINT32_C(0x08192A3B)	///< unlock word 1 for option bytes
#define MCCI_STM32H7_REG_FLASH_OPTKEYR_UNLOCK2	UINT32_C(0x4C5D6E7F)	///< unlock word 2 for option bytes
///	@}

/// \name FLASH_CR1, FLASH_CR2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_CR_RSV29		(UINT32_C(7) << 29)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CR_CRCRDERRIE	(UINT32_C(1) << 28)	///< ECC CRC read error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_CRCENDIE	(UINT32_C(1) << 27)	///< CRC end of calculation interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_DBECCERRIE	(UINT32_C(1) << 26)	///< ECC double detection error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_SNECCERRIE	(UINT32_C(1) << 25)	///< ECC single correction error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_RDSERRIE	(UINT32_C(1) << 24)	///< secure error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_RDPERRIE	(UINT32_C(1) << 23)	///< read protection error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_RSV22		(UINT32_C(1) << 22)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CR_INCERRIE	(UINT32_C(1) << 21)	///< inconsistency error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_RSV20		(UINT32_C(1) << 20)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CR_STRBERRIE	(UINT32_C(1) << 19)	///< strobe error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_PGSERRIE	(UINT32_C(1) << 18)	///< programming sequence error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_WRPERRIE	(UINT32_C(1) << 17)	///< write protection error interrupt enable
#define MCCI_STM32H7_REG_FLASH_CR_EOPIE		(UINT32_C(1) << 16)	///< End-of-program interrupt control
#define MCCI_STM32H7_REG_FLASH_CR_CRC_EN	(UINT32_C(1) << 15)	///< CRC control
#define MCCI_STM32H7_REG_FLASH_CR_RSV13		(UINT32_C(3) << 13)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CR_SSN		(UINT32_C(0x7F) << 6)	///< Sector erase selection number
#define MCCI_STM32H7_REG_FLASH_CR_SSN_N(n)	((n) << 6)		///< Sector erase selection number
#define MCCI_STM32H7_REG_FLASH_CR_START		(UINT32_C(1) << 5)	///< Erase start control
#define MCCI_STM32H7_REG_FLASH_CR_FW		(UINT32_C(1) << 4)	///< Write forcing control
#define MCCI_STM32H7_REG_FLASH_CR_BER		(UINT32_C(1) << 3)	///< Bank erase request
#define MCCI_STM32H7_REG_FLASH_CR_SER		(UINT32_C(1) << 2)	///< Sector erase request
#define MCCI_STM32H7_REG_FLASH_CR_PG		(UINT32_C(1) << 1)	///< Internal buffer control
#define MCCI_STM32H7_REG_FLASH_CR_LOCK		(UINT32_C(1) << 0)	///< Lock the FLASH_CR register
///	@}

/// \name FLASH_SR1, FLASH_SR2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_SR_RSV29		(UINT32_C(7) << 29)	///< Reserved, don't change.
#define MCCI_STM32H7_REG_FLASH_SR_CRCRDERR	(UINT32_C(1) << 28)	///< ECC CRC read error flag
#define MCCI_STM32H7_REG_FLASH_SR_CRCEND	(UINT32_C(1) << 27)	///< CRC end of calculation flag
#define MCCI_STM32H7_REG_FLASH_SR_DBECCERR	(UINT32_C(1) << 26)	///< ECC double detection error flag
#define MCCI_STM32H7_REG_FLASH_SR_SNECCERR	(UINT32_C(1) << 25)	///< ECC single correction error flag
#define MCCI_STM32H7_REG_FLASH_SR_RDSERR	(UINT32_C(1) << 24)	///< secure error flag
#define MCCI_STM32H7_REG_FLASH_SR_RDPERR	(UINT32_C(1) << 23)	///< read protection error flag
#define MCCI_STM32H7_REG_FLASH_SR_RSV22		(UINT32_C(1) << 22)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_SR_INCERR	(UINT32_C(1) << 21)	///< inconsistency error flag
#define MCCI_STM32H7_REG_FLASH_SR_RSV20		(UINT32_C(1) << 20)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_SR_STRBERR	(UINT32_C(1) << 19)	///< strobe error flag
#define MCCI_STM32H7_REG_FLASH_SR_PGSERR	(UINT32_C(1) << 18)	///< programming sequence error flag
#define MCCI_STM32H7_REG_FLASH_SR_WRPERR	(UINT32_C(1) << 17)	///< write protection error flag
#define MCCI_STM32H7_REG_FLASH_SR_EOP		(UINT32_C(1) << 16)	///< End-of-program flag
#define MCCI_STM32H7_REG_FLASH_SR_RSV4		(UINT32_C(0xFFF) << 4)	///< Reserved, don't change.
#define MCCI_STM32H7_REG_FLASH_SR_CRC_BUSY	(UINT32_C(1) << 3)	///< CRC busy flag
#define MCCI_STM32H7_REG_FLASH_SR_QW		(UINT32_C(1) << 2)	///< wait queue flag
#define MCCI_STM32H7_REG_FLASH_SR_WBNE		(UINT32_C(1) << 1)	///< write buffer not empty flag
#define MCCI_STM32H7_REG_FLASH_SR_BSY		(UINT32_C(1) << 0)	///< Busy flag
///	@}

/// \name FLASH_CCR1, FLASH_CCR2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_CCR_RSV29	(UINT32_C(7) << 29)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CCR_CRCRDERR	(UINT32_C(1) << 28)	///< CRCRDERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_CRCEND	(UINT32_C(1) << 27)	///< CRCEND flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_DBECCERR	(UINT32_C(1) << 26)	///< DBECCERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_SNECCERR	(UINT32_C(1) << 25)	///< SNECCERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_RDSERR	(UINT32_C(1) << 24)	///< RDSERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_RDPERR	(UINT32_C(1) << 23)	///< RDPERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_RSV22	(UINT32_C(1) << 22)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CCR_INCERR	(UINT32_C(1) << 21)	///< INCERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_RSV20	(UINT32_C(1) << 20)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CCR_STRBERR	(UINT32_C(1) << 19)	///< STRBERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_PGSERR	(UINT32_C(1) << 18)	///< PGSERR flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_EOP		(UINT32_C(1) << 16)	///< EOP flag clear
#define MCCI_STM32H7_REG_FLASH_CCR_RSV0		(UINT32_C(0xFFFF) << 0)	///< Reserved, don't change
///	@}

