mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name FLASH_OPTCR bits
///	@{
#define MCCI_STM32H7_REG_FLASH_OPTCR_SWAP_BANK		(UINT32_C(1) << 31)	///< Bank swapping option configuration
#define MCCI_STM32H7_REG_FLASH_OPTCR_OPTCHANGEERRIE	(UINT32_C(1) << 30)	///< Option byte change error interrupt enable
#define MCCI_STM32H7_REG_FLASH_OPTCR_RSV29		(UINT32_C(1) << 29)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_OPTCR_PG_OTP		(UINT32_C(1) << 5)	///< OTP program control
#define MCCI_STM32H7_REG_FLASH_OPTCR_MER		(UINT32_C(1) << 4)	///< mass erase request
#define MCCI_STM32H7_REG_FLASH_OPTCR_RSV22		(UINT32_C(3) << 2)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_OPTCR_OPTSTART		(UINT32_C(1) << 1)	///< Option byte start change option configuration
#define MCCI_STM32H7_REG_FLASH_OPTCR_OPTLOCK		(UINT32_C(1) << 0)	///< FLASH_OPTCR lock option configuration
///	@}

/// \name FLASH_OPTSR_CUR, FLASH_OPTSR_PRG bits
///	@{
#define	MCCI_STM32H7_REG_FLASH_OPTSR_SWAP_BANK_OPT	(UINT32_C(1) << 31)	///< Bank swapping option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_OPTCHANGEERR	(UINT32_C(1) << 30)	///< Option byte change error flag
#define	MCCI_STM32H7_REG_FLASH_OPTSR_VDDIO_HSLV		(UINT32_C(1) << 29)	///< VDD I/O high-speed at low-voltage status
#define MCCI_STM32H7_REG_FLASH_OPTSR_RSV26		(UINT32_C(7) << 26)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_OPTSR_RSV22		(UINT32_C(0xF) << 22)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_OPTSR_SECURITY		(UINT32_C(1) << 21)	///< Security enable option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_ST_RAM_SIZE	(UINT32_C(3) << 19)	///< ST RAM size option
#define	MCCI_STM32H7_REG_FLASH_OPTSR_ST_RAM_SIZE_2KB	(UINT32_C(0) << 19)	///< 2KB reserved to ST code
#define	MCCI_STM32H7_REG_FLASH_OPTSR_ST_RAM_SIZE_4KB	(UINT32_C(1) << 19)	///< 2KB reserved to ST code
#define	MCCI_STM32H7_REG_FLASH_OPTSR_ST_RAM_SIZE_8KB	(UINT32_C(2) << 19)	///< 2KB reserved to ST code
#define	MCCI_STM32H7_REG_FLASH_OPTSR_ST_RAM_SIZE_16KB	(UINT32_C(3) << 19)	///< 2KB reserved to ST code
#define	MCCI_STM32H7_REG_FLASH_OPTSR_IWDG_FZ_SDBY	(UINT32_C(1) << 18)	///< IWDG Standby mode freeze option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_IWDG_FZ_STOP	(UINT32_C(1) << 17)	///< IWDG Stop mode freeze option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_VDDMMC_HSLV	(UINT32_C(1) << 16)	///< VDDMMC I/O high-speed at low-voltage status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_RDP		(UINT32_C(0xFF) << 8)	///< Readout protection level option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_RDP_LEVEL_0	(UINT32_C(0xAA) << 8)	///< global readout protection level 0
#define	MCCI_STM32H7_REG_FLASH_OPTSR_RDP_LEVEL_2	(UINT32_C(0xCC) << 8)	///< global readout protection level 2
#define	MCCI_STM32H7_REG_FLASH_OPTSR_RDP_LEVEL_1	(UINT32_C(0xBB) << 8)	///< others values: global readout protection level 1
#define	MCCI_STM32H7_REG_FLASH_OPTSR_NRST_STDY		(UINT32_C(1) << 7)	///< Core domain Standby entry reset option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_NRST_STOP		(UINT32_C(1) << 6)	///< Core domain DStop entry reset option status
#define MCCI_STM32H7_REG_FLASH_OPTSR_RSV5		(UINT32_C(1) << 5)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_OPTSR_IWDG_SW		(UINT32_C(1) << 4)	///< IWDG control mode option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_BOR_LEV		(UINT32_C(3) << 2)	///< Brownout level option status
#define	MCCI_STM32H7_REG_FLASH_OPTSR_BOR_LEV_OFF	(UINT32_C(0) << 2)	///< BOR OFF
#define	MCCI_STM32H7_REG_FLASH_OPTSR_BOR_LEV_1		(UINT32_C(1) << 2)	///< BOR Level 1, the threshold level is low (around 2.1 V)
#define	MCCI_STM32H7_REG_FLASH_OPTSR_BOR_LEV_2		(UINT32_C(2) << 2)	///< BOR Level 2, the threshold level is medium (around 2.4 V)
#define	MCCI_STM32H7_REG_FLASH_OPTSR_BOR_LEV_3		(UINT32_C(3) << 2)	///< BOR Level 3, the threshold level is high (around 2.7 V)
#define MCCI_STM32H7_REG_FLASH_OPTSR_RSV1		(UINT32_C(1) << 1)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_OPTSR_OPT_BUSY		(UINT32_C(1) << 0)	///< Option byte change ongoing flag
///	@}

/// \name FLASH_OPTCCR bits
///	@{
#define MCCI_STM32H7_REG_FLASH_OPTCCR_RSV31		(UINT32_C(1) << 31)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_OPTCCR_OPTCHANGEERR	(UINT32_C(1) << 30)	///< OPTCHANGEERR reset
#define MCCI_STM32H7_REG_FLASH_OPTCCR_RSV0		(0x3FFFFFFF)		///< Reserved, don't change
///	@}

/// \name FLASH_PRAR_CUR1, FLASH_PRAR_PRG1, FLASH_PRAR_CUR2, FLASH_PRAR_PRG2 bits
///	@{
#define	MCCI_STM32H7_REG_FLASH_PRAR_DMEP		(UINT32_C(1) << 31)	///< PCROP protected erase enable option status
#define MCCI_STM32H7_REG_FLASH_PRAR_RSV28		(UINT32_C(7) << 28)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_PRAR_PROT_AREA_END	(UINT32_C(0xFFF) << 16)	///< PCROP area end status
#define MCCI_STM32H7_REG_FLASH_PRAR_RSV12		(UINT32_C(15) << 12)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_PRAR_PROT_AREA_START	(UINT32_C(0xFFF) << 0)	///< PCROP area start status
///	@}

/// \name FLASH_SCAR_CUR1, FLASH_SCAR_PRG1, FLASH_SCAR_CUR2, FLASH_SCAR_PRG2 bits
///	@{
#define	MCCI_STM32H7_REG_FLASH_SCAR_DMES		(UINT32_C(1) << 31)	///< secure access protected erase enable option status
#define MCCI_STM32H7_REG_FLASH_SCAR_RSV28		(UINT32_C(7) << 28)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_SCAR_SEC_AREA_END	(UINT32_C(0xFFF) << 16)	///< secure-only area end status
#define MCCI_STM32H7_REG_FLASH_SCAR_RSV12		(UINT32_C(15) << 12)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_SCAR_SEC_AREA_START	(UINT32_C(0xFFF) << 0)	///< secure-only area start status
///	@}

/// \name FLASH_WPSGN_CUR1, FLASH_WPSGN_PRG1, FLASH_WPSGN_CUR2, FLASH_WPSGN_PRG2 bits
///	@{
#define	MCCI_STM32H7_REG_FLASH_WPSGN_SECT(n)		(UINT32_C(1) << (((n) & 127) >> 2))	///< Group embedding sectors
///	@}

/// \name FLASH_BOOT_CUR, FLASH_BOOT_PRG bits
///	@{
#define	MCCI_STM32H7_REG_FLASH_BOOT_ADD1	(UINT32_C(0xFFFF) << 16)	///< boot address 1
#define	MCCI_STM32H7_REG_FLASH_BOOT_ADD0	(UINT32_C(0xFFFF) << 0)		///< boot address 0
///	@}

/// \name FLASH_CRCCR1, FLASH_CRCCR2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_CRCCR_RSV23		(UINT32_C(0x1FF) << 23)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_CRCCR_ALL_BANK		(UINT32_C(1) << 22)	///< all CRC select
#define MCCI_STM32H7_REG_FLASH_CRCCR_CRC_BURST		(UINT32_C(3) << 20)	///< CRC burst size
#define MCCI_STM32H7_REG_FLASH_CRCCR_RSV18		(UINT32_C(3) << 18)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_CRCCR_CLEAN_CRC		(UINT32_C(1) << 17)	///< CRC clear bit
#define	MCCI_STM32H7_REG_FLASH_CRCCR_START_CRC		(UINT32_C(1) << 16)	///< CRC start bit
#define MCCI_STM32H7_REG_FLASH_CRCCR_RSV11		(UINT32_C(0x1F) << 11)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_CRCCR_CLEAN_SECT		(UINT32_C(1) << 10)	///< CRC sector list clear bit
#define	MCCI_STM32H7_REG_FLASH_CRCCR_ADD_SECT		(UINT32_C(1) << 9)	///< CRC sector select bit
#define	MCCI_STM32H7_REG_FLASH_CRCCR_CRC_BY_SECT	(UINT32_C(1) << 8)	///< CRC sector mode select bit
#define MCCI_STM32H7_REG_FLASH_CRCCR_RSV7		(UINT32_C(1) << 7)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_FLASH_CRCCR_CRC_SECT		(UINT32_C(0x7F) << 0)	///< CRC sector number
///	@}

