mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name FLASH_CRCSADD1, FLASH_CRCSADD2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_CRCSADD_RSV20		(UINT32_C(0xFFF) << 20)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CRCSADD_CRC_START_ADDR	(UINT32_C(0x3FFFF) << 2) ///< CRC start address on bank 1/2
#define MCCI_STM32H7_REG_FLASH_CRCSADD_RSV0		(UINT32_C(3) << 0)	///< Reserved, don't change
///	@}

/// \name FLASH_CRCEADD1, FLASH_CRCEADD2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_CRCEADD_RSV20		(UINT32_C(0xFFF) << 20)	///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_CRCEADD_CRC_START_ADDR	(UINT32_C(0x3FFFF) << 2) ///< CRC end address on bank 1/2
#define MCCI_STM32H7_REG_FLASH_CRCEADD_RSV0		(UINT32_C(3) << 0)	///< Reserved, don't change
///	@}

/// \name FLASH_ECC_FA1, FLASH_ECC_FA2 bits
///	@{
#define MCCI_STM32H7_REG_FLASH_ECC_FA_OTP_FAIL_ECC	(UINT32_C(1) << 31)	///< OTP ECC error bit
#define MCCI_STM32H7_REG_FLASH_ECC_FA_RSV16		(UINT32_C(0x7FFF) << 16) ///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_ECC_FA_FAIL_ECC_ADDR	(UINT32_C(0xFFFF) << 0) ///< ECC error address
///	@}

/// \name FLASH_OTPBL_CUR, FLASH_OTPBL_PRG bits
///	@{
#define MCCI_STM32H7_REG_FLASH_OTPBL_RSV16		(UINT32_C(0xFFFF) << 16) ///< Reserved, don't change
#define MCCI_STM32H7_REG_FLASH_OTPBL_LOCKBL		(UINT32_C(0xFFFF) << 0) ///< OTP Block Lock
///	@}

/// \name Flash programming constants
///	@{
#define MCCI_STM32H7_FLASH_SECTOR_SIZE		UINT32_C(8192)	///< size in bytes of a sector
#define MCCI_STM32H7_FLASH_PROGRAM_FLASH_SIZE	UINT32_C(16)	///< size in bytes of a FLASH program
#define MCCI_STM32H7_FLASH_PROGRAM_OTP_SIZE	UINT32_C(2)	///< size in bytes of a FLASH program

#define	MCCI_STM32H7_FLASH_IS_VALID(f)		((f) >= MCCI_STM32H7_MEMORY_FLASH && (f) <= MCCI_STM32H7_MEMORY_FLASH_END)
#define	MCCI_STM32H7_FLASH_IS_BANK2(f)		((f) & UINT32_C(0x100000))
#define	MCCI_STM32H7_FLASH_GET_BANK(f)		(((f) >> 20) & 1)
#define	MCCI_STM32H7_FLASH_GET_SECTOR(f)	(((f) >> 13) & 0x7F)
///	@}

/****************************************************************************\
|
|	Power Control Registers
|
\****************************************************************************/

/// \name PWR registers
///	@{
#define	MCCI_STM32H7_REG_PWR_CR1	(MCCI_STM32H7_REG_PWR + 0x00)	///< control
#define	MCCI_STM32H7_REG_PWR_CSR1	(MCCI_STM32H7_REG_PWR + 0x04)	///< control status
#define	MCCI_STM32H7_REG_PWR_CR2	(MCCI_STM32H7_REG_PWR + 0x08)	///< control 2
#define	MCCI_STM32H7_REG_PWR_CR3	(MCCI_STM32H7_REG_PWR + 0x0C)	///< control 3
#define	MCCI_STM32H7_REG_PWR_CPUCR	(MCCI_STM32H7_REG_PWR + 0x10)	///< CPU control
#define	MCCI_STM32H7_REG_PWR_SRDCR	(MCCI_STM32H7_REG_PWR + 0x18)	///< SmartRun domain control
#define	MCCI_STM32H7_REG_PWR_WKUPCR	(MCCI_STM32H7_REG_PWR + 0x20)	///< wakeup clear
#define	MCCI_STM32H7_REG_PWR_WKUPFR	(MCCI_STM32H7_REG_PWR + 0x24)	///< wakeup flag
#define	MCCI_STM32H7_REG_PWR_WKUPEPR	(MCCI_STM32H7_REG_PWR + 0x28)	///< wakeup enable and polarity
///	@}

/// \name PWR_CR1 bits
///	@{
#define	MCCI_STM32H7_REG_PWR_CR1_RSV28		(UINT32_C(15) << 28)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR1_SRDRAMSO	(UINT32_C(1) << 27)	///< SmartRun domain AHB memory shut-off in DStop/DStop2 low-power mode
#define	MCCI_STM32H7_REG_PWR_CR1_HSITFSO	(UINT32_C(1) << 26)	///< high-speed interfaces USB and FDCAN memory shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_GFXSO		(UINT32_C(1) << 25)	///< GFXMMU and JPEG memory shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_ITCMSO		(UINT32_C(1) << 24)	///< instruction TCM and ETM memory shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_AHBRAM2SO	(UINT32_C(1) << 23)	///< AHB SRAM2 shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_AHBRAM1SO	(UINT32_C(1) << 22)	///< AHB SRAM1 shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_AXIRAM3SO	(UINT32_C(1) << 21)	///< AXI SRAM3 shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_AXIRAM2SO	(UINT32_C(1) << 20)	///< AXI SRAM2 shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_AXIRAM1SO	(UINT32_C(1) << 19)	///< AXI SRAM1 shut-off in DStop/DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_ALS		(UINT32_C(3) << 17)	///< analog voltage detector level selection
#define	MCCI_STM32H7_REG_PWR_CR1_ALS_1_7V	(UINT32_C(0) << 17)	///< 1.7V
#define	MCCI_STM32H7_REG_PWR_CR1_ALS_2_1V	(UINT32_C(1) << 17)	///< 2.1V
#define	MCCI_STM32H7_REG_PWR_CR1_ALS_2_5V	(UINT32_C(2) << 17)	///< 2.5V
#define	MCCI_STM32H7_REG_PWR_CR1_ALS_2_8V	(UINT32_C(3) << 17)	///< 2.8V
#define	MCCI_STM32H7_REG_PWR_CR1_AVDEN		(UINT32_C(1) << 16)	///< peripheral voltage monitor on VDDA enable
#define	MCCI_STM32H7_REG_PWR_CR1_SVOS		(UINT32_C(3) << 14)	///< system stop mode voltage scaling selection
#define	MCCI_STM32H7_REG_PWR_CR1_SVOS_5		(UINT32_C(1) << 14)	///< SVOS5 scale 5
#define	MCCI_STM32H7_REG_PWR_CR1_SVOS_4		(UINT32_C(2) << 14)	///< SVOS5 scale 4
#define	MCCI_STM32H7_REG_PWR_CR1_SVOS_3		(UINT32_C(3) << 14)	///< SVOS5 scale 3
#define	MCCI_STM32H7_REG_PWR_CR1_AVD_READY	(UINT32_C(1) << 13)	///< analog voltage ready
#define	MCCI_STM32H7_REG_PWR_CR1_BOOSTE		(UINT32_C(1) << 12)	///< analog switch VBoost control
#define	MCCI_STM32H7_REG_PWR_CR1_RSV10		(UINT32_C(3) << 10)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR1_FLPS		(UINT32_C(1) << 9)	///< Flash memory low-power mode in DStop or DStop2 mode
#define	MCCI_STM32H7_REG_PWR_CR1_DBP		(UINT32_C(1) << 8)	///< disable Backup domain write protection
#define	MCCI_STM32H7_REG_PWR_CR1_PLS		(UINT32_C(7) << 5)	///< programmable voltage detector level selection
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_1_95V	(UINT32_C(0) << 5)	///< 1.95V
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_2_1V	(UINT32_C(1) << 5)	///< 2.1V
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_2_25V	(UINT32_C(2) << 5)	///< 2.25V
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_2_4V	(UINT32_C(3) << 5)	///< 2.4V
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_2_55V	(UINT32_C(4) << 5)	///< 2.55V
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_2_7V	(UINT32_C(5) << 5)	///< 2.7V
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_2_85V	(UINT32_C(6) << 5)	///< 2.85V
#define	MCCI_STM32H7_REG_PWR_CR1_PLS_PVD_IN	(UINT32_C(7) << 5)	///< PVD_IN pin
#define	MCCI_STM32H7_REG_PWR_CR1_PVDE		(UINT32_C(1) << 4)	///< programmable voltage detector enable
#define	MCCI_STM32H7_REG_PWR_CR1_RSV1		(UINT32_C(7) << 1)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR1_LPDS		(UINT32_C(1) << 0)	///< low-power Deepsleep with SVOS3
/// @}

/// \name PWR_CSR1 bits
///	@{
#define MCCI_STM32H7_REG_PWR_CSR1_RSV18		UINT32C(0xFFFC0000)	///< reserved, do not change
#define MCCI_STM32H7_REG_PWR_CSR1_MMCVDO	(UINT32_C(1) << 17)	///< voltage detector output on VDDMMC
#define MCCI_STM32H7_REG_PWR_CSR1_AVDO		(UINT32_C(1) << 16)	///< analog voltage detector output on VDDA
#define MCCI_STM32H7_REG_PWR_CSR1_ACTVOS	(UINT32_C(3) << 14)	///< VOS currently applied for VCORE voltage scaling selection
#define MCCI_STM32H7_REG_PWR_CSR1_ACTVOSRDY	(UINT32_C(1) << 13)	///< Regulator low-power flag
#define MCCI_STM32H7_REG_PWR_CSR1_RSV5		(UINT32_C(0xFF) << 5)	///< Reserved, do not change
#define MCCI_STM32H7_REG_PWR_CSR1_PVDO		(UINT32_C(1) << 4)	///< programmable voltage detect output
#define MCCI_STM32H7_REG_PWR_CSR1_RSV0		(UINT32_C(0xF) << 0)	///< Reserved, do not change
///	@}

/// \name PWR_CR2 bits
///	@{
#define	MCCI_STM32H7_REG_PWR_CR2_RSV24		(UINT32_C(0xFF) << 24)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR2_TEMPH		(UINT32_C(1) << 23)	///< temperature level monitoring versus high threshold
#define	MCCI_STM32H7_REG_PWR_CR2_TEMPL		(UINT32_C(1) << 22)	///< temperature level monitoring versus low threshold
#define	MCCI_STM32H7_REG_PWR_CR2_RSV17		(UINT32_C(0x1F) << 17)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR2_BRRDY		(UINT32_C(1) << 16)	///< backup regulator ready
#define	MCCI_STM32H7_REG_PWR_CR2_RSV5		(UINT32_C(0x7FF) << 5)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR2_MONEN		(UINT32_C(1) << 4)	///< VBAT and temperature monitoring enable
#define	MCCI_STM32H7_REG_PWR_CR2_RSV1		(UINT32_C(7) << 1)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR2_BREN		(UINT32_C(1) << 0)	///< backup regulator enable
///	@}

