mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name PWR_CR3 bits
///	@{
#define	MCCI_STM32H7_REG_PWR_CR3_RSV27		(UINT32_C(0x1F) << 27)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR3_USB33RDY	(UINT32_C(1) << 26)	///< USB supply ready
#define	MCCI_STM32H7_REG_PWR_CR3_USBREGEN	(UINT32_C(1) << 25)	///< USB regulator enable
#define	MCCI_STM32H7_REG_PWR_CR3_USB33DEN	(UINT32_C(1) << 24)	///< VDD33USB voltage level detector enable
#define	MCCI_STM32H7_REG_PWR_CR3_RSV17		(UINT32_C(0x7F) << 17)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR3_SMPSEXTRDY	(UINT32_C(1) << 16)	///< SMPS step-down converter external supply ready
#define	MCCI_STM32H7_REG_PWR_CR3_RSV10		(UINT32_C(0x3F) << 10)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR3_VBRS		(UINT32_C(1) << 9)	///< VBAT charging resistor selection
#define	MCCI_STM32H7_REG_PWR_CR3_VBE		(UINT32_C(1) << 8)	///< VBAT charging enable
#define	MCCI_STM32H7_REG_PWR_CR3_RSV6		(UINT32_C(3) << 6)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CR3_SMPSLEVEL	(UINT32_C(3) << 4)	///< SMPS step-down converter voltage output level selection
#define	MCCI_STM32H7_REG_PWR_CR3_SMPSLEVEL_1_8V	(UINT32_C(1) << 4)	///< 1.8V
#define	MCCI_STM32H7_REG_PWR_CR3_SMPSLEVEL_2_5V	(UINT32_C(2) << 4)	///< 2.5V
#define	MCCI_STM32H7_REG_PWR_CR3_SMPSLEVEL_2V5	(UINT32_C(3) << 4)	///< 2.5V
#define	MCCI_STM32H7_REG_PWR_CR3_SMPSEXTHP	(UINT32_C(1) << 3)	///< SMPS step-down converter external power delivery selection
#define	MCCI_STM32H7_REG_PWR_CR3_SMPSEN		(UINT32_C(1) << 2)	///< SMPS step-down converter enable
#define	MCCI_STM32H7_REG_PWR_CR3_LDOEN		(UINT32_C(1) << 1)	///< low drop-out regulator enable
#define	MCCI_STM32H7_REG_PWR_CR3_BYPASS		(UINT32_C(1) << 0)	///< power management unit bypass
///	@}

/// \name PWR_CPUCR bits
///	@{
#define	MCCI_STM32H7_REG_PWR_CPUCR_RSV12	UINT32_C(0xFFFFF000)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CPUCR_RUN_SRD	(UINT32_C(1) << 11)	///< temperature level monitoring versus high threshold
#define	MCCI_STM32H7_REG_PWR_CPUCR_RSV10	(UINT32_C(1) << 10)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CPUCR_CSSF		(UINT32_C(1) << 9)	///< clear Standby and Stop flags (always read as 0)
#define	MCCI_STM32H7_REG_PWR_CPUCR_RSV7		(UINT32_C(3) << 7)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CPUCR_SBF		(UINT32_C(1) << 6)	///< system Standby flag
#define	MCCI_STM32H7_REG_PWR_CPUCR_STOPF	(UINT32_C(1) << 5)	///< STOP flag
#define	MCCI_STM32H7_REG_PWR_CPUCR_RSV3		(UINT32_C(3) << 3)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CPUCR_PDDS_SRD	(UINT32_C(1) << 2)	///< system SmartRun domain power down Deepsleep
#define	MCCI_STM32H7_REG_PWR_CPUCR_RSV1		(UINT32_C(1) << 1)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_CPUCR_RETDS_CD	(UINT32_C(1) << 0)	///< CPU domain power down Deepsleep selection
///	@}

/// \name PWR_SRDCR bits
///	@{
#define	MCCI_STM32H7_REG_PWR_SRDCR_RSV16	UINT32_C(0xFFFF0000)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_SRDCR_VOS		(UINT32_C(3) << 14)	///< voltage scaling selection according to performance
#define	MCCI_STM32H7_REG_PWR_SRDCR_VOS_SCALE3	(UINT32_C(0) << 14)	///< scale 3
#define	MCCI_STM32H7_REG_PWR_SRDCR_VOS_SCALE2	(UINT32_C(1) << 14)	///< scale 2
#define	MCCI_STM32H7_REG_PWR_SRDCR_VOS_SCALE1	(UINT32_C(2) << 14)	///< scale 1
#define	MCCI_STM32H7_REG_PWR_SRDCR_VOS_SCALE0	(UINT32_C(3) << 14)	///< scale 0
#define	MCCI_STM32H7_REG_PWR_SRDCR_VOSRDY	(UINT32_C(1) << 13)	///< VOS ready bit for VCORE voltage scaling output selection
#define	MCCI_STM32H7_REG_PWR_SRDCR_RSV0		UINT32_C(0x00001FFF)	///< Reserved, don't change
///	@}

/// \name PWR_WKUPCR bits
///	@{
#define	MCCI_STM32H7_REG_PWR_WKUPCR_RSV6	UINT32_C(0xFFFFFC00)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_WKUPCR_WKUPC6	(UINT32_C(1) << 5)	///< clear wakeup pin flag for WKUP6
#define	MCCI_STM32H7_REG_PWR_WKUPCR_WKUPC5	(UINT32_C(1) << 4)	///< clear wakeup pin flag for WKUP5
#define	MCCI_STM32H7_REG_PWR_WKUPCR_WKUPC4	(UINT32_C(1) << 3)	///< clear wakeup pin flag for WKUP4
#define	MCCI_STM32H7_REG_PWR_WKUPCR_WKUPC3	(UINT32_C(1) << 2)	///< clear wakeup pin flag for WKUP3
#define	MCCI_STM32H7_REG_PWR_WKUPCR_WKUPC2	(UINT32_C(1) << 1)	///< clear wakeup pin flag for WKUP2
#define	MCCI_STM32H7_REG_PWR_WKUPCR_WKUPC1	(UINT32_C(1) << 0)	///< clear wakeup pin flag for WKUP1

#define	MCCI_STM32H7_REG_PWR_WKUPCR_WKUPC(n)	(UINT32_C(1) << ((n)-1))
///	@}

/// \name PWR_WKUPFR bits
///	@{
#define	MCCI_STM32H7_REG_PWR_WKUPFR_RSV6	UINT32_C(0xFFFFFC00)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_WKUPFR_WKUPF6	(UINT32_C(1) << 5)	///< wakeup pin flag for WKUP6
#define	MCCI_STM32H7_REG_PWR_WKUPFR_WKUPF5	(UINT32_C(1) << 4)	///< wakeup pin flag for WKUP5
#define	MCCI_STM32H7_REG_PWR_WKUPFR_WKUPF4	(UINT32_C(1) << 3)	///< wakeup pin flag for WKUP4
#define	MCCI_STM32H7_REG_PWR_WKUPFR_WKUPF3	(UINT32_C(1) << 2)	///< wakeup pin flag for WKUP3
#define	MCCI_STM32H7_REG_PWR_WKUPFR_WKUPF2	(UINT32_C(1) << 1)	///< wakeup pin flag for WKUP2
#define	MCCI_STM32H7_REG_PWR_WKUPFR_WKUPF1	(UINT32_C(1) << 0)	///< wakeup pin flag for WKUP1

#define	MCCI_STM32H7_REG_PWR_WKUPFR_WKUPF(n)	(UINT32_C(1) << ((n)-1))
///	@}

/// \name PWR_WKUPEPR bits
///	@{
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_RSV28	UINT32_C(0xF0000000)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PUPD6	(UINT32_C(3) << 26)	///< wakeup pin pull configuration for WKUP6
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PUPD5	(UINT32_C(3) << 24)	///< wakeup pin pull configuration for WKUP5
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PUPD4	(UINT32_C(3) << 22)	///< wakeup pin pull configuration for WKUP4
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PUPD3	(UINT32_C(3) << 20)	///< wakeup pin pull configuration for WKUP3
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PUPD2	(UINT32_C(3) << 18)	///< wakeup pin pull configuration for WKUP2
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PUPD1	(UINT32_C(3) << 16)	///< wakeup pin pull configuration for WKUP1

#define	MCCI_STM32H7_REG_PWR_WKUPEPR_NOPU(n)	(UINT32_C(0) << ((((n)-1)*2)+16))	///< no pull-up WKUPn
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PU(n)	(UINT32_C(1) << ((((n)-1)*2)+16))	///< pull-up WKUPn
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_PD(n)	(UINT32_C(2) << ((((n)-1)*2)+16))	///< pull-down WKUPn

