mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_RSV14	(UINT32_C(3) << 14)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPP6	(UINT32_C(1) << 13)	///< wakeup pin polarity for WKUP6
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPP5	(UINT32_C(1) << 12)	///< wakeup pin polarity for WKUP5
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPP4	(UINT32_C(1) << 11)	///< wakeup pin polarity for WKUP4
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPP3	(UINT32_C(1) << 10)	///< wakeup pin polarity for WKUP3
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPP2	(UINT32_C(1) << 9)	///< wakeup pin polarity for WKUP2
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPP1	(UINT32_C(1) << 8)	///< wakeup pin polarity for WKUP1
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_RSV6	(UINT32_C(3) << 6)	///< Reserved, don't change
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPEN6	(UINT32_C(1) << 5)	///< enable wakeup pin for WKUP6
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPEN5	(UINT32_C(1) << 4)	///< enable wakeup pin for WKUP5
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPEN4	(UINT32_C(1) << 3)	///< enable wakeup pin for WKUP4
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPEN3	(UINT32_C(1) << 2)	///< enable wakeup pin for WKUP3
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPEN2	(UINT32_C(1) << 1)	///< enable wakeup pin for WKUP2
#define	MCCI_STM32H7_REG_PWR_WKUPEPR_WKUPEN1	(UINT32_C(1) << 0)	///< enable wakeup pin for WKUP1
///	@}

/****************************************************************************\
|
|	Reset and Clock Control (RCC) Registers
|
\****************************************************************************/

/// \name RCC registers
///	@{
#define	MCCI_STM32H7_REG_RCC_CR		(MCCI_STM32H7_REG_RCC + 0x00)	///< source control
#define	MCCI_STM32H7_REG_RCC_HSICFGR	(MCCI_STM32H7_REG_RCC + 0x04)	///< HSI calibration
#define	MCCI_STM32H7_REG_RCC_CRRCR	(MCCI_STM32H7_REG_RCC + 0x08)	///< Clock recovery RC
#define	MCCI_STM32H7_REG_RCC_CSICFGR	(MCCI_STM32H7_REG_RCC + 0x0C)	///< CSI calibration
#define	MCCI_STM32H7_REG_RCC_CFGR	(MCCI_STM32H7_REG_RCC + 0x10)	///< Clock configuration
#define	MCCI_STM32H7_REG_RCC_CDCFGR1	(MCCI_STM32H7_REG_RCC + 0x14)	///< CPU domain clock configuration
#define	MCCI_STM32H7_REG_RCC_CDCFGR2	(MCCI_STM32H7_REG_RCC + 0x18)	///< CPU domain clock configuration
#define	MCCI_STM32H7_REG_RCC_SRDCFGR	(MCCI_STM32H7_REG_RCC + 0x20)	///< SmartRun domain clock configuration
#define	MCCI_STM32H7_REG_RCC_PLLCKSELR	(MCCI_STM32H7_REG_RCC + 0x28)	///< PLLs clock source selection
#define	MCCI_STM32H7_REG_RCC_PLLCFGR	(MCCI_STM32H7_REG_RCC + 0x2C)	///< PLLs configuration
#define	MCCI_STM32H7_REG_RCC_PLL1DIVR	(MCCI_STM32H7_REG_RCC + 0x30)	///< PLL1 dividers configuration
#define	MCCI_STM32H7_REG_RCC_PLL1FRACR	(MCCI_STM32H7_REG_RCC + 0x34)	///< PLL1 fractional divider
#define	MCCI_STM32H7_REG_RCC_PLL2DIVR	(MCCI_STM32H7_REG_RCC + 0x38)	///< PLL2 dividers configuration
#define	MCCI_STM32H7_REG_RCC_PLL2FRACR	(MCCI_STM32H7_REG_RCC + 0x3C)	///< PLL2 fractional divider
#define	MCCI_STM32H7_REG_RCC_PLL3DIVR	(MCCI_STM32H7_REG_RCC + 0x40)	///< PLL3 dividers configuration
#define	MCCI_STM32H7_REG_RCC_PLL3FRACR	(MCCI_STM32H7_REG_RCC + 0x44)	///< PLL4 fractional divider
#define	MCCI_STM32H7_REG_RCC_CDCCIPR	(MCCI_STM32H7_REG_RCC + 0x4C)	///< CPU domain kernel clock configuration
#define	MCCI_STM32H7_REG_RCC_CDCCIP1R	(MCCI_STM32H7_REG_RCC + 0x50)	///< CPU domain kernel clock configuration
#define	MCCI_STM32H7_REG_RCC_CDCCIP2R	(MCCI_STM32H7_REG_RCC + 0x54)	///< CPU domain kernel clock configuration
#define	MCCI_STM32H7_REG_RCC_SRDCCIPR	(MCCI_STM32H7_REG_RCC + 0x58)	///< SmartRun domain kernel clock configuration
#define	MCCI_STM32H7_REG_RCC_CIER	(MCCI_STM32H7_REG_RCC + 0x60)	///< clock source interrupt enable
#define	MCCI_STM32H7_REG_RCC_CIFR	(MCCI_STM32H7_REG_RCC + 0x64)	///< clock source interrupt flag
#define	MCCI_STM32H7_REG_RCC_CICR	(MCCI_STM32H7_REG_RCC + 0x68)	///< clock source interrupt clear
#define	MCCI_STM32H7_REG_RCC_BDCR	(MCCI_STM32H7_REG_RCC + 0x70)	///< Backup domain control
#define	MCCI_STM32H7_REG_RCC_CSR	(MCCI_STM32H7_REG_RCC + 0x74)	///< clock control and status
#define	MCCI_STM32H7_REG_RCC_AHB3RSTR	(MCCI_STM32H7_REG_RCC + 0x7C)	///< AHB3 reset
#define	MCCI_STM32H7_REG_RCC_AHB1RSTR	(MCCI_STM32H7_REG_RCC + 0x80)	///< AHB1 peripheral reset
#define	MCCI_STM32H7_REG_RCC_AHB2RSTR	(MCCI_STM32H7_REG_RCC + 0x84)	///< AHB2 peripheral reset
#define	MCCI_STM32H7_REG_RCC_AHB4RSTR	(MCCI_STM32H7_REG_RCC + 0x88)	///< AHB4 peripheral reset
#define	MCCI_STM32H7_REG_RCC_APB3RSTR	(MCCI_STM32H7_REG_RCC + 0x8C)	///< APB3 peripheral reset
#define	MCCI_STM32H7_REG_RCC_APB1LRSTR	(MCCI_STM32H7_REG_RCC + 0x90)	///< APB1 peripheral reset
#define	MCCI_STM32H7_REG_RCC_APB1HRSTR	(MCCI_STM32H7_REG_RCC + 0x94)	///< APB1 peripheral reset
#define	MCCI_STM32H7_REG_RCC_APB2RSTR	(MCCI_STM32H7_REG_RCC + 0x98)	///< APB2 peripheral reset
#define	MCCI_STM32H7_REG_RCC_APB4RSTR	(MCCI_STM32H7_REG_RCC + 0x9C)	///< APB4 peripheral reset
#define	MCCI_STM32H7_REG_RCC_SRDAMR	(MCCI_STM32H7_REG_RCC + 0xA8)	///< SmartRun domain Autonomous mode
#define	MCCI_STM32H7_REG_RCC_CKGAENR	(MCCI_STM32H7_REG_RCC + 0xB0)	///< AXI clocks gating enable
#define	MCCI_STM32H7_REG_RCC_RSR	(MCCI_STM32H7_REG_RCC + 0x130)	///< reset status
#define	MCCI_STM32H7_REG_RCC_AHB3ENR	(MCCI_STM32H7_REG_RCC + 0x134)	///< AHB3 clock
#define	MCCI_STM32H7_REG_RCC_AHB1ENR	(MCCI_STM32H7_REG_RCC + 0x138)	///< AHB1 clock
#define	MCCI_STM32H7_REG_RCC_AHB2ENR	(MCCI_STM32H7_REG_RCC + 0x13C)	///< AHB2 clock
#define	MCCI_STM32H7_REG_RCC_AHB4ENR	(MCCI_STM32H7_REG_RCC + 0x140)	///< AHB4 clock
#define	MCCI_STM32H7_REG_RCC_APB3ENR	(MCCI_STM32H7_REG_RCC + 0x144)	///< APB3 clock
#define	MCCI_STM32H7_REG_RCC_APB1LENR	(MCCI_STM32H7_REG_RCC + 0x148)	///< APB1 clock
#define	MCCI_STM32H7_REG_RCC_APB1HENR	(MCCI_STM32H7_REG_RCC + 0x14C)	///< APB1 clock
#define	MCCI_STM32H7_REG_RCC_APB2ENR	(MCCI_STM32H7_REG_RCC + 0x150)	///< APB2 clock
#define	MCCI_STM32H7_REG_RCC_APB4ENR	(MCCI_STM32H7_REG_RCC + 0x154)	///< APB4 clock
#define	MCCI_STM32H7_REG_RCC_AHB3LPENR	(MCCI_STM32H7_REG_RCC + 0x15C)	///< AHB3 sleep clock
#define	MCCI_STM32H7_REG_RCC_AHB1LPENR	(MCCI_STM32H7_REG_RCC + 0x160)	///< AHB1 sleep clock
#define	MCCI_STM32H7_REG_RCC_AHB2LPENR	(MCCI_STM32H7_REG_RCC + 0x164)	///< AHB2 sleep clock
#define	MCCI_STM32H7_REG_RCC_AHB4LPENR	(MCCI_STM32H7_REG_RCC + 0x168)	///< AHB4 sleep clock
#define	MCCI_STM32H7_REG_RCC_APB3LPENR	(MCCI_STM32H7_REG_RCC + 0x16C)	///< APB3 sleep clock
#define	MCCI_STM32H7_REG_RCC_APB1LLPENR	(MCCI_STM32H7_REG_RCC + 0x170)	///< APB1 low-sleep clock
#define	MCCI_STM32H7_REG_RCC_APB1HLPENR	(MCCI_STM32H7_REG_RCC + 0x174)	///< APB1 high-sleep clock
#define	MCCI_STM32H7_REG_RCC_APB2LPENR	(MCCI_STM32H7_REG_RCC + 0x178)	///< APB2 sleep clock
#define	MCCI_STM32H7_REG_RCC_APB4LPENR	(MCCI_STM32H7_REG_RCC + 0x17C)	///< APB4 sleep clock
///	@}

