mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_CR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CR_RSV30		(UINT32_C(3) << 30)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CR_PLL3RDY		(UINT32_C(1) << 29)	//< PLL3 clock ready flag
#define MCCI_STM32H7_REG_RCC_CR_PLL3ON		(UINT32_C(1) << 28)	//< PLL3 enable
#define MCCI_STM32H7_REG_RCC_CR_PLL2RDY		(UINT32_C(1) << 27)	//< PLL2 clock ready flag
#define MCCI_STM32H7_REG_RCC_CR_PLL2ON		(UINT32_C(1) << 26)	//< PLL2 enable
#define MCCI_STM32H7_REG_RCC_CR_PLL1RDY		(UINT32_C(1) << 25)	//< PLL1 clock ready flag
#define MCCI_STM32H7_REG_RCC_CR_PLL1ON		(UINT32_C(1) << 24)	//< PLL1 enable
#define MCCI_STM32H7_REG_RCC_CR_RSV21		(UINT32_C(7) << 21)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CR_HSEEXT		(UINT32_C(1) << 20)	//< external high speed clock type in Bypass mode
#define MCCI_STM32H7_REG_RCC_CR_HSECSSON	(UINT32_C(1) << 19)	//< HSE clock security system enable
#define MCCI_STM32H7_REG_RCC_CR_HSEBYP		(UINT32_C(1) << 18)	//< enable HSE clock bypass
#define MCCI_STM32H7_REG_RCC_CR_HSERDY		(UINT32_C(1) << 17)	//< HSE clock ready
#define MCCI_STM32H7_REG_RCC_CR_HSEON		(UINT32_C(1) << 16)	//< HSE clock enabled
#define MCCI_STM32H7_REG_RCC_CR_CDCKRDY		(UINT32_C(1) << 15)	//< CPU domain clocks ready flag
#define MCCI_STM32H7_REG_RCC_CR_CPUCKRDY	(UINT32_C(1) << 14)	//< CPU related clocks ready flag
#define MCCI_STM32H7_REG_RCC_CR_HSI48RDY	(UINT32_C(1) << 13)	//< HSI48 clock ready flag
#define MCCI_STM32H7_REG_RCC_CR_HSI48ON		(UINT32_C(1) << 12)	//< HSI48 clock enable
#define MCCI_STM32H7_REG_RCC_CR_RSV10		(UINT32_C(3) << 10)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CR_CSIKERON	(UINT32_C(1) << 9)	//< CSI clock enable in Stop mode
#define MCCI_STM32H7_REG_RCC_CR_CSIRDY		(UINT32_C(1) << 8)	//< CSI clock ready
#define MCCI_STM32H7_REG_RCC_CR_CSION		(UINT32_C(1) << 7)	//< CSI clock enable
#define MCCI_STM32H7_REG_RCC_CR_RSV6		(UINT32_C(1) << 6)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CR_HSIDIVF		(UINT32_C(1) << 5)	//< HSI divider flag
#define MCCI_STM32H7_REG_RCC_CR_HSIDIV		(UINT32_C(3) << 3)	//< HSI clock divider
#define MCCI_STM32H7_REG_RCC_CR_HSIDIV_1	(UINT32_C(0) << 3)	//< division by 1, hsi_ck=64MHz
#define MCCI_STM32H7_REG_RCC_CR_HSIDIV_2	(UINT32_C(1) << 3)	//< division by 2, hsi_ck=32MHz
#define MCCI_STM32H7_REG_RCC_CR_HSIDIV_3	(UINT32_C(2) << 3)	//< division by 4, hsi_ck=16MHz
#define MCCI_STM32H7_REG_RCC_CR_HSIDIV_8	(UINT32_C(3) << 3)	//< division by 8, hsi_ck=8MHz
#define MCCI_STM32H7_REG_RCC_CR_HSIRDY		(UINT32_C(1) << 2)	//< HSI clock ready flag
#define MCCI_STM32H7_REG_RCC_CR_HSIKERON	(UINT32_C(1) << 1)	//< HSI clock enable in Stop mode
#define MCCI_STM32H7_REG_RCC_CR_HSION		(UINT32_C(1) << 0)	//< HSI clock enable
///	@}

/// \name RCC_HSICFGR bits
///	@{
#define MCCI_STM32H7_REG_RCC_HSICFGR_RSV31	(UINT32_C(1) << 31)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_HSICFGR_HSITRIM	(UINT32_C(0x7F) << 24)	//< HSI clock trimming
#define MCCI_STM32H7_REG_RCC_HSICFGR_RSV12	(UINT32_C(0xFFF) << 12)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_HSICFGR_HSICAL	(UINT32_C(0xFFF) << 0)	//< HSI clock cal
///	@}

/// \name RCC_CRRCR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CRRCR_RSV10	UINT32_C(0xFFFFFC00)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_CRRCR_HSI48CAL	(UINT32_C(0x3FF) << 0)	//< calibration for HSI48
///	@}

/// \name RCC_CSICFGR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CSICFGR_RSV30	(UINT32_C(3) << 30)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CSICFGR_CSITRIM	(UINT32_C(0x3F) << 24)	//< CSI clock trimming
#define MCCI_STM32H7_REG_RCC_CSICFGR_RSV8	(UINT32_C(0xFFFF) << 8)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CSICFGR_CSICAL	(UINT32_C(0xFF) << 0)	//< CSI clock calibration
///	@}

/// \name RCC_CFGR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2SEL	(UINT32_C(7) << 29)	//< microcontroller clock output 2
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2SEL_SYS	(UINT32_C(0) << 29)	//< System clock
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2SEL_PLL2	(UINT32_C(1) << 29)	//< PLL2
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2SEL_HSE	(UINT32_C(2) << 29)	//< HSE
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2SEL_PLL1	(UINT32_C(3) << 29)	//< PLL1
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2SEL_CSI	(UINT32_C(4) << 29)	//< CSI
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2SEL_LSI	(UINT32_C(5) << 29)	//< LSI
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2PRE	(UINT32_C(0xF) << 25)	//< MCO2 prescaler
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2PRE_DIS	(UINT32_C(0) << 25)	//< prescaler disabled (default after reset)
#define MCCI_STM32H7_REG_RCC_CFGR_MCO2PRE_N(n)	((n) << 25)		//< division by n
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1SEL	(UINT32_C(7) << 22)	//< microcontroller clock output 1
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1SEL_HSI	(UINT32_C(0) << 22)	//< HSI
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1SEL_LSE	(UINT32_C(1) << 22)	//< LSE
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1SEL_HSE	(UINT32_C(2) << 22)	//< HSE
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1SEL_PLL1	(UINT32_C(3) << 22)	//< PLL1
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1SEL_HSI48	(UINT32_C(4) << 22)	//< HSI48
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1PRE	(UINT32_C(0xF) << 18)	//< MCO1 prescaler
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1PRE_DIS	(UINT32_C(0) << 18)	//< prescaler disabled (default after reset)
#define MCCI_STM32H7_REG_RCC_CFGR_MCO1PRE_N(n)	((n) << 18)		//< division by n
#define MCCI_STM32H7_REG_RCC_CFGR_RSV16		(UINT32_C(3) << 16)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_CFGR_TIMPRE	(UINT32_C(1) << 15)	//< timers clocks prescaler selection
#define MCCI_STM32H7_REG_RCC_CFGR_RSV14		(UINT32_C(1) << 14)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_CFGR_RTCPRE	(UINT32_C(0x3F) << 8)	//< HSE division factor for RTC clock
#define MCCI_STM32H7_REG_RCC_CFGR_RTCPRE_DIS	(UINT32_C(0) << 8)	//< no clock (default after reset)
#define MCCI_STM32H7_REG_RCC_CFGR_RTCPRE_N(n)	((n) << 8)		//< HSE/n
#define MCCI_STM32H7_REG_RCC_CFGR_STOPKERWUCK	(UINT32_C(1) << 7)	//< kernel clock selection after a wake up from system Stop
#define MCCI_STM32H7_REG_RCC_CFGR_STOPWUCK	(UINT32_C(1) << 6)	//< system clock selection after a wake up from system Stop
#define MCCI_STM32H7_REG_RCC_CFGR_SWS		(UINT32_C(7) << 3)	//< system clock switch status
#define MCCI_STM32H7_REG_RCC_CFGR_SWS_HSI	(UINT32_C(0) << 3)	//< HSI used as system clock
#define MCCI_STM32H7_REG_RCC_CFGR_SWS_CSI	(UINT32_C(1) << 3)	//< CSI used as system clock
#define MCCI_STM32H7_REG_RCC_CFGR_SWS_HSE	(UINT32_C(2) << 3)	//< HSE used as system clock
#define MCCI_STM32H7_REG_RCC_CFGR_SWS_PLL1	(UINT32_C(3) << 3)	//< PLL1 used as system clock
#define MCCI_STM32H7_REG_RCC_CFGR_SW		(UINT32_C(3) << 0)	//< system clock and trace clock switch
#define MCCI_STM32H7_REG_RCC_CFGR_SW_HSI	(UINT32_C(0) << 0)	//< HSI selected as system clock
#define MCCI_STM32H7_REG_RCC_CFGR_SW_CSI	(UINT32_C(1) << 0)	//< CSI selected as system clock
#define MCCI_STM32H7_REG_RCC_CFGR_SW_HSE	(UINT32_C(2) << 0)	//< HSE selected as system clock
#define MCCI_STM32H7_REG_RCC_CFGR_SW_PLL1	(UINT32_C(3) << 0)	//< PLL1 selected as system clock
///	@}

