mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_CDCFGR1 bits
///	@{
#define MCCI_STM32H7_REG_RCC_CDCFGR1_RSV12	UINT32_C(0xFFFFF000)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE	(UINT32_C(0xF) << 8)	//< CPU domain core prescaler
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_1	(UINT32_C(0) << 8)	//< sys_ck not divided
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_2	(UINT32_C(0x8) << 8)	//< sys_ck divided by 2
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_4	(UINT32_C(0x9) << 8)	//< sys_ck divided by 4
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_5	(UINT32_C(0xA) << 8)	//< sys_ck divided by 8
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_16	(UINT32_C(0xB) << 8)	//< sys_ck divided by 16
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_64	(UINT32_C(0xC) << 8)	//< sys_ck divided by 64
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_128	(UINT32_C(0xD) << 8)	//< sys_ck divided by 128
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_256	(UINT32_C(0xE) << 8)	//< sys_ck divided by 256
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDCPRE_512	(UINT32_C(0xF) << 8)	//< sys_ck divided by 512
#define MCCI_STM32H7_REG_RCC_CDCFGR1_RSV7	(UINT32_C(1) << 7)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDPPRE	(UINT32_C(7) << 4)	//< CPU domain APB3 prescaler
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDPPRE_1	(UINT32_C(0) << 4)	//< rcc_pclk3 = rcc_hclk3
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDPPRE_2	(UINT32_C(4) << 4)	//< rcc_pclk3 = rcc_hclk3 / 2
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDPPRE_3	(UINT32_C(5) << 4)	//< rcc_pclk3 = rcc_hclk3 / 4
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDPPRE_8	(UINT32_C(6) << 4)	//< rcc_pclk3 = rcc_hclk3 / 8
#define MCCI_STM32H7_REG_RCC_CDCFGR1_CDPPRE_16	(UINT32_C(7) << 4)	//< rcc_pclk3 = rcc_hclk3 / 16
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE	(UINT32_C(0xF) << 0)	//< CPU domain AHB prescaler
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_1	(UINT32_C(0) << 0)	//< rcc_hclk3 = sys_cdcpre_ck
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_2	(UINT32_C(0x8) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 2
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_4	(UINT32_C(0x9) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 4
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_8	(UINT32_C(0xA) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 8
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_16	(UINT32_C(0xB) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 16
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_64	(UINT32_C(0xC) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 64
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_128	(UINT32_C(0xD) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 128
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_256	(UINT32_C(0xE) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 256
#define MCCI_STM32H7_REG_RCC_CDCFGR1_HPRE_512	(UINT32_C(0xF) << 0)	//< rcc_hclk3 = sys_cdcpre_ck / 512
///	@}

/// \name RCC_CDCFGR2 bits
///	@{
#define MCCI_STM32H7_REG_RCC_CDCFGR2_RSV11	UINT32_C(0xFFFFF800)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE2	(UINT32_C(7) << 8)	//< CPU domain APB2 prescaler
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE2_1	(UINT32_C(0) << 8)	//< rcc_pclk2 = rcc_hclk1
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE2_2	(UINT32_C(4) << 8)	//< rcc_pclk2 = rcc_hclk1 / 2
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE2_3	(UINT32_C(5) << 8)	//< rcc_pclk2 = rcc_hclk1 / 4
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE2_8	(UINT32_C(6) << 8)	//< rcc_pclk2 = rcc_hclk1 / 8
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE2_16	(UINT32_C(7) << 8)	//< rcc_pclk2 = rcc_hclk1 / 16
#define MCCI_STM32H7_REG_RCC_CDCFGR2_RSV7	(UINT32_C(1) << 7)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE1	(UINT32_C(7) << 4)	//< CPU domain APB1 prescaler
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE1_1	(UINT32_C(0) << 4)	//< rcc_pclk1 = rcc_hclk1
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE1_2	(UINT32_C(4) << 4)	//< rcc_pclk1 = rcc_hclk1 / 2
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE1_3	(UINT32_C(5) << 4)	//< rcc_pclk1 = rcc_hclk1 / 4
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE1_8	(UINT32_C(6) << 4)	//< rcc_pclk1 = rcc_hclk1 / 8
#define MCCI_STM32H7_REG_RCC_CDCFGR2_CDPPRE1_16	(UINT32_C(7) << 4)	//< rcc_pclk1 = rcc_hclk1 / 16
#define MCCI_STM32H7_REG_RCC_CDCFGR2_RSV0	(UINT32_C(0xF) << 0)	//< reserved, no change
///	@}

/// \name RCC_SRDCFGR bits
///	@{
#define MCCI_STM32H7_REG_RCC_SRDCFGR_RSV7	UINT32_C(0xFFFFFF80)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_SRDCFGR_SRDPPRE	(UINT32_C(7) << 4)	//< SmartRun domain APB4 prescaler
#define MCCI_STM32H7_REG_RCC_SRDCFGR_SRDPPRE_1	(UINT32_C(0) << 4)	//< rcc_pclk4 = rcc_hclk4
#define MCCI_STM32H7_REG_RCC_SRDCFGR_SRDPPRE_2	(UINT32_C(4) << 4)	//< rcc_pclk4 = rcc_hclk4 / 2
#define MCCI_STM32H7_REG_RCC_SRDCFGR_SRDPPRE_3	(UINT32_C(5) << 4)	//< rcc_pclk4 = rcc_hclk4 / 4
#define MCCI_STM32H7_REG_RCC_SRDCFGR_SRDPPRE_8	(UINT32_C(6) << 4)	//< rcc_pclk4 = rcc_hclk4 / 8
#define MCCI_STM32H7_REG_RCC_SRDCFGR_SRDPPRE_16	(UINT32_C(7) << 4)	//< rcc_pclk4 = rcc_hclk4 / 16
#define MCCI_STM32H7_REG_RCC_SRDCFGR_RSV0	(UINT32_C(0xF) << 0)	//< reserved, no change
///	@}

/// \name RCC_PLLCKSELR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_RSV26	  (UINT32_C(0x3F) << 26) //< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM3	  (UINT32_C(0x3F) << 20) //< prescaler for PLL3
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM3_DIS  (UINT32_C(0x3F) << 20) //< prescaler disabled
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM3_N(n) ((n) << 20)		 //< division by n
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_RSV18	  (UINT32_C(3) << 18)	 //< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM2	  (UINT32_C(0x3F) << 12) //< prescaler for PLL2
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM2_DIS  (UINT32_C(0x3F) << 12) //< prescaler disabled
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM2_N(n) ((n) << 12)	 	//< division by n
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_RSV10	  (UINT32_C(3) << 10)	 //< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM1	  (UINT32_C(0x3F) << 14) //< prescaler for PLL1
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM1_DIS  (UINT32_C(0x3F) << 14) //< prescaler disabled
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_DIVM1_N(n) ((n) << 14)		 //< division by n
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_RSV2	  (UINT32_C(3) << 2)	 //< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_PLLSRC	  (UINT32_C(3) << 0)	 //< DIVMx and PLLs clock source selection
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_PLLSRC_HSI (UINT32_C(0) << 0)	 //< HSI
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_PLLSRC_CSI (UINT32_C(1) << 0)	 //< CSI
#define MCCI_STM32H7_REG_RCC_PLLCKSELR_PLLSRC_HSE (UINT32_C(2) << 0)	 //< HSE
///	@}

