mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_PLLCFGR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLLCFGR_RSV25	(UINT32_C(0x7F) << 25)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVR3EN	(UINT32_C(1) << 24)	//< PLL3 DIVR divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVQ3EN	(UINT32_C(1) << 23)	//< PLL3 DIVQ divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVP3EN	(UINT32_C(1) << 22)	//< PLL3 DIVP divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVR2EN	(UINT32_C(1) << 21)	//< PLL2 DIVR divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVQ2EN	(UINT32_C(1) << 20)	//< PLL2 DIVQ divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVP2EN	(UINT32_C(1) << 19)	//< PLL2 DIVP divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVR1EN	(UINT32_C(1) << 18)	//< PLL1 DIVR divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVQ1EN	(UINT32_C(1) << 17)	//< PLL1 DIVQ divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_DIVP1EN	(UINT32_C(1) << 16)	//< PLL1 DIVP divider output enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_RSV12	(UINT32_C(0xF) << 12)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL3RGE	(UINT32_C(3) << 10)	//< PLL3 input frequency range
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL3RGE_N(n) ((n) << 10)		//< PLL3 input frequency range
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL3VCOSEL	(UINT32_C(1) << 9)	//< PLL3 VCO selection
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL3FRACEN	(UINT32_C(1) << 8)	//< PLL3 fractional latch enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL2RGE	(UINT32_C(3) << 6)	//< PLL2 input frequency range
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL2RGE_N(n) ((n) << 6)		//< PLL2 input frequency range
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL2VCOSEL	(UINT32_C(1) << 5)	//< PLL2 VCO selection
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL2FRACEN	(UINT32_C(1) << 4)	//< PLL2 fractional latch enable
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL1RGE	(UINT32_C(3) << 2)	//< PLL1 input frequency range
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL1RGE_N(n) ((n) << 2)		//< PLL1 input frequency range
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL1VCOSEL	(UINT32_C(1) << 1)	//< PLL1 VCO selection
#define MCCI_STM32H7_REG_RCC_PLLCFGR_PLL1FRACEN	(UINT32_C(1) << 0)	//< PLL1 fractional latch enable
///	@}

/// \name RCC_PLL1DIVR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_RSV31	(UINT32_C(1) << 31)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVR	(UINT32_C(0x7F) << 24)	//< PLL1 DIVR division factor
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVR_N(n)	((n) << 24)		//< pll1_r_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_RSV23	(UINT32_C(1) << 23)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVQ	(UINT32_C(0x7F) << 16)	//< PLL1 DIVQ division factor
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVQ_N(n)	((n) << 16)		//< pll1_q_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVP	(UINT32_C(0x7F) << 9)	//< PLL1 DIVP division factor
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVP_N(n)	((n) << 9)		//< pll1_p_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVN	(UINT32_C(0x1FF) << 0)	//< multiplication factor for PLL1 VCO
#define MCCI_STM32H7_REG_RCC_PLL1DIVR_DIVN_N(n)	((n) << 0)		//< DIVN = n+1
///	@}

/// \name RCC_PLL1FRACR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLL1FRACR_RSV16	UINT32_C(0xFFFF0000)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL1FRACR_FRACN	(UINT32_C(0x1FFF) << 3)	//< fractional part of the multiplication factor for PLL1 VCO
#define MCCI_STM32H7_REG_RCC_PLL1FRACR_FRACN_N(n) ((n) << 3)		//< fractional part of the multiplication factor for PLL1 VCO
#define MCCI_STM32H7_REG_RCC_PLL1FRACR_RSV0	(UINT32_C(7) << 0)	//< reserved, no change
///	@}

/// \name RCC_PLL2DIVR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_RSV31	(UINT32_C(1) << 31)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVR	(UINT32_C(0x7F) << 24)	//< PLL2 DIVR division factor
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVR_N(n)	((n) << 24)		//< pll2_r_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_RSV23	(UINT32_C(1) << 23)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVQ	(UINT32_C(0x7F) << 16)	//< PLL2 DIVQ division factor
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVQ_N(n)	((n) << 16)		//< pll2_q_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVP	(UINT32_C(0x7F) << 9)	//< PLL2 DIVP division factor
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVP_N(n)	((n) << 9)		//< pll2_p_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVN	(UINT32_C(0x1FF) << 0)	//< multiplication factor for PLL2 VCO
#define MCCI_STM32H7_REG_RCC_PLL2DIVR_DIVN_N(n)	((n) << 0)		//< DIVN = n+1
///	@}

/// \name RCC_PLL2FRACR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLL2FRACR_RSV16	UINT32_C(0xFFFF0000)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL2FRACR_FRACN	(UINT32_C(0x1FFF) << 3)	//< fractional part of the multiplication factor for PLL2 VCO
#define MCCI_STM32H7_REG_RCC_PLL2FRACR_FRACN_N(n) ((n) << 3)		//< fractional part of the multiplication factor for PLL2 VCO
#define MCCI_STM32H7_REG_RCC_PLL2FRACR_RSV0	(UINT32_C(7) << 0)	//< reserved, no change
///	@}

/// \name RCC_PLL3DIVR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_RSV31	(UINT32_C(1) << 31)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVR	(UINT32_C(0x7F) << 24)	//< PLL3 DIVR division factor
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVR_N(n)	((n) << 24)		//< pll3_r_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_RSV23	(UINT32_C(1) << 23)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVQ	(UINT32_C(0x7F) << 16)	//< PLL3 DIVQ division factor
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVQ_N(n)	((n) << 16)		//< pll3_q_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVP	(UINT32_C(0x7F) << 9)	//< PLL3 DIVP division factor
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVP_N(n)	((n) << 9)		//< pll3_p_ck = vco1_ck / (n+1)
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVN	(UINT32_C(0x1FF) << 0)	//< multiplication factor for PLL3 VCO
#define MCCI_STM32H7_REG_RCC_PLL3DIVR_DIVN_N(n)	((n) << 0)		//< DIVN = n+1
///	@}

