mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_PLL3FRACR bits
///	@{
#define MCCI_STM32H7_REG_RCC_PLL3FRACR_RSV16	UINT32_C(0xFFFF0000)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_PLL3FRACR_FRACN	(UINT32_C(0x1FFF) << 3)	//< fractional part of the multiplication factor for PLL3 VCO
#define MCCI_STM32H7_REG_RCC_PLL3FRACR_FRACN_N(n) ((n) << 3)		//< fractional part of the multiplication factor for PLL3 VCO
#define MCCI_STM32H7_REG_RCC_PLL3FRACR_RSV0	(UINT32_C(7) << 0)	//< reserved, no change
///	@}

/// \name RCC_CDCCIPR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CDCCIPR_RSV30		(UINT32_C(3) << 30)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIPR_CKPERSEL		(UINT32_C(3) << 28)	//< per_ck clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIPR_CKPERSEL_HSI	(UINT32_C(0) << 28)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_CKPERSEL_CSI	(UINT32_C(1) << 28)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_CKPERSEL_HSE	(UINT32_C(2) << 28)	//< hse_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_RSV17		UINT32_C(0x0FFE0000)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIPR_SDMMCSEL		(UINT32_C(1) << 16)	//< SDMMC kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIPR_RSV6		(UINT32_C(0x3F) << 6)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIPR_OCTOSPISEL		(UINT32_C(3) << 4)	//< OCTOSPI kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIPR_OCTOSPISEL_HCLK3 	(UINT32_C(0) << 4)	//< rcc_hclk3
#define MCCI_STM32H7_REG_RCC_CDCCIPR_OCTOSPISEL_PLL1	(UINT32_C(1) << 4)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_OCTOSPISEL_PLL2	(UINT32_C(2) << 4)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_OCTOSPISEL_PER	(UINT32_C(3) << 4)	//< per_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_RSV0		(UINT32_C(3) << 2)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIPR_FMCSEL		(UINT32_C(3) << 0)	//< FMC kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIPR_FMCSEL_HCLK3	(UINT32_C(0) << 0)	//< rcc_hclk3
#define MCCI_STM32H7_REG_RCC_CDCCIPR_FMCSEL_PLL1	(UINT32_C(1) << 0)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_FMCSEL_PLL2	(UINT32_C(2) << 0)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIPR_FMCSEL_PER		(UINT32_C(3) << 0)	//< per_ck
///	@}

/// \name RCC_CDCCIP1R bits
///	@{
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SWPMISEL		(UINT32_C(1) << 31)	//< SWPMI kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_RSV30		(UINT32_C(1) << 30)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_FDCANSEL		(UINT32_C(3) << 28)	//< FDCAN kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_FDCANSEL_HSE	(UINT32_C(0) << 28)	//< hse_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_FDCANSEL_PLL1	(UINT32_C(1) << 28)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_FDCANSEL_PLL2	(UINT32_C(2) << 28)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_RSV25		(UINT32_C(7) << 25)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_DFSDM1SEL		(UINT32_C(1) << 24)	//< DFSDM1 kernel clock Clk source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_RSV22		(UINT32_C(3) << 22)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPDIFRXSEL	(UINT32_C(3) << 20)	//< SPDIFRX kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPDIFRXSEL_PLL1	(UINT32_C(0) << 20)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPDIFRXSEL_PLL2	(UINT32_C(1) << 20)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPDIFRXSEL_PLL3	(UINT32_C(2) << 20)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPDIFRXSEL_HSI	(UINT32_C(3) << 20)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_RSV19		(UINT32_C(1) << 19)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI45SEL		(UINT32_C(7) << 16)	//< SPI4 and 5 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI45SEL_PCLK2	(UINT32_C(0) << 16)	//< rcc_pclk2
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI45SEL_PLL2	(UINT32_C(1) << 16)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI45SEL_PLL3	(UINT32_C(2) << 16)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI45SEL_HSI	(UINT32_C(3) << 16)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI45SEL_CSI	(UINT32_C(4) << 16)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI45SEL_HSE	(UINT32_C(5) << 16)	//< hse_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_RSV15		(UINT32_C(1) << 15)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI123SEL		(UINT32_C(7) << 12)	//< SPI/I2S1,2 and 3 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI123SEL_PLL1	(UINT32_C(0) << 12)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI123SEL_PLL2	(UINT32_C(1) << 12)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI123SEL_PLL3	(UINT32_C(2) << 12)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI123SEL_I2S	(UINT32_C(3) << 12)	//< I2S_CKIN
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SPI123SEL_PER	(UINT32_C(4) << 12)	//< per_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2BSEL		(UINT32_C(7) << 9)	//< SAI2 kernel clock B source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2BSEL_PLL1	(UINT32_C(0) << 9)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2BSEL_PLL2	(UINT32_C(1) << 9)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2BSEL_PLL3	(UINT32_C(2) << 9)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2BSEL_I2S	(UINT32_C(3) << 9)	//< I2S_CKIN
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2BSEL_PER	(UINT32_C(4) << 9)	//< per_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2BSEL_SPDIFRX	(UINT32_C(5) << 9)	//< spdifrx_symb_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2ASEL		(UINT32_C(7) << 6)	//< SAI2 kernel clock source A selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2ASEL_PLL1	(UINT32_C(0) << 6)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2ASEL_PLL2	(UINT32_C(1) << 6)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2ASEL_PLL3	(UINT32_C(2) << 6)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2ASEL_I2S	(UINT32_C(3) << 6)	//< I2S_CKIN
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2ASEL_PER	(UINT32_C(4) << 6)	//< per_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI2ASEL_SPDIFRX	(UINT32_C(5) << 6)	//< spdifrx_symb_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_RSV3		(UINT32_C(7) << 3)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI1SEL		(UINT32_C(7) << 0)	//< SAI1 and DFSDM1 kernel Aclk clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI1SEL_PLL1	(UINT32_C(0) << 0)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI1SEL_PLL2	(UINT32_C(1) << 0)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI1SEL_PLL3	(UINT32_C(2) << 0)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI1SEL_I2S	(UINT32_C(3) << 0)	//< I2S_CKIN
#define MCCI_STM32H7_REG_RCC_CDCCIP1R_SAI1SEL_PER	(UINT32_C(4) << 0)	//< per_ck
///	@}

/// \name RCC_CDCCIP2R bits
///	@{
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RSV31		(UINT32_C(1) << 31)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_LPTIM1SEL		(UINT32_C(7) << 28)	//< LPTIM1 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_LPTIM1SEL_PCLK1	(UINT32_C(0) << 28)	//< rcc_pclk1
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_LPTIM1SEL_PLL2	(UINT32_C(1) << 28)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_LPTIM1SEL_PLL3	(UINT32_C(2) << 28)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_LPTIM1SEL_LSE	(UINT32_C(3) << 28)	//< lse_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_LPTIM1SEL_LSI	(UINT32_C(4) << 28)	//< lsi_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_LPTIM1SEL_PER	(UINT32_C(5) << 28)	//< per_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RSV24		(UINT32_C(0xF) << 24)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_CECSEL		(UINT32_C(3) << 22)	//< HDMI-CEC kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_CECSEL_LSE	(UINT32_C(0) << 22)	//< lse_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_CECSEL_LSI	(UINT32_C(1) << 22)	//< lsi_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_CECSEL_CSI	(UINT32_C(2) << 22)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USBSEL		(UINT32_C(3) << 20)	//< USBOTG 1 and 2 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USBSEL_DIS	(UINT32_C(0) << 20)	//< disable
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USBSEL_PLL1	(UINT32_C(1) << 20)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USBSEL_PLL3	(UINT32_C(2) << 20)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USBSEL_HSI48	(UINT32_C(3) << 20)	//< hsi48_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RSV14		(UINT32_C(0x3F) << 14)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_I2C123SEL		(UINT32_C(7) << 12)	//< I2C1,2,3 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_I2C123SEL_PCLK1	(UINT32_C(0) << 12)	//< rcc_pclk1
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_I2C123SEL_PLL3	(UINT32_C(1) << 12)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_I2C123SEL_HSI	(UINT32_C(2) << 12)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_I2C123SEL_CSI	(UINT32_C(3) << 12)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RSV10		(UINT32_C(3) << 10)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RNGSEL		(UINT32_C(3) << 8)	//< RNG kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RNGSEL_HSI48	(UINT32_C(0) << 8)	//< hsi48_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RNGSEL_PLL1	(UINT32_C(1) << 8)	//< pll1_q_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RNGSEL_LSE	(UINT32_C(2) << 8)	//< lse_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RNGSEL_LSI	(UINT32_C(3) << 8)	//< lsi_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_RSV6		(UINT32_C(3) << 6)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART16910SEL		(UINT32_C(7) << 3)	//< USART1, 6, 9 and 10 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART16910SEL_PCLK2	(UINT32_C(0) << 3)	//< rcc_pclk2
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART16910SEL_PLL2	(UINT32_C(1) << 3)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART16910SEL_PLL3	(UINT32_C(2) << 3)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART16910SEL_HSI		(UINT32_C(3) << 3)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART16910SEL_CSI		(UINT32_C(4) << 3)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART16910SEL_LSE		(UINT32_C(5) << 3)	//< lse_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART234578SEL		(UINT32_C(7) << 0)	//< USART2/3, UART4,5, 7 and 8 (APB1) kernel clock source selection
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART234578SEL_PCLK1	(UINT32_C(0) << 0)	//< rcc_pclk1
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART234578SEL_PLL2	(UINT32_C(1) << 0)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART234578SEL_PLL3	(UINT32_C(2) << 0)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART234578SEL_HSI	(UINT32_C(3) << 0)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART234578SEL_CSI	(UINT32_C(4) << 0)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_CDCCIP2R_USART234578SEL_LSE	(UINT32_C(5) << 0)	//< lse_ck
///	@}

