mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_SRDCCIPR bits
///	@{
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_RSV31		(UINT32_C(1) << 31)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL		(UINT32_C(7) << 28)	//< SPI6 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL_PCLK4	(UINT32_C(0) << 28)	//< rcc_pclk4
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL_PLL2	(UINT32_C(1) << 28)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL_PLL3	(UINT32_C(2) << 28)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL_HSI	(UINT32_C(3) << 28)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL_CSI	(UINT32_C(4) << 28)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL_HSE	(UINT32_C(5) << 28)	//< hse_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_SPI6SEL_I2S	(UINT32_C(6) << 28)	//< I2S_CKIN
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_DFSDM2SEL		(UINT32_C(1) << 27)	//< DFSDM2 kernel Clk clock source selection
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_RSV18		(UINT32_C(0x1FF) << 18)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_ADCSEL		(UINT32_C(3) << 16)	//< SAR ADC kernel clock source selection
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_ADCSEL_PLL2	(UINT32_C(0) << 16)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_ADCSEL_PLL3	(UINT32_C(1) << 16)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_ADCSEL_PER	(UINT32_C(2) << 16)	//< per_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM3SEL		(UINT32_C(7) << 13)	//< LPTIM3 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM3SEL_PCLK4	(UINT32_C(0) << 13)	//< rcc_pclk4
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM3SEL_PLL2	(UINT32_C(1) << 13)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM3SEL_PLL3	(UINT32_C(2) << 13)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM3SEL_LSE	(UINT32_C(3) << 13)	//< lse_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM3SEL_LSI	(UINT32_C(4) << 13)	//< lsi_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM3SEL_PER	(UINT32_C(5) << 13)	//< per_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM2SEL		(UINT32_C(7) << 10)	//< LPTIM2 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM2SEL_PCLK4	(UINT32_C(0) << 10)	//< rcc_pclk4
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM2SEL_PLL2	(UINT32_C(1) << 10)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM2SEL_PLL3	(UINT32_C(2) << 10)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM2SEL_LSE	(UINT32_C(3) << 10)	//< lse_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM2SEL_LSI	(UINT32_C(4) << 10)	//< lsi_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPTIM2SEL_PER	(UINT32_C(5) << 10)	//< per_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_I2C4SEL		(UINT32_C(3) << 8)	//< I2C4 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_I2C4SEL_PCLK4	(UINT32_C(0) << 8)	//< rcc_pclk4
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_I2C4SEL_PLL3	(UINT32_C(1) << 8)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_I2C4SEL_HSI	(UINT32_C(2) << 8)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_I2C4SEL_CSI	(UINT32_C(3) << 8)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_RSV3		(UINT32_C(0x1F) << 3)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPUART1SEL	(UINT32_C(7) << 0)	//< LPUART1 kernel clock source selection
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPUART1SEL_PCLK4	(UINT32_C(0) << 0)	//< rcc_pclk4
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPUART1SEL_PLL2	(UINT32_C(1) << 0)	//< pll2_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPUART1SEL_PLL3	(UINT32_C(2) << 0)	//< pll3_r_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPUART1SEL_HSI	(UINT32_C(3) << 0)	//< hsi_ker_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPUART1SEL_CSI	(UINT32_C(4) << 0)	//< csi_ker_ck
#define MCCI_STM32H7_REG_RCC_SRDCCIPR_LPUART1SEL_LSE	(UINT32_C(5) << 0)	//< lse_ck
///	@}

/// \name RCC_CIER bits
///	@{
#define MCCI_STM32H7_REG_RCC_CIER_RSV10		UINT32_C(0xFFFFFC00)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CIER_LSECSSIE	(UINT32_C(1) << 9)	//< LSE clock security system interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_PLL3RDYIE	(UINT32_C(1) << 8)	//< PLL3 ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_PLL2RDYIE	(UINT32_C(1) << 7)	//< PLL2 ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_PLL1RDYIE	(UINT32_C(1) << 6)	//< PLL1 ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_HSI48RDYIE	(UINT32_C(1) << 5)	//< HSI48 ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_CSIRDYIE	(UINT32_C(1) << 4)	//< CSI ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_HSERDYIE	(UINT32_C(1) << 3)	//< HSE ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_HSIRDYIE	(UINT32_C(1) << 2)	//< HSI ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_LSERDYIE	(UINT32_C(1) << 1)	//< LSE ready interrupt enable
#define MCCI_STM32H7_REG_RCC_CIER_LSIRDYIE	(UINT32_C(1) << 0)	//< LSI ready interrupt enable
///	@}

/// \name RCC_CIFR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CIFR_RSV11		UINT32_C(0xFFFFF800)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CIFR_HSECSSF	(UINT32_C(1) << 10)	//< LSE clock security system interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_LSECSSF	(UINT32_C(1) << 9)	//< LSE clock security system interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_PLL3RDYF	(UINT32_C(1) << 8)	//< PLL3 ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_PLL2RDYF	(UINT32_C(1) << 7)	//< PLL2 ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_PLL1RDYF	(UINT32_C(1) << 6)	//< PLL1 ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_HSI48RDYF	(UINT32_C(1) << 5)	//< HSI48 ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_CSIRDYF	(UINT32_C(1) << 4)	//< CSI ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_HSERDYF	(UINT32_C(1) << 3)	//< HSE ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_HSIRDYF	(UINT32_C(1) << 2)	//< HSI ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_LSERDYF	(UINT32_C(1) << 1)	//< LSE ready interrupt flag
#define MCCI_STM32H7_REG_RCC_CIFR_LSIRDYF	(UINT32_C(1) << 0)	//< LSI ready interrupt flag
///	@}

/// \name RCC_CICR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CICR_RSV11		UINT32_C(0xFFFFF800)	//< reserved, no change
#define MCCI_STM32H7_REG_RCC_CICR_HSECSSC	(UINT32_C(1) << 10)	//< LSE clock security system interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_LSECSSC	(UINT32_C(1) << 9)	//< LSE clock security system interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_PLL3RDYC	(UINT32_C(1) << 8)	//< PLL3 ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_PLL2RDYC	(UINT32_C(1) << 7)	//< PLL2 ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_PLL1RDYC	(UINT32_C(1) << 6)	//< PLL1 ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_HSI48RDYC	(UINT32_C(1) << 5)	//< HSI48 ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_CSIRDYC	(UINT32_C(1) << 4)	//< CSI ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_HSERDYC	(UINT32_C(1) << 3)	//< HSE ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_HSIRDYC	(UINT32_C(1) << 2)	//< HSI ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_LSERDYC	(UINT32_C(1) << 1)	//< LSE ready interrupt clear
#define MCCI_STM32H7_REG_RCC_CICR_LSIRDYC	(UINT32_C(1) << 0)	//< LSI ready interrupt clear
///	@}

/// \name RCC_BDCR bits
///	@{
#define MCCI_STM32H7_REG_RCC_BDCR_RSV17		UINT32_C(0xFFFE0000)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_BDCR_VSWRST	(UINT32_C(1) << 16)	//< VSwitch domain software reset
#define MCCI_STM32H7_REG_RCC_BDCR_RTCEN		(UINT32_C(1) << 15)	//< RTC clock enable
#define MCCI_STM32H7_REG_RCC_BDCR_RSV10		(UINT32_C(0x1F) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_BDCR_RTCSEL	(UINT32_C(3) << 8)	//< RTC clock source selection
#define MCCI_STM32H7_REG_RCC_BDCR_RTCSEL_NO	(UINT32_C(0) << 8)	//< no clock (default after Backup domain reset)
#define MCCI_STM32H7_REG_RCC_BDCR_RTCSEL_LSE	(UINT32_C(1) << 8)	//< LSE
#define MCCI_STM32H7_REG_RCC_BDCR_RTCSEL_LSI	(UINT32_C(2) << 8)	//< LSI
#define MCCI_STM32H7_REG_RCC_BDCR_RTCSEL_HSE	(UINT32_C(3) << 8)	//< HSE
#define MCCI_STM32H7_REG_RCC_BDCR_LSEEXT	(UINT32_C(1) << 7)	//< low-speed external clock type in Bypass mode
#define MCCI_STM32H7_REG_RCC_BDCR_LSECSSD	(UINT32_C(1) << 6)	//< LSE clock security system failure detection
#define MCCI_STM32H7_REG_RCC_BDCR_LSECSSON	(UINT32_C(1) << 5)	//< LSE clock security system enable
#define MCCI_STM32H7_REG_RCC_BDCR_LSEDRV	(UINT32_C(3) << 3)	//< LSE oscillator driving capability
#define MCCI_STM32H7_REG_RCC_BDCR_LSEDRV_LOWEST	(UINT32_C(0) << 3)	//< lowest drive (default after Backup domain reset)
#define MCCI_STM32H7_REG_RCC_BDCR_LSEDRV_MEDLOW	(UINT32_C(1) << 3)	//< medium-low drive
#define MCCI_STM32H7_REG_RCC_BDCR_LSEDRV_MEDHI	(UINT32_C(2) << 3)	//< medium-high drive
#define MCCI_STM32H7_REG_RCC_BDCR_LSEDRV_HIEST	(UINT32_C(3) << 3)	//< highest drive
#define MCCI_STM32H7_REG_RCC_BDCR_LSEBYP	(UINT32_C(1) << 2)	//< LSE oscillator bypass
#define MCCI_STM32H7_REG_RCC_BDCR_LSERDY	(UINT32_C(1) << 1)	//< LSE oscillator ready
#define MCCI_STM32H7_REG_RCC_BDCR_LSEON		(UINT32_C(1) << 0)	//< LSE oscillator enabled
///	@}

/// \name RCC_CSR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CSR_RSV2		UINT32_C(0xFFFFFFFC)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_CSR_LSIRDY		(UINT32_C(1) << 1)	//< LSI oscillator ready
#define MCCI_STM32H7_REG_RCC_CSR_LSION		(UINT32_C(1) << 0)	//< LSI oscillator enable
///	@}

/// \name RCC_AHB3RSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_RSV25	(UINT32_C(0x7F) << 25)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_GFXMMURST	(UINT32_C(1) << 24)	//< GFXMMU reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_OTFD2RST	(UINT32_C(1) << 23)	//< OTFD2 reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_OTFD1RST	(UINT32_C(1) << 22)	//< OTFD1 reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_OCTOSPIMRST (UINT32_C(1) << 21)	//< OCTOSPIM reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_RSV20	(UINT32_C(1) << 20)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_OCTOSPI2RST (UINT32_C(1) << 19)	//< OCTOSPI2 and OCTOSPI2 delay block reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_RSV17	(UINT32_C(3) << 17)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_SDMMC1RST	(UINT32_C(1) << 16)	//< SDMMC1 and SDMMC1 delay blocks reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_RSV15	(UINT32_C(1) << 15)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_OCTOSPI1RST (UINT32_C(1) << 14)	//< OCTOSPI1 and OCTOSPI1 delay blocks reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_RSV13	(UINT32_C(1) << 13)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_FMCRST	(UINT32_C(1) << 12)	//< FMC block reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_RSV6	(UINT32_C(0x3F) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_JPGDECRST	(UINT32_C(1) << 5)	//< JPGDEC block reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_DMA2DRST	(UINT32_C(1) << 4)	//< DMA2D block reset
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_RSV1	(UINT32_C(7) << 1)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3RSTR_MDMARST	(UINT32_C(1) << 0)	//< MDMA block reset
///	@}

