mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_AHB1RSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_RSV26	(UINT32_C(0x3F) << 26)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_USB1OTGRST (UINT32_C(1) << 25)	//< USB1OTG block reset
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_RSV10	(UINT32_C(0x7FFF) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_CRCRST	(UINT32_C(1) << 9)	//< CRC block reset
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_RSV6	(UINT32_C(7) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_ADC12RST	(UINT32_C(1) << 5)	//< ADC1 and 2 blocks reset
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_RSV2	(UINT32_C(7) << 2)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_DMA2RST	(UINT32_C(1) << 1)	//< DMA2 and DMAMUX2 blocks reset
#define MCCI_STM32H7_REG_RCC_AHB1RSTR_DMA1RST	(UINT32_C(1) << 0)	//< DMA1 and DMAMUX1 blocks reset
///	@}

/// \name RCC_AHB2RSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_RSV12	UINT32_C(0xFFFFF000)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_BDMA1RST	(UINT32_C(1) << 11)	//< BDMA1 reset
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_RSV10	(UINT32_C(1) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_SDMMC2RST	(UINT32_C(1) << 9)	//< SDMMC2 and SDMMC2 delay blocks reset
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_RSV7	(UINT32_C(3) << 7)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_RNGRST	(UINT32_C(1) << 6)	//< random number generator block reset
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_HASHRST	(UINT32_C(1) << 5)	//< hash block reset
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_CRYPTRST	(UINT32_C(1) << 4)	//< cryptography block reset
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_RSV3	(UINT32_C(1) << 3)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_HSEMRST	(UINT32_C(1) << 2)	//< HSEM block reset
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_RSV1	(UINT32_C(1) << 1)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_DCMIRST	(UINT32_C(1) << 0)	//< digital camera interface block reset
#define MCCI_STM32H7_REG_RCC_AHB2RSTR_PSSIRST	(UINT32_C(1) << 0)	//< PSSI block reset
///	@}

/// \name RCC_AHB4RSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_RSV22	UINT32_C(0xFFC00000)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_BDMA2RST	(UINT32_C(1) << 21)	//< SmartRun domain DMA and DMAMUX blocks reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_RSV11	(UINT32_C(0x3FF) << 11)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOKRST	(UINT32_C(1) << 10)	//< GPIOK block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOJRST	(UINT32_C(1) << 9)	//< GPIOJ block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOIRST	(UINT32_C(1) << 8)	//< GPIOI block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOHRST	(UINT32_C(1) << 7)	//< GPIOH block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOGRST	(UINT32_C(1) << 6)	//< GPIOG block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOFRST	(UINT32_C(1) << 5)	//< GPIOF block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOERST	(UINT32_C(1) << 4)	//< GPIOE block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIODRST	(UINT32_C(1) << 3)	//< GPIOD block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOCRST	(UINT32_C(1) << 2)	//< GPIOC block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOBRST	(UINT32_C(1) << 1)	//< GPIOB block reset
#define MCCI_STM32H7_REG_RCC_AHB4RSTR_GPIOARST	(UINT32_C(1) << 0)	//< GPIOA block reset
///	@}

/// \name RCC_APB3RSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB3RSTR_RSV4	UINT32_C(0xFFFFFFF0)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB3RSTR_LTDCRST	(UINT32_C(1) << 3)	///< LTDCRST block reset
#define MCCI_STM32H7_REG_RCC_APB3RSTR_RSV0	(UINT32_C(7) << 0)	///< reserved, don't change
///	@}

/// \name RCC_APB1LRSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_UART8RST		(UINT32_C(1) << 31)	//< UART8 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_UART7RST		(UINT32_C(1) << 30)	//< UART7 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_DAC1RST		(UINT32_C(1) << 29)	//< DAC1 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_RSV28		(UINT32_C(1) << 28)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_CECRST		(UINT32_C(1) << 27)	//< CEC reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_RSV24		(UINT32_C(7) << 24)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_I2C3RST		(UINT32_C(1) << 23)	//< I2C3 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_I2C2RST		(UINT32_C(1) << 22)	//< I2C2 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_I2C1RST		(UINT32_C(1) << 21)	//< I2C1 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_USART5RST	(UINT32_C(1) << 20)	//< USART5 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_USART4RST	(UINT32_C(1) << 19)	//< USART4 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_USART3RST	(UINT32_C(1) << 18)	//< USART3 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_USART2RST	(UINT32_C(1) << 17)	//< USART2 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_SPDIFRXRST	(UINT32_C(1) << 16)	//< SPDIFRX reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_SPI3RST		(UINT32_C(1) << 15)	//< SPI3 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_SPI2RST		(UINT32_C(1) << 14)	//< SPI2 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_RSV10		(UINT32_C(0xF) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_LPTIM1RST	(UINT32_C(1) << 9)	//< LPTIM1 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM14RST		(UINT32_C(1) << 8)	//< TIM14 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM13RST		(UINT32_C(1) << 7)	//< TIM13 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM12RST		(UINT32_C(1) << 6)	//< TIM12 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM7RST		(UINT32_C(1) << 5)	//< TIM7 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM6RST		(UINT32_C(1) << 4)	//< TIM6 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM5RST		(UINT32_C(1) << 3)	//< TIM5 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM4RST		(UINT32_C(1) << 2)	//< TIM4 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM3RST		(UINT32_C(1) << 1)	//< TIM3 reset
#define MCCI_STM32H7_REG_RCC_APB1LRSTR_TIM2RST		(UINT32_C(1) << 0)	//< TIM2 reset
///	@}

/// \name RCC_APB1HRSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_RSV9		UINT32_C(0xFFFFFE00)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_FDCANRST		(UINT32_C(1) << 8)	//< FDCAN reset
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_RSV6		(UINT32_C(3) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_MDIOSRST		(UINT32_C(1) << 5)	//< MDIOS reset
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_OPAMPRST		(UINT32_C(1) << 4)	//< OPAMP reset
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_RSV3		(UINT32_C(1) << 3)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_SWPMIRST		(UINT32_C(1) << 2)	//< SWPMI reset
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_CRSRST		(UINT32_C(1) << 1)	//< CRS reset
#define MCCI_STM32H7_REG_RCC_APB1HRSTR_RSV0		(UINT32_C(1) << 0)	//< reserved, don't change
///	@}

/// \name RCC_APB2RSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB2RSTR_RSV31		(UINT32_C(1) << 31)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2RSTR_DFSDM1RST		(UINT32_C(1) << 30)	///< DFSDM1 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_RSV24		(UINT32_C(0x3F) << 24)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2RSTR_SAI2RST		(UINT32_C(1) << 23)	///< SAI2 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_SAI1RST		(UINT32_C(1) << 22)	///< SAI1 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_RSV21		(UINT32_C(1) << 21)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2RSTR_SPI5RST		(UINT32_C(1) << 20)	///< SPI5 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_RSV19		(UINT32_C(1) << 19)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2RSTR_TIM17RST		(UINT32_C(1) << 18)	///< TIM17 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_TIM16RST		(UINT32_C(1) << 17)	///< TIM16 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_TIM15RST		(UINT32_C(1) << 16)	///< TIM15 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_RSV14		(UINT32_C(3) << 14)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2RSTR_SPI4RST		(UINT32_C(1) << 13)	///< SPI4 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_SPI1RST		(UINT32_C(1) << 12)	///< SPI1 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_RSV8		(UINT32_C(0xF) << 8)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2RSTR_USART10RST	(UINT32_C(1) << 7)	///< USART10 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_UART9RST		(UINT32_C(1) << 6)	///< UART9 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_USART6RST		(UINT32_C(1) << 5)	///< USART6 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_USART1RST		(UINT32_C(1) << 4)	///< USART1 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_RSV2		(UINT32_C(3) << 2)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2RSTR_TIM8RST		(UINT32_C(1) << 1)	///< TIM8 reset
#define MCCI_STM32H7_REG_RCC_APB2RSTR_TIM1RST		(UINT32_C(1) << 0)	///< TIM1 reset
///	@}

/// \name RCC_APB4RSTR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV28		(UINT32_C(0xF) << 28)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4RSTR_DFSDM2RST		(UINT32_C(1) << 27)	//< DFSDM2 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_DTSRST		(UINT32_C(1) << 26)	//< DTS reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV16		(UINT32_C(0x3FF) << 16)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4RSTR_VREFRST		(UINT32_C(1) << 15)	//< VREF reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_COMP12RST		(UINT32_C(1) << 14)	//< COMP12 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_DAC2RST		(UINT32_C(1) << 13)	//< DAC2 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV11		(UINT32_C(3) << 11)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4RSTR_LPTIM3RST		(UINT32_C(1) << 10)	//< LPTIM3 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_LPTIM2RST		(UINT32_C(1) << 9)	//< LPTIM2 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV8		(UINT32_C(1) << 8)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4RSTR_I2C4RST		(UINT32_C(1) << 7)	//< I2C4 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV6		(UINT32_C(1) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4RSTR_SPI6RST		(UINT32_C(1) << 5)	//< SPI6 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV4		(UINT32_C(1) << 4)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4RSTR_LPUART1RST	(UINT32_C(1) << 3)	//< LPUART1 reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV2		(UINT32_C(1) << 2)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4RSTR_SYSCFGRST		(UINT32_C(1) << 1)	//< SYSCFG reset
#define MCCI_STM32H7_REG_RCC_APB4RSTR_RSV0		(UINT32_C(1) << 0)	//< reserved, don't change
///	@}

/// \name RCC_SRDAMR bits
///	@{
#define MCCI_STM32H7_REG_RCC_SRDAMR_RSV25	(UINT32_C(3) << 30)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_SRDAMR_SRDSRAMAMEN	(UINT32_C(1) << 29)	//< SmartRun domain SRAM Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_BKPRAMAMEN	(UINT32_C(1) << 28)	//< Backup RAM Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_DFSDM2AMEN	(UINT32_C(1) << 27)	//< DFSDM2 Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_DTSAMEN	(UINT32_C(1) << 26)	//< Digital temperature sensor Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_RSV17	(UINT32_C(0x1FF) << 17)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_SRDAMR_RTCAMEN	(UINT32_C(1) << 16)	//< RTC Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_VREFAMEN	(UINT32_C(1) << 15)	//< VREF Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_COMP12AMEN	(UINT32_C(1) << 14)	//< COMP1 and 2 Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_DAC2AMEN	(UINT32_C(1) << 13)	//< DAC2 (containing one converter) Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_RSV11	(UINT32_C(3) << 11)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_SRDAMR_LPTIM3AMEN	(UINT32_C(1) << 10)	//< LPTIM3 Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_LPTIM2AMEN	(UINT32_C(1) << 9)	//< LPTIM2 Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_RSV8	(UINT32_C(7) << 8)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_SRDAMR_I2C4AMEN	(UINT32_C(1) << 7)	//< I2C4 Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_RSV6	(UINT32_C(1) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_SRDAMR_SPI6AMEN	(UINT32_C(1) << 5)	//< SPI6 Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_RSV4	(UINT32_C(1) << 4)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_SRDAMR_LPUART1AMEN	(UINT32_C(1) << 3)	//< LPUART1 Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_RSV2	(UINT32_C(1) << 2)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_SRDAMR_GPIOAMEN	(UINT32_C(1) << 1)	//< GPIO Autonomous mode enable
#define MCCI_STM32H7_REG_RCC_SRDAMR_BDMA2AMEN	(UINT32_C(1) << 0)	//< SmartRun domain DMA and DMAMUX Autonomous mode enable
///	@}

/// \name RCC_CKGAENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_CKGAENR_JTAGCKG	(UINT32_C(1) << 31)	//< JTAG automatic clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_EXTICKG	(UINT32_C(1) << 30)	//< EXTI clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_ECCRAMCKG	(UINT32_C(1) << 29)	//< RAM error code correction (ECC) clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_RSV18	UINT32_C(0x1FFC0000)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_CKGAENR_GFXMMUSCKG	(UINT32_C(1) << 17)	//< AXI matrix slave GFXMMU clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_AXIRAM3CKG	(UINT32_C(1) << 16)	//< AXI matrix slave SRAM3 clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_AXIRAM2CKG	(UINT32_C(1) << 15)	//< AXI matrix slave SRAM2 clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_AXIRAM1CKG	(UINT32_C(1) << 14)	//< AXI slave SRAM1 clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_OCTOSPI1CKG (UINT32_C(1) << 13)	//< AXI slave OCTOSPI1 clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_FMCCKG	(UINT32_C(1) << 12)	//< AXI slave FMC clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_OCTOSPI2CKG (UINT32_C(1) << 11)	//< AXI slave OCTOSPI2 clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_FLIFTCKG	(UINT32_C(1) << 10)	//< AXI slave Flash interface (FLIFT) clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_AHB34CKG	(UINT32_C(1) << 9)	//< AXI slave AHB34 clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_AHB12CKG	(UINT32_C(1) << 8)	//< AXI slave AHB12 clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_GFXMMUMCKG	(UINT32_C(1) << 7)	//< AXI master GFXMMU clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_LTDCCKG	(UINT32_C(1) << 6)	//< AXI master LTDC clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_DMA2DCKG	(UINT32_C(1) << 5)	//< AXI master DMA2D clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_MDMACKG	(UINT32_C(1) << 4)	//< AXI master MDMA clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_SDMMCCKG	(UINT32_C(1) << 3)	//< AXI master SDMMC clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_CPUCKG	(UINT32_C(1) << 2)	//< AXI master CPU clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_AHBCKG	(UINT32_C(1) << 1)	//< AXI master AHB clock gating
#define MCCI_STM32H7_REG_RCC_CKGAENR_AXICKG	(UINT32_C(1) << 0)	//< AXI interconnect matrix clock gating
///	@}

/// \name RCC_RSR bits
///	@{
#define MCCI_STM32H7_REG_RCC_RSR_RSV31		(UINT32_C(1) << 31)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_RSR_LPWRRSTF	(UINT32_C(1) << 30)	//< reset due to illegal CD DStop or CD DStop2 or CPU CStop flag
#define MCCI_STM32H7_REG_RCC_RSR_RSV29		(UINT32_C(1) << 29)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_RSR_WWDGRSTF	(UINT32_C(1) << 28)	//< window watchdog reset flag
#define MCCI_STM32H7_REG_RCC_RSR_RSV27		(UINT32_C(1) << 27)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_RSR_IWDGRSTF	(UINT32_C(1) << 26)	//< independent watchdog reset flag
#define MCCI_STM32H7_REG_RCC_RSR_RSV25		(UINT32_C(1) << 25)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_RSR_SFTRSTF	(UINT32_C(1) << 24)	//< system reset from CPU reset flag
#define MCCI_STM32H7_REG_RCC_RSR_PORRSTF	(UINT32_C(1) << 23)	//< POR/PDR reset flag
#define MCCI_STM32H7_REG_RCC_RSR_PINRSTF	(UINT32_C(1) << 22)	//< pin reset flag (NRST)
#define MCCI_STM32H7_REG_RCC_RSR_BORRSTF	(UINT32_C(1) << 21)	//< BOR reset flag
#define MCCI_STM32H7_REG_RCC_RSR_RSV20		(UINT32_C(1) << 20)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_RSR_CDRSTF		(UINT32_C(1) << 19)	//< CPU domain power-switch reset flag
#define MCCI_STM32H7_REG_RCC_RSR_RSV18		(UINT32_C(3) << 18)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_RSR_RMVF		(UINT32_C(1) << 16)	//< remove reset flag
#define MCCI_STM32H7_REG_RCC_RSR_RSV0		UINT32_C(0x0000FFFF)	//< reserved, don't change
///	@}

/// \name RCC_AHB3ENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB3ENR_RSV25	(UINT32_C(0x7F) << 25)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3ENR_GFXMMUEN	(UINT32_C(1) << 24)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_OTFD2EN	(UINT32_C(1) << 23)	//< OTFD2 clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_OTFD1EN	(UINT32_C(1) << 22)	//< OTFD1 clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_OCTOSPIMEN	(UINT32_C(1) << 21)	//< OCTOSPIM clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_RSV20	(UINT32_C(1) << 20)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3ENR_OCTOSPI2EN	(UINT32_C(1) << 19)	//< OCTOSPI2 clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_RSV17	(UINT32_C(3) << 17)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3ENR_SDMMC1EN	(UINT32_C(1) << 16)	//< SDMMC1 and SDMMC1 delay clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_RSV15	(UINT32_C(1) << 15)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3ENR_OCTOSPI1EN	(UINT32_C(1) << 14)	//< OCTOSPI1 and OCTOSPI1 delay clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_RSV13	(UINT32_C(1) << 13)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3ENR_FMCEN	(UINT32_C(1) << 12)	//< FMC peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_RSV6	(UINT32_C(0x3F) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3ENR_JPGDECEN	(UINT32_C(1) << 5)	//< JPGDEC peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_DMA2DEN	(UINT32_C(1) << 4)	//< DMA2D peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB3ENR_RSV1	(UINT32_C(7) << 1)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3ENR_MDMAEN	(UINT32_C(1) << 0)	//< MDMA peripheral clock enable
///	@}

/// \name RCC_AHB1ENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB1ENR_RSV27	(UINT32_C(0x1F) << 27)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1ENR_USB1ULPIEN	(UINT32_C(1) << 26)	//< USB_PHY1 clocks enable
#define MCCI_STM32H7_REG_RCC_AHB1ENR_USB1OTGEN	(UINT32_C(1) << 25)	//< USB1OTG peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB1ENR_RSV10	(UINT32_C(0x7FFF) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1ENR_CRCEN	(UINT32_C(1) << 9)	//< CRC peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB1ENR_RSV6	(UINT32_C(7) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1ENR_ADC12EN	(UINT32_C(1) << 5)	//< ADC1 and 2 peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB1ENR_RSV2	(UINT32_C(7) << 2)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1ENR_DMA2EN	(UINT32_C(1) << 1)	//< DMA2 clock enable
#define MCCI_STM32H7_REG_RCC_AHB1ENR_DMA1EN	(UINT32_C(1) << 0)	//< DMA1 clock enable
///	@}

