mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_AHB2ENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB2ENR_RSV31	(UINT32_C(1) << 31)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2ENR_AHBSRAM2EN	(UINT32_C(1) << 30)	//< AHBSRAM2 block enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_AHBSRAM1EN	(UINT32_C(1) << 29)	//< AHBSRAM1 block enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_RSV12	(UINT32_C(0x1FFFF) << 12) //< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2ENR_BDMA1EN	(UINT32_C(1) << 11)	//< DMA clock enable (DFSDM dedicated DMA)
#define MCCI_STM32H7_REG_RCC_AHB2ENR_RSV10	(UINT32_C(1) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2ENR_SDMMC2EN	(UINT32_C(1) << 9)	//< SDMMC2 and SDMMC2 delay clock enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_RSV7	(UINT32_C(3) << 7)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2ENR_RNGEN	(UINT32_C(1) << 6)	//< RNG peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_HASHEN	(UINT32_C(1) << 5)	//< HASH peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_CRYPTEN	(UINT32_C(1) << 4)	//< CRYPT peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_RSV3	(UINT32_C(1) << 3)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2ENR_HSEMEN	(UINT32_C(1) << 2)	//< HSEM peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_RSV1	(UINT32_C(1) << 1)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2ENR_DCMIEN	(UINT32_C(1) << 0)	//< digital camera interface peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB2ENR_PSSIEN	(UINT32_C(1) << 0)	//< PSSI peripheral clock enable
///	@}

/// \name RCC_AHB4ENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB4ENR_RSV30	(UINT32_C(3) << 30)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4ENR_SRDSRAMEN	(UINT32_C(1) << 29)	//< SRDSRAM enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_BKPRAMEN	(UINT32_C(1) << 28)	//< BKPRAM enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_RSV22	(UINT32_C(0x3F) << 22)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4ENR_BDMA2EN	(UINT32_C(1) << 21)	//< BDMA2 enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_RSV11	(UINT32_C(0x3FF) << 11)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOKEN	(UINT32_C(1) << 10)	//< GPIOK enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOJEN	(UINT32_C(1) << 9)	//< GPIOJ enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOIEN	(UINT32_C(1) << 8)	//< GPIOI enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOHEN	(UINT32_C(1) << 7)	//< GPIOH enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOGEN	(UINT32_C(1) << 6)	//< GPIOG enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOFEN	(UINT32_C(1) << 5)	//< GPIOF enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOEEN	(UINT32_C(1) << 4)	//< GPIOE enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIODEN	(UINT32_C(1) << 3)	//< GPIOD enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOCEN	(UINT32_C(1) << 2)	//< GPIOC enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOBEN	(UINT32_C(1) << 1)	//< GPIOB enable
#define MCCI_STM32H7_REG_RCC_AHB4ENR_GPIOAEN	(UINT32_C(1) << 0)	//< GPIOA enable
///	@}

/// \name RCC_APB3ENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB3ENR_RSV7	UINT32_C(0xFFFFFF80)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB3ENR_WWDGEN	(UINT32_C(1) << 26)	//< WWDG enable
#define MCCI_STM32H7_REG_RCC_APB3ENR_RSV4	(UINT32_C(3) << 4)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB3ENR_LTDCEN	(UINT32_C(1) << 25)	//< LTDC enable
#define MCCI_STM32H7_REG_RCC_APB3ENR_RSV0	(UINT32_C(7) << 0)	//< reserved, don't change
///	@}

/// \name RCC_APB1LENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB1LENR_UART8EN	(UINT32_C(1) << 31)	//< UART8 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_UART7EN	(UINT32_C(1) << 30)	//< UART7 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_DAC1EN	(UINT32_C(1) << 29)	//< DAC1 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_RSV28	(UINT32_C(1) << 28)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LENR_CECEN	(UINT32_C(1) << 27)	//< CEC clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_RSV24	(UINT32_C(7) << 24)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LENR_I2C3EN	(UINT32_C(1) << 23)	//< I2C3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_I2C2EN	(UINT32_C(1) << 22)	//< I2C2 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_I2C1EN	(UINT32_C(1) << 21)	//< I2C1 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_USART5EN	(UINT32_C(1) << 20)	//< USART5 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_USART4EN	(UINT32_C(1) << 19)	//< USART4 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_USART3EN	(UINT32_C(1) << 18)	//< USART3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_USART2EN	(UINT32_C(1) << 17)	//< USART2 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_SPDIFRXEN	(UINT32_C(1) << 16)	//< SPDIFRX clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_SPI3EN	(UINT32_C(1) << 15)	//< SPI3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_SPI2EN	(UINT32_C(1) << 14)	//< SPI2 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_RSV10	(UINT32_C(0xF) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LENR_LPTIM1EN	(UINT32_C(1) << 9)	//< LPTIM1 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM14EN	(UINT32_C(1) << 8)	//< TIM14 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM13EN	(UINT32_C(1) << 7)	//< TIM13 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM12EN	(UINT32_C(1) << 6)	//< TIM12 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM7EN	(UINT32_C(1) << 5)	//< TIM7 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM6EN	(UINT32_C(1) << 4)	//< TIM6 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM5EN	(UINT32_C(1) << 3)	//< TIM5 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM4EN	(UINT32_C(1) << 2)	//< TIM4 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM3EN	(UINT32_C(1) << 1)	//< TIM3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LENR_TIM2EN	(UINT32_C(1) << 0)	//< TIM2 clock enable
///	@}

/// \name RCC_APB1HENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB1HENR_RSV9	UINT32_C(0xFFFFFE00)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HENR_FDCANEN	(UINT32_C(1) << 8)	//< FDCAN clock enable
#define MCCI_STM32H7_REG_RCC_APB1HENR_RSV6	(UINT32_C(3) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HENR_MDIOSEN	(UINT32_C(1) << 5)	//< MDIOS clock enable
#define MCCI_STM32H7_REG_RCC_APB1HENR_OPAMPEN	(UINT32_C(1) << 4)	//< OPAMP clock enable
#define MCCI_STM32H7_REG_RCC_APB1HENR_RSV3	(UINT32_C(1) << 3)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HENR_SWPMIEN	(UINT32_C(1) << 2)	//< SWPMI clock enable
#define MCCI_STM32H7_REG_RCC_APB1HENR_CRSEN	(UINT32_C(1) << 1)	//< CRS clock enable
#define MCCI_STM32H7_REG_RCC_APB1HENR_RSV0	(UINT32_C(1) << 0)	//< reserved, don't change
///	@}

/// \name RCC_APB2ENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB2ENR_RSV31	(UINT32_C(1) << 31)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2ENR_DFSDM1EN	(UINT32_C(1) << 30)	///< DFSDM1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_RSV24	(UINT32_C(0x3F) << 24)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2ENR_SAI2EN	(UINT32_C(1) << 23)	///< SAI2 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_SAI1EN	(UINT32_C(1) << 22)	///< SAI1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_RSV21	(UINT32_C(1) << 21)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2ENR_SPI5EN	(UINT32_C(1) << 20)	///< SPI5 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_RSV19	(UINT32_C(1) << 19)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2ENR_TIM17EN	(UINT32_C(1) << 18)	///< TIM17 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_TIM16EN	(UINT32_C(1) << 17)	///< TIM16 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_TIM15EN	(UINT32_C(1) << 16)	///< TIM15 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_RSV14	(UINT32_C(3) << 14)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2ENR_SPI4EN	(UINT32_C(1) << 13)	///< SPI4 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_SPI1EN	(UINT32_C(1) << 12)	///< SPI1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_RSV8	(UINT32_C(0xF) << 8)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2ENR_USART10EN	(UINT32_C(1) << 7)	///< USART10 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_UART9EN	(UINT32_C(1) << 6)	///< UART9 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_USART6EN	(UINT32_C(1) << 5)	///< USART6 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_USART1EN	(UINT32_C(1) << 4)	///< USART1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_RSV2	(UINT32_C(3) << 2)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2ENR_TIM8EN	(UINT32_C(1) << 1)	///< TIM8 clock enable
#define MCCI_STM32H7_REG_RCC_APB2ENR_TIM1EN	(UINT32_C(1) << 0)	///< TIM1 clock enable
///	@}

