mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_APB4ENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV28	(UINT32_C(0xF) << 28)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4ENR_DFSDM2EN	(UINT32_C(1) << 27)	//< DFSDM2 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_DTSEN	(UINT32_C(1) << 26)	//< DTS clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV17	(UINT32_C(0x1FF) << 17)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4ENR_RTCAPBEN	(UINT32_C(1) << 16)	//< RTCAPB clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_VREFEN	(UINT32_C(1) << 15)	//< VREF clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_COMP12EN	(UINT32_C(1) << 14)	//< COMP12 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_DAC2EN	(UINT32_C(1) << 13)	//< DAC2 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV11	(UINT32_C(3) << 11)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4ENR_LPTIM3EN	(UINT32_C(1) << 10)	//< LPTIM3 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_LPTIM2EN	(UINT32_C(1) << 9)	//< LPTIM2 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV8	(UINT32_C(1) << 8)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4ENR_I2C4EN	(UINT32_C(1) << 7)	//< I2C4 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV6	(UINT32_C(1) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4ENR_SPI6EN	(UINT32_C(1) << 5)	//< SPI6 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV4	(UINT32_C(1) << 4)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4ENR_LPUART1EN	(UINT32_C(1) << 3)	//< LPUART1 clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV2	(UINT32_C(1) << 2)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4ENR_SYSCFGEN	(UINT32_C(1) << 1)	//< SYSCFG clock enable
#define MCCI_STM32H7_REG_RCC_APB4ENR_RSV0	(UINT32_C(1) << 0)	//< reserved, don't change
///	@}

/// \name RCC_AHB3LPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_AXISRAM1LPEN	(UINT32_C(1) << 31)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_ITCMLPEN		(UINT32_C(1) << 30)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_DTCM2LPEN	(UINT32_C(1) << 29)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_DTCM1LPEN	(UINT32_C(1) << 28)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_AXISRAM3LPEN	(UINT32_C(1) << 27)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_AXISRAM2LPEN	(UINT32_C(1) << 26)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV25		(UINT32_C(1) << 25)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_GFXMMULPEN	(UINT32_C(1) << 24)	//< GFXMMU clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_OTFD2LPEN	(UINT32_C(1) << 23)	//< OTFD2 clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_OTFD1LPEN	(UINT32_C(1) << 22)	//< OTFD1 clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_OCTOSPIMLPEN	(UINT32_C(1) << 21)	//< OCTOSPIM clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV20		(UINT32_C(1) << 20)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_OCTOSPI2LPEN	(UINT32_C(1) << 19)	//< OCTOSPI2 clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV17		(UINT32_C(3) << 17)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_SDMMC1LPEN	(UINT32_C(1) << 16)	//< SDMMC1 and SDMMC1 delay clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV15		(UINT32_C(1) << 15)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_OCTOSPI1LPEN	(UINT32_C(1) << 14)	//< OCTOSPI1 and OCTOSPI1 delay clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV13		(UINT32_C(1) << 13)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_FMCLPEN		(UINT32_C(1) << 12)	//< FMC peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV9		(UINT32_C(7) << 9)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_FLITFLPEN	(UINT32_C(1) << 8)	//< FLITF peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV6		(UINT32_C(3) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_JPGDECLPEN	(UINT32_C(1) << 5)	//< JPGDEC peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_DMA2DLPEN	(UINT32_C(1) << 4)	//< DMA2D peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_RSV1		(UINT32_C(7) << 1)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB3LPENR_MDMALPEN		(UINT32_C(1) << 0)	//< MDMA peripheral clock enable
///	@}

/// \name RCC_AHB1LPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_RSV27		(UINT32_C(0x1F) << 27)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_USB1ULPILPEN	(UINT32_C(1) << 26)	//< USB_PHY1 clocks enable
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_USB1OTGLPEN	(UINT32_C(1) << 25)	//< USB1OTG peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_RSV10		(UINT32_C(0x7FFF) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_CRCLPEN		(UINT32_C(1) << 9)	//< CRC peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_RSV6		(UINT32_C(7) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_ADC12LPEN	(UINT32_C(1) << 5)	//< ADC1 and 2 peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_RSV2		(UINT32_C(7) << 2)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_DMA2LPEN		(UINT32_C(1) << 1)	//< DMA2 clock enable
#define MCCI_STM32H7_REG_RCC_AHB1LPENR_DMA1LPEN		(UINT32_C(1) << 0)	//< DMA1 clock enable
///	@}

/// \name RCC_AHB2LPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_RSV31		(UINT32_C(1) << 31)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_AHBSRAM2LPEN	(UINT32_C(1) << 30)	//< AHBSRAM2 block enable
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_AHBSRAM1LPEN	(UINT32_C(1) << 29)	//< AHBSRAM1 block enable
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_RSV12		(UINT32_C(0x1FFFF) << 12) //< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_DFSDMDMALPEN	(UINT32_C(1) << 11)	//< DMA clock enable (DFSDM dedicated DMA)
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_RSV10		(UINT32_C(1) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_SDMMC2LPEN	(UINT32_C(1) << 9)	//< SDMMC2 and SDMMC2 delay clock enable
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_RSV7		(UINT32_C(3) << 7)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_RNGLPEN		(UINT32_C(1) << 6)	//< RNG peripheral clocks enable
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_HASHLPEN		(UINT32_C(1) << 5)	//< HASH peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_CRYPTLPEN	(UINT32_C(1) << 4)	//< CRYPT peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_RSV1		(UINT32_C(7) << 1)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_DCMILPEN		(UINT32_C(1) << 0)	//< digital camera interface peripheral clock enable
#define MCCI_STM32H7_REG_RCC_AHB2LPENR_PSSILPEN		(UINT32_C(1) << 0)	//< PSSI peripheral clock enable
///	@}

