mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name RCC_AHB4LPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_RSV30		(UINT32_C(3) << 30)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_SRDSRAMLPEN	(UINT32_C(1) << 29)	//< SRDSRAM enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_BKPRAMLPEN	(UINT32_C(1) << 28)	//< BKPRAM enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_RSV22		(UINT32_C(0x3F) << 22)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_BDMA2LPEN	(UINT32_C(1) << 21)	//< BDMA2 enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_RSV11		(UINT32_C(0x3FF) << 11)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOKLPEN	(UINT32_C(1) << 10)	//< GPIOK enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOJLPEN	(UINT32_C(1) << 9)	//< GPIOJ enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOILPEN	(UINT32_C(1) << 8)	//< GPIOI enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOHLPEN	(UINT32_C(1) << 7)	//< GPIOH enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOGLPEN	(UINT32_C(1) << 6)	//< GPIOG enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOFLPEN	(UINT32_C(1) << 5)	//< GPIOF enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOELPEN	(UINT32_C(1) << 4)	//< GPIOE enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIODLPEN	(UINT32_C(1) << 3)	//< GPIOD enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOCLPEN	(UINT32_C(1) << 2)	//< GPIOC enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOBLPEN	(UINT32_C(1) << 1)	//< GPIOB enable
#define MCCI_STM32H7_REG_RCC_AHB4LPENR_GPIOALPEN	(UINT32_C(1) << 0)	//< GPIOA enable
///	@}

/// \name RCC_APB3LPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB3LPENR_RSV7	UINT32_C(0xFFFFFF80)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB3LPENR_WWDGLPEN	(UINT32_C(1) << 26)	//< WWDG enable
#define MCCI_STM32H7_REG_RCC_APB3LPENR_RSV4	(UINT32_C(3) << 4)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB3LPENR_LTDCLPEN	(UINT32_C(1) << 25)	//< LTDC enable
#define MCCI_STM32H7_REG_RCC_APB3LPENR_RSV0	(UINT32_C(7) << 0)	//< reserved, don't change
///	@}

/// \name RCC_APB1LLPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_UART8LPEN	(UINT32_C(1) << 31)	//< UART8 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_UART7LPEN	(UINT32_C(1) << 30)	//< UART7 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_DAC1LPEN	(UINT32_C(1) << 29)	//< DAC1 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_RSV28		(UINT32_C(1) << 28)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_CECLPEN		(UINT32_C(1) << 27)	//< CEC clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_RSV24		(UINT32_C(7) << 24)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_I2C3LPEN	(UINT32_C(1) << 23)	//< I2C3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_I2C2LPEN	(UINT32_C(1) << 22)	//< I2C2 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_I2C1LPEN	(UINT32_C(1) << 21)	//< I2C1 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_USART5LPEN	(UINT32_C(1) << 20)	//< USART5 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_USART4LPEN	(UINT32_C(1) << 19)	//< USART4 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_USART3LPEN	(UINT32_C(1) << 18)	//< USART3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_USART2LPEN	(UINT32_C(1) << 17)	//< USART2 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_SPDIFRXLPEN	(UINT32_C(1) << 16)	//< SPDIFRX clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_SPI3LPEN	(UINT32_C(1) << 15)	//< SPI3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_SPI2LPEN	(UINT32_C(1) << 14)	//< SPI2 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_RSV10		(UINT32_C(0xF) << 10)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_LPTIM1LPEN	(UINT32_C(1) << 9)	//< LPTIM1 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM14LPEN	(UINT32_C(1) << 8)	//< TIM14 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM13LPEN	(UINT32_C(1) << 7)	//< TIM13 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM12LPEN	(UINT32_C(1) << 6)	//< TIM12 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM7LPEN	(UINT32_C(1) << 5)	//< TIM7 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM6LPEN	(UINT32_C(1) << 4)	//< TIM6 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM5LPEN	(UINT32_C(1) << 3)	//< TIM5 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM4LPEN	(UINT32_C(1) << 2)	//< TIM4 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM3LPEN	(UINT32_C(1) << 1)	//< TIM3 clock enable
#define MCCI_STM32H7_REG_RCC_APB1LLPENR_TIM2LPEN	(UINT32_C(1) << 0)	//< TIM2 clock enable
///	@}

/// \name RCC_APB1HLPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_RSV9		UINT32_C(0xFFFFFE00)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_FDCANLPEN	(UINT32_C(1) << 8)	//< FDCAN clock enable
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_RSV6		(UINT32_C(3) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_MDIOSLPEN	(UINT32_C(1) << 5)	//< MDIOS clock enable
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_OPAMPLPEN	(UINT32_C(1) << 4)	//< OPAMP clock enable
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_RSV3		(UINT32_C(1) << 3)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_SWPMILPEN	(UINT32_C(1) << 2)	//< SWPMI clock enable
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_CRSLPEN		(UINT32_C(1) << 1)	//< CRS clock enable
#define MCCI_STM32H7_REG_RCC_APB1HLPENR_RSV0		(UINT32_C(1) << 0)	//< reserved, don't change
///	@}

/// \name RCC_APB2LPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB2LPENR_RSV31		(UINT32_C(1) << 31)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2LPENR_DFSDM1LPEN	(UINT32_C(1) << 30)	///< DFSDM1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_RSV24		(UINT32_C(0x3F) << 24)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2LPENR_SAI2LPEN		(UINT32_C(1) << 23)	///< SAI2 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_SAI1LPEN		(UINT32_C(1) << 22)	///< SAI1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_RSV21		(UINT32_C(1) << 21)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2LPENR_SPI5LPEN		(UINT32_C(1) << 20)	///< SPI5 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_RSV19		(UINT32_C(1) << 19)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2LPENR_TIM17LPEN	(UINT32_C(1) << 18)	///< TIM17 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_TIM16LPEN	(UINT32_C(1) << 17)	///< TIM16 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_TIM15LPEN	(UINT32_C(1) << 16)	///< TIM15 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_RSV14		(UINT32_C(3) << 14)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2LPENR_SPI4LPEN		(UINT32_C(1) << 13)	///< SPI4 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_SPI1LPEN		(UINT32_C(1) << 12)	///< SPI1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_RSV8		(UINT32_C(0xF) << 8)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2LPENR_USART10LPEN	(UINT32_C(1) << 7)	///< USART10 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_UART9LPEN	(UINT32_C(1) << 6)	///< UART9 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_USART6LPEN	(UINT32_C(1) << 5)	///< USART6 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_USART1LPEN	(UINT32_C(1) << 4)	///< USART1 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_RSV2		(UINT32_C(3) << 2)	///< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB2LPENR_TIM8LPEN		(UINT32_C(1) << 1)	///< TIM8 clock enable
#define MCCI_STM32H7_REG_RCC_APB2LPENR_TIM1LPEN		(UINT32_C(1) << 0)	///< TIM1 clock enable
///	@}

/// \name RCC_APB4LPENR bits
///	@{
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV28		(UINT32_C(0xF) << 28)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4LPENR_DFSDM2LPEN	(UINT32_C(1) << 27)	//< DFSDM2 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_DTSLPEN		(UINT32_C(1) << 26)	//< DTS clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV17		(UINT32_C(0x1FF) << 17)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RTCAPBLPEN	(UINT32_C(1) << 16)	//< RTCAPB clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_VREFLPEN		(UINT32_C(1) << 15)	//< VREF clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_COMP12LPEN	(UINT32_C(1) << 14)	//< COMP12 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_DAC2LPEN		(UINT32_C(1) << 13)	//< DAC2 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV11		(UINT32_C(3) << 11)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4LPENR_LPTIM3LPEN	(UINT32_C(1) << 10)	//< LPTIM3 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_LPTIM2LPEN	(UINT32_C(1) << 9)	//< LPTIM2 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV8		(UINT32_C(1) << 8)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4LPENR_I2C4LPEN		(UINT32_C(1) << 7)	//< I2C4 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV6		(UINT32_C(1) << 6)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4LPENR_SPI6LPEN		(UINT32_C(1) << 5)	//< SPI6 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV4		(UINT32_C(1) << 4)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4LPENR_LPUART1LPEN	(UINT32_C(1) << 3)	//< LPUART1 clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV2		(UINT32_C(1) << 2)	//< reserved, don't change
#define MCCI_STM32H7_REG_RCC_APB4LPENR_SYSCFGLPEN	(UINT32_C(1) << 1)	//< SYSCFG clock enable
#define MCCI_STM32H7_REG_RCC_APB4LPENR_RSV0		(UINT32_C(1) << 0)	//< reserved, don't change
///	@}

/****************************************************************************\
|
|	GPIO Control Registers
|
\****************************************************************************/

/// \name GPIO register offsets
///	@{
#define MCCI_STM32H7_GPIO_MODER		UINT32_C(0x00)	//< port mode register
#define MCCI_STM32H7_GPIO_OTYPER	UINT32_C(0x04)	//< port output type register
#define MCCI_STM32H7_GPIO_OSPEEDR	UINT32_C(0x08)	//< port output speed register
#define MCCI_STM32H7_GPIO_PUPDR		UINT32_C(0x0C)	//< port pull-up/pull-down register
#define MCCI_STM32H7_GPIO_IDR		UINT32_C(0x10)	//< port input data register
#define MCCI_STM32H7_GPIO_ODR		UINT32_C(0x14)	//< port output data register
#define MCCI_STM32H7_GPIO_BSRR		UINT32_C(0x18)	//< port bit set/reset register
#define MCCI_STM32H7_GPIO_LCKR		UINT32_C(0x1C)	//< port configuration lock register
#define MCCI_STM32H7_GPIO_AFRL		UINT32_C(0x20)	//< port alternate function low register
#define MCCI_STM32H7_GPIO_AFRH		UINT32_C(0x24)	//< port alternate function high register
///	@}

/// \name GPIO_MODER bits -- used to select pin mode, two bits per pin
///	@{
#define MCCI_STM32H7_GPIO_MODE_MASK	UINT32_C(3)	//< mode bit masks
#define MCCI_STM32H7_GPIO_MODE_IN	UINT32_C(0)	//< digital input
#define MCCI_STM32H7_GPIO_MODE_OUT	UINT32_C(1)	//< digital output
#define MCCI_STM32H7_GPIO_MODE_AF	UINT32_C(2)	//< alternate function
#define MCCI_STM32H7_GPIO_MODE_ANALOG	UINT32_C(3)	//< analog
///	@}

