mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \brief compute the mask for the mode bits for port bits 0..31
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32H7_GPIO_MODE_P(3),
///		MCCI_STM32H7_GPIO_MODE_IN
///		)`
///
#define	MCCI_STM32H7_GPIO_MODE_P(p)	(UINT32_C(3) << (2 * (p)))
#define	MCCI_STM32H7_GPIO_MODE_PV(p, v)	((v) << (2 * (p)))

/// \name GPIO_OTYPER bits
///	@{
#define	MCCI_STM32H7_GPIO_OTYPE_PP	UINT32_C(0)	//< Output push-pull
#define	MCCI_STM32H7_GPIO_OTYPE_OD	UINT32_C(1)	//< Output open-drain
///	@}


/// \brief compute the mask for the mode bits for port bits 0..15
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32H7_GPIO_OTYPE_P(3),
///		MCCI_STM32H7_GPIO_OTYPE_PP
///		)`
///
#define	MCCI_STM32H7_GPIO_OTYPE_P(p)		(UINT32_C(1) << (p))
#define	MCCI_STM32H7_GPIO_OTYPE_PV(p, v)	((v) << (p))

/// \name GPIO_OSPEEDR bits -- used to select pin speed, two bits per pin
///	@{
#define MCCI_STM32H7_GPIO_OSPEED_MASK	UINT32_C(3)	//< speed bit masks
#define MCCI_STM32H7_GPIO_OSPEED_LOW	UINT32_C(0)	//< low
#define MCCI_STM32H7_GPIO_OSPEED_MEDIUM	UINT32_C(1)	//< medium
#define MCCI_STM32H7_GPIO_OSPEED_HIGH	UINT32_C(2)	//< high
#define MCCI_STM32H7_GPIO_OSPEED_VHIGH	UINT32_C(3)	//< very high
///	@}

/// \brief compute the mask for the mode bits for port bits 0..31
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32H7_GPIO_OSPEED_P(3),
///		MCCI_STM32H7_GPIO_OSPEED_IN
///		)`
///
#define	MCCI_STM32H7_GPIO_OSPEED_P(p)		(UINT32_C(3) << (2 * (p)))
#define	MCCI_STM32H7_GPIO_OSPEED_PV(p, v)	((v) << (2 * (p)))

/// \name GPIO_PUPDR bits -- used to select pin speed, two bits per pin
///	@{
#define MCCI_STM32H7_GPIO_PUPD_MASK	UINT32_C(3)	//< speed bit masks
#define MCCI_STM32H7_GPIO_PUPD_NONE	UINT32_C(0)	//< no pullup/pulldown
#define MCCI_STM32H7_GPIO_PUPD_PULLUP	UINT32_C(1)	//< pullup
#define MCCI_STM32H7_GPIO_PUPD_PULLDOWN	UINT32_C(2)	//< pulldown
///	@}

/// \brief compute the mask for the mode bits for port bits 0..31
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32H7_GPIO_PUPD_P(3),
///		MCCI_STM32H7_GPIO_PUPD_PULLDOWN
///		)`
///
#define	MCCI_STM32H7_GPIO_PUPD_P(p)	(UINT32_C(3) << (2 * (p)))
#define	MCCI_STM32H7_GPIO_PUPD_PV(p, v)	((v) << (2 * (p)))

/// \name GPIO_BSRR bits
///	@{
#define MCCI_STM32H7_GPIO_BSRR_BR0	(UINT32_C(1) << 16)		//< reset port bit 0
#define MCCI_STM32H7_GPIO_BSRR_BR	(UINT32_C(0xFFFF) << 16)	//< mask of port-reset bits
#define MCCI_STM32H7_GPIO_BSRR_BS0	(UINT32_C(1) << 0)		//< set port bit 0
#define MCCI_STM32H7_GPIO_BSRR_BS	(UINT32_C(0xFFFF) << 0)		//< mask of port-set bits
/// \brief compute port-bit reset mask for bit \p p.
#define MCCI_STM32H7_GPIO_BSRR_BR_P(p)	(MCCI_STM32H7_GPIO_BSRR_BR0 << (p))
/// \brief compute port-bit set mask for bit \p p.
#define MCCI_STM32H7_GPIO_BSRR_BS_P(p)	(MCCI_STM32H7_GPIO_BSRR_BS0 << (p))
///	@}

/// \name GPIO_LCKR bits
///	@{
#define	MCCI_STM32H7_GPIO_LCKR_RSV17	UINT32_C(0xFFFE0000)	//< reserved, don't change
#define	MCCI_STM32H7_GPIO_LCKR_LCKK	(UINT32_C(1) << 16)	//< lock key bit; if set, ports are locked.
/// \brief compute GPIO lock bit fmask for bit \p p.
#define	MCCI_STM32H7_GPIO_LCKR_LCK_P(p)	(UINT32_C(1) << (p))
#define	MCCI_STM32H7_GPIO_LCKR_LCK	(UINT32_C(0xFFFF) << 0)	//< mask of port-lock bits.
///	@}

/// \name GPIO_AFRx bits
///	@{
/// \brief get reg offset for GPIO_AFRx
#define	MCCI_STM32H7_GPIO_AFRx_P(p)	(MCCI_STM32H7_GPIO_AFRL + (((p) / UINT32_C(8)) * UINT32_C(4)))	//< f
///	@}

/// \brief get AFRx mask for port bit \p p.
///
/// Normal use:
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32H7_GPIO_AFSEL_P(bitnum),
///		0..15
///		)`
///
#define	MCCI_STM32H7_GPIO_AFSEL_P(p)	(UINT32_C(0xF) << (((p) & UINT32_C(0x7)) * UINT32_C(4)))
#define	MCCI_STM32H7_GPIO_AFSEL_PV(p,v)	((v) << (((p) & UINT32_C(0x7)) * UINT32_C(4)))

/****************************************************************************\
|
|	SPI Control Registers
|
\****************************************************************************/

/// \name SPI offsets
///	@{
#define	MCCI_STM32H7_SPI_CR1		UINT32_C(0x00)	///< offset to SPI control register 1
#define MCCI_STM32H7_SPI_CR2		UINT32_C(0x04)	///< offset to SPI control register 2
#define	MCCI_STM32H7_SPI_CFG1		UINT32_C(0x08)	///< offset to SPI configuration register 1
#define MCCI_STM32H7_SPI_CFG2		UINT32_C(0x0C)	///< offset to SPI configuration register 2
#define MCCI_STM32H7_SPI_IER		UINT32_C(0x10)	///< offset to SPI interrupt enable register
#define MCCI_STM32H7_SPI_SR		UINT32_C(0x14)	///< offset to SPI status register
#define MCCI_STM32H7_SPI_IFCR		UINT32_C(0x18)	///< offset to SPI interrupt/status flags clear register
#define MCCI_STM32H7_SPI_TXDR		UINT32_C(0x20)	///< offset to SPI transmit data register
#define MCCI_STM32H7_SPI_RXDR		UINT32_C(0x30)	///< offset to SPI receive data register
#define MCCI_STM32H7_SPI_CRCPOLY	UINT32_C(0x40)	///< offset to SPI CRC polynomial
#define MCCI_STM32H7_SPI_TXCRC		UINT32_C(0x44)	///< offset to SPI transmit CRC
#define MCCI_STM32H7_SPI_RXCRC		UINT32_C(0x48)	///< offset to SPI receive CRC
#define MCCI_STM32H7_SPI_UDRDR		UINT32_C(0x4C)	///< offset to SPI underrun data CRC
#define MCCI_STM32H7_SPI_I2SCFGR	UINT32_C(0x50)	///< offset to SPI I2S config register
///	@}

/// \name SPI_CR1 bits
///	@{
#define MCCI_STM32H7_SPI_CR1_RSV17	UINT32_C(0xFFFE0000)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CR1_IOLOCK	(UINT32_C(1) << 16)	///< locking the AF configuration of associated IOs
#define MCCI_STM32H7_SPI_CR1_TCRCINI	(UINT32_C(1) << 15)	///< CRC calculation initialization pattern control for transmitter
#define MCCI_STM32H7_SPI_CR1_RCRCINI	(UINT32_C(1) << 14)	///< CRC calculation initialization pattern control for receiver
#define MCCI_STM32H7_SPI_CR1_CRC33_17	(UINT32_C(1) << 13)	///< 32-bit CRC polynomial configuration
#define MCCI_STM32H7_SPI_CR1_SSI	(UINT32_C(1) << 12)	///< internal SS signal input level
#define MCCI_STM32H7_SPI_CR1_HDDIR	(UINT32_C(1) << 11)	///< Rx/Tx direction at Half-duplex mode
#define MCCI_STM32H7_SPI_CR1_CSUSP	(UINT32_C(1) << 10)	///< master suspend request
#define MCCI_STM32H7_SPI_CR1_CSTART	(UINT32_C(1) << 9)	///< master transfer start
#define MCCI_STM32H7_SPI_CR1_MASRX	(UINT32_C(1) << 8)	///< master automatic SUSP in Receive mode
#define MCCI_STM32H7_SPI_CR1_RSV1	(UINT32_C(0x7F) << 1)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CR1_SPE	(UINT32_C(1) << 0)	///< serial peripheral enable
///	@}

/// \name SPI_CR2 bits
///	@{
#define MCCI_STM32H7_SPI_CR2_TSER	UINT32_C(0xFFFF0000)	///< number of data transfer extension to be reload into TSIZE
#define MCCI_STM32H7_SPI_CR2_TSIZE	UINT32_C(0x0000FFFF)	///< number of data at current transfer
///	@}

/// \name SPI_CFG1 bits
///	@{
#define MCCI_STM32H7_SPI_CFG1_RSV31		(UINT32_C(1) << 31)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CFG1_MBR		(UINT32_C(7) << 28)	///< master baud rate
#define MCCI_STM32H7_SPI_CFG1_MBR_2		(UINT32_C(0) << 28)	///< SPI master clock/2
#define MCCI_STM32H7_SPI_CFG1_MBR_4		(UINT32_C(1) << 28)	///< SPI master clock/4
#define MCCI_STM32H7_SPI_CFG1_MBR_8		(UINT32_C(2) << 28)	///< SPI master clock/8
#define MCCI_STM32H7_SPI_CFG1_MBR_16		(UINT32_C(3) << 28)	///< SPI master clock/16
#define MCCI_STM32H7_SPI_CFG1_MBR_32		(UINT32_C(4) << 28)	///< SPI master clock/32
#define MCCI_STM32H7_SPI_CFG1_MBR_64		(UINT32_C(5) << 28)	///< SPI master clock/64
#define MCCI_STM32H7_SPI_CFG1_MBR_128		(UINT32_C(6) << 28)	///< SPI master clock/128
#define MCCI_STM32H7_SPI_CFG1_MBR_256		(UINT32_C(7) << 28)	///< SPI master clock/256
#define MCCI_STM32H7_SPI_CFG1_RSV23		(UINT32_C(0x1F) << 23)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CFG1_CRCEN		(UINT32_C(1) << 22)	///< hardware CRC computation enable
#define MCCI_STM32H7_SPI_CFG1_RSV21		(UINT32_C(1) << 21)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CFG1_CRCSIZE		(UINT32_C(0x1F) << 16)	///< length of CRC frame to be transacted and compared
#define MCCI_STM32H7_SPI_CFG1_CRCSIZE_N(n)	((n) << 16)		///< n+1 bits
#define MCCI_STM32H7_SPI_CFG1_TXDMAEN		(UINT32_C(1) << 15)	///< Tx DMA stream enable
#define MCCI_STM32H7_SPI_CFG1_RXDMAEN		(UINT32_C(1) << 14)	///< Rx DMA stream enable
#define MCCI_STM32H7_SPI_CFG1_RSV13		(UINT32_C(1) << 13)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CFG1_UDRDET		(UINT32_C(3) << 11)	///< detection of underrun condition at slave transmitter
#define MCCI_STM32H7_SPI_CFG1_UDRDET_BEGIN	(UINT32_C(0) << 11)	///< underrun is detected at begin of data frame
#define MCCI_STM32H7_SPI_CFG1_UDRDET_END	(UINT32_C(1) << 11)	///< underrun is detected at end of data frame
#define MCCI_STM32H7_SPI_CFG1_UDRDET_BEGIN_SS	(UINT32_C(2) << 11)	///< underrun is detected at begin of active SS signal
#define MCCI_STM32H7_SPI_CFG1_UDRCFG		(UINT32_C(3) << 9)	///< behavior of slave transmitter at underrun condition
#define MCCI_STM32H7_SPI_CFG1_UDRCFG_CONST	(UINT32_C(0) << 9)	///< slave sends a constant pattern defined by the user at SPI_UDRDR register
#define MCCI_STM32H7_SPI_CFG1_UDRCFG_RX		(UINT32_C(1) << 9)	///< slave repeats lastly received data frame from master
#define MCCI_STM32H7_SPI_CFG1_UDRCFG_TX		(UINT32_C(2) << 9)	///< slave repeats its lastly transmitted data frame
#define MCCI_STM32H7_SPI_CFG1_FTHLV		(UINT32_C(0xF) << 5)	///< FIFO threshold level
#define MCCI_STM32H7_SPI_CFG1_FTHLV_N(n)	((n) << 5)		///< n+1 data
#define MCCI_STM32H7_SPI_CFG1_DSIZE		(UINT32_C(0x1F) << 0)	///< number of bits in at single SPI data frame
#define MCCI_STM32H7_SPI_CFG1_DSIZE_N(n)	((n) << 0)		///< n+1 bits
///	@}

/// \name SPI_CFG2 bits
///	@{
#define MCCI_STM32H7_SPI_CFG2_AFCNTR		(UINT32_C(1) << 31)	///< alternate function GPIOs control
#define MCCI_STM32H7_SPI_CFG2_SSOM		(UINT32_C(1) << 30)	///< SS output management in master mode
#define MCCI_STM32H7_SPI_CFG2_SSOE		(UINT32_C(1) << 29)	///< SS output enable
#define MCCI_STM32H7_SPI_CFG2_SSIOP		(UINT32_C(1) << 28)	///< SS input/output polarity
#define MCCI_STM32H7_SPI_CFG2_RSV27		(UINT32_C(1) << 27)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CFG2_SSM		(UINT32_C(1) << 26)	///< software management of SS signal input
#define MCCI_STM32H7_SPI_CFG2_CPOL		(UINT32_C(1) << 25)	///< clock polarity
#define MCCI_STM32H7_SPI_CFG2_CPHA		(UINT32_C(1) << 24)	///< clock phase
#define MCCI_STM32H7_SPI_CFG2_LSBFRST		(UINT32_C(1) << 23)	///< data frame format
#define MCCI_STM32H7_SPI_CFG2_MASTER		(UINT32_C(1) << 22)	///< SPI master
#define MCCI_STM32H7_SPI_CFG2_SP		(UINT32_C(7) << 19)	///< Serial protocol
#define MCCI_STM32H7_SPI_CFG2_COMM		(UINT32_C(3) << 17)	///< SPI communication mode
#define MCCI_STM32H7_SPI_CFG2_COMM_FULL_DUPLEX	(UINT32_C(0) << 17)	///< full-duplex
#define MCCI_STM32H7_SPI_CFG2_COMM_SIMPLEX_TX	(UINT32_C(1) << 17)	///< simplex transmitter
#define MCCI_STM32H7_SPI_CFG2_COMM_SIMPLEX_RX	(UINT32_C(2) << 17)	///< simplex receiver
#define MCCI_STM32H7_SPI_CFG2_COMM_HALF_DUPLEX	(UINT32_C(3) << 17)	///< half-duplex
#define MCCI_STM32H7_SPI_CFG2_RSV16		(UINT32_C(1) << 16)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CFG2_IOSWP		(UINT32_C(1) << 15)	///< swap functionality of MISO and MOSI pins
#define MCCI_STM32H7_SPI_CFG2_RSV8		(UINT32_C(0x7F) << 8)	///< reserved, don't change
#define MCCI_STM32H7_SPI_CFG2_MIDI		(UINT32_C(15) << 4)	///< master Inter-Data Idleness
#define MCCI_STM32H7_SPI_CFG2_MIDI_N(n)		((n) << 4)		///< n clock cycle period delay
#define MCCI_STM32H7_SPI_CFG2_MSSI		(UINT32_C(15) << 0)	///< master SS idleness
#define MCCI_STM32H7_SPI_CFG2_MSSI_N(n)		((n) << 0)		///< n clock cycle period delay added
///	@}

/// \name SPI_IER bits
///	@{
#define MCCI_STM32H7_SPI_IER_RSV11		UINT32_C(0xFFFFFF80)	///< reserved, don't change
#define MCCI_STM32H7_SPI_IER_TSERFIE		(UINT32_C(1) << 10)	///< additional number of transactions reload interrupt enable
#define MCCI_STM32H7_SPI_IER_MODFIE		(UINT32_C(1) << 9)	///< mode fault interrupt enable
#define MCCI_STM32H7_SPI_IER_TIFREIE		(UINT32_C(1) << 8)	///< TIFRE interrupt enable
#define MCCI_STM32H7_SPI_IER_CRCEIE		(UINT32_C(1) << 7)	///< CRC error interrupt enable
#define MCCI_STM32H7_SPI_IER_OVRIE		(UINT32_C(1) << 6)	///< OVR interrupt enable
#define MCCI_STM32H7_SPI_IER_UDRIE		(UINT32_C(1) << 5)	///< UDR interrupt enable
#define MCCI_STM32H7_SPI_IER_TXTFIE		(UINT32_C(1) << 4)	///< TXTFIE interrupt enable
#define MCCI_STM32H7_SPI_IER_EOTIE		(UINT32_C(1) << 3)	///< EOT, SUSP and TXC interrupt enable
#define MCCI_STM32H7_SPI_IER_DXPIE		(UINT32_C(1) << 2)	///< DXP interrupt enabled
#define MCCI_STM32H7_SPI_IER_TXPIE		(UINT32_C(1) << 1)	///< TXP interrupt enable
#define MCCI_STM32H7_SPI_IER_RXPIE		(UINT32_C(1) << 0)	///< RXP Interrupt Enable
///	@}

/// \name SPI_SR bits
///	@{
#define MCCI_STM32H7_SPI_SR_CTSIZE	UINT32_C(0xFFFF0000)	///< number of data frames remaining in current TSIZE session
#define MCCI_STM32H7_SPI_SR_RXWNE	(UINT32_C(1) << 15)	///< RxFIFO word not empty
#define MCCI_STM32H7_SPI_SR_RXPLVL	(UINT32_C(3) << 13)	///< RxFIFO packing leveL
#define MCCI_STM32H7_SPI_SR_RXPLVL_N(n)	((n) << 13)		///< n frame is available
#define MCCI_STM32H7_SPI_SR_TXC		(UINT32_C(1) << 12)	///< TxFIFO transmission complete
#define MCCI_STM32H7_SPI_SR_SUSP	(UINT32_C(1) << 11)	///< suspension status
#define MCCI_STM32H7_SPI_SR_TSERF	(UINT32_C(1) << 10)	///< additional number of SPI data to be transacted was reload
#define MCCI_STM32H7_SPI_SR_MODF	(UINT32_C(1) << 9)	///< mode fault
#define MCCI_STM32H7_SPI_SR_TIFRE	(UINT32_C(1) << 8)	///< TI frame format error
#define MCCI_STM32H7_SPI_SR_CRCE	(UINT32_C(1) << 7)	///< CRC error
#define MCCI_STM32H7_SPI_SR_OVR		(UINT32_C(1) << 6)	///< overrun
#define MCCI_STM32H7_SPI_SR_UDR		(UINT32_C(1) << 5)	///< underrun at slave transmission mode
#define MCCI_STM32H7_SPI_SR_TXTF	(UINT32_C(1) << 4)	///< transmission transfer filled
#define MCCI_STM32H7_SPI_SR_EOT		(UINT32_C(1) << 3)	///< end of transfer
#define MCCI_STM32H7_SPI_SR_DXP		(UINT32_C(1) << 2)	///< duplex packet
#define MCCI_STM32H7_SPI_SR_TXP		(UINT32_C(1) << 1)	///< Tx-packet space available
#define MCCI_STM32H7_SPI_SR_RXP		(UINT32_C(1) << 0)	///< Rx-packet available
///	@}

