mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name SPI_IFCR bits
///	@{
#define MCCI_STM32H7_SPI_IFCR_RSV12		UINT32_C(0xFFFFFF00)	///< reserved, don't change
#define MCCI_STM32H7_SPI_IFCR_SUSPC		(UINT32_C(1) << 11)	///< SUSPend flag clear
#define MCCI_STM32H7_SPI_IFCR_TSERFC		(UINT32_C(1) << 10)	///< additional number of transactions reload flag clear
#define MCCI_STM32H7_SPI_IFCR_MODFC		(UINT32_C(1) << 9)	///< mode fault flag clear
#define MCCI_STM32H7_SPI_IFCR_TIFREC		(UINT32_C(1) << 8)	///< TIFRE flag clear
#define MCCI_STM32H7_SPI_IFCR_CRCEC		(UINT32_C(1) << 7)	///< CRC error flag clear
#define MCCI_STM32H7_SPI_IFCR_OVRC		(UINT32_C(1) << 6)	///< OVR flag clear
#define MCCI_STM32H7_SPI_IFCR_UDRC		(UINT32_C(1) << 5)	///< UDR flag clear
#define MCCI_STM32H7_SPI_IFCR_TXTFC		(UINT32_C(1) << 4)	///< TXTFC flag clear
#define MCCI_STM32H7_SPI_IFCR_EOTC		(UINT32_C(1) << 3)	///< EOT, SUSP and TXC flag clear
#define MCCI_STM32H7_SPI_IFCR_RSV0		(UINT32_C(7) << 0)	///< reserved, don't change
///	@}

/// \name SPI_I2SCFGR bits
///	@{
#define MCCI_STM32H7_SPI_I2SCFGR_RSV26		(UINT32_C(0x3F) << 26)	///< reserved (do not change)
#define MCCI_STM32H7_SPI_I2SCFGR_MCKOE		(UINT32_C(1) << 25)	///< master clock output enable
#define MCCI_STM32H7_SPI_I2SCFGR_ODD		(UINT32_C(1) << 24)	///< odd factor for the prescaler
#define MCCI_STM32H7_SPI_I2SCFGR_I2SDIV		(UINT32_C(0xFF) << 16)	///< I2S linear prescaler
#define MCCI_STM32H7_SPI_I2SCFGR_I2SDIV_N(n)	((n) << 16)		///<
#define MCCI_STM32H7_SPI_I2SCFGR_RSV15		(UINT32_C(1) << 15)	///< reserved (do not change)
#define MCCI_STM32H7_SPI_I2SCFGR_DATFMT		(UINT32_C(1) << 14)	///< data format
#define MCCI_STM32H7_SPI_I2SCFGR_WSINV		(UINT32_C(1) << 13)	///< Word select inversion
#define MCCI_STM32H7_SPI_I2SCFGR_FIXCH		(UINT32_C(1) << 12)	///< fixed channel length in slave
#define MCCI_STM32H7_SPI_I2SCFGR_CKPOL		(UINT32_C(1) << 11)	///< serial audio clock polarity
#define MCCI_STM32H7_SPI_I2SCFGR_CHLEN		(UINT32_C(1) << 10)	///< channel length
#define MCCI_STM32H7_SPI_I2SCFGR_DATLEN		(UINT32_C(3) << 8)	///< data length to be transferred
#define MCCI_STM32H7_SPI_I2SCFGR_DATLEN_16	(UINT32_C(0) << 8)	///< 16 bit
#define MCCI_STM32H7_SPI_I2SCFGR_DATLEN_24	(UINT32_C(1) << 8)	///< 24 bit
#define MCCI_STM32H7_SPI_I2SCFGR_DATLEN_32	(UINT32_C(2) << 8)	///< 32 bit
#define MCCI_STM32H7_SPI_I2SCFGR_PCMSYNC	(UINT32_C(1) << 7)	///< PCM frame synchronization
#define MCCI_STM32H7_SPI_I2SCFGR_RSV6		(UINT32_C(1) << 6)	///< reserved (do not change)
#define MCCI_STM32H7_SPI_I2SCFGR_I2SSTD		(UINT32_C(3) << 4)	///< I2S standard selection
#define MCCI_STM32H7_SPI_I2SCFGR_I2SSTD_PHILIPS	(UINT32_C(0) << 4)	///< I2S Philips standard
#define MCCI_STM32H7_SPI_I2SCFGR_I2SSTD_MSB	(UINT32_C(1) << 4)	///< MSB justified standard
#define MCCI_STM32H7_SPI_I2SCFGR_I2SSTD_LSB	(UINT32_C(2) << 4)	///< LSB justified standard
#define MCCI_STM32H7_SPI_I2SCFGR_I2SSTD_PCM	(UINT32_C(3) << 4)	///< PCM standard
#define MCCI_STM32H7_SPI_I2SCFGR_I2SCFG		(UINT32_C(7) << 1)	///< I2S configuration mode
#define MCCI_STM32H7_SPI_I2SCFGR_I2SCFG_STX	(UINT32_C(0) << 1)	///< slave - transmit
#define MCCI_STM32H7_SPI_I2SCFGR_I2SCFG_SRX	(UINT32_C(1) << 1)	///< slave - receive
#define MCCI_STM32H7_SPI_I2SCFGR_I2SCFG_MTX	(UINT32_C(2) << 1)	///< master - transmit
#define MCCI_STM32H7_SPI_I2SCFGR_I2SCFG_MRX	(UINT32_C(3) << 1)	///< master - receive
#define MCCI_STM32H7_SPI_I2SCFGR_I2SCFG_SFD	(UINT32_C(4) << 1)	///< slave - full duplex
#define MCCI_STM32H7_SPI_I2SCFGR_I2SCFG_MFD	(UINT32_C(5) << 1)	///< master - full duplex
#define MCCI_STM32H7_SPI_I2SCFGR_I2SMOD		(UINT32_C(1) << 0)	///< I2S mode selection
///	@}


/****************************************************************************\
|
|	DMA Control Registers
|
\****************************************************************************/

/// \name DMA offsets
///	@{
#define	MCCI_STM32H7_DMA_LISR		UINT32_C(0x00)	///< offset to DMA low interrupt status register
#define MCCI_STM32H7_DMA_HISR		UINT32_C(0x04)	///< offset to DMA high interrupt status register
#define	MCCI_STM32H7_DMA_LIFCR		UINT32_C(0x08)	///< offset to DMA low interrupt flag clear register
#define MCCI_STM32H7_DMA_HIFCR		UINT32_C(0x0C)	///< offset to DMA high interrupt flag clear register

#define MCCI_STM32H7_DMA_SCR		UINT32_C(0x00)	///< offset to DMA stream configuration register
#define MCCI_STM32H7_DMA_SNDTR		UINT32_C(0x04)	///< offset to DMA stream number of data register
#define MCCI_STM32H7_DMA_SPAR		UINT32_C(0x08)	///< offset to DMA stream peripheral address register
#define MCCI_STM32H7_DMA_SM0AR		UINT32_C(0x0C)	///< offset to DMA stream memory 0 address register
#define MCCI_STM32H7_DMA_SM1AR		UINT32_C(0x10)	///< offset to DMA stream memory 1 address register
#define MCCI_STM32H7_DMA_SFCR		UINT32_C(0x14)	///< offset to DMA stream FIFO control register

#define MCCI_STM32H7_DMA_STREAM_BASE(x)	(((x) * UINT32_C(0x18)) + UINT32_C(0x10))	///< offset to DMA stream x base
#define MCCI_STM32H7_DMA_SxCR(x)	(((x) * UINT32_C(0x18)) + UINT32_C(0x10))	///< offset to DMA stream x configuration register
#define MCCI_STM32H7_DMA_SxNDTR(x)	(((x) * UINT32_C(0x18)) + UINT32_C(0x14))	///< offset to DMA stream x number of data register
#define MCCI_STM32H7_DMA_SxPAR(x)	(((x) * UINT32_C(0x18)) + UINT32_C(0x18))	///< offset to DMA stream x peripheral address register
#define MCCI_STM32H7_DMA_SxM0AR(x)	(((x) * UINT32_C(0x18)) + UINT32_C(0x1C))	///< offset to DMA stream x memory 0 address register
#define MCCI_STM32H7_DMA_SxM1AR(x)	(((x) * UINT32_C(0x18)) + UINT32_C(0x20))	///< offset to DMA stream x memory 1 address register
#define MCCI_STM32H7_DMA_SxFCR(x)	(((x) * UINT32_C(0x18)) + UINT32_C(0x24))	///< offset to DMA stream x FIFO control register
///	@}

/// \name DMA stream base address
///	@{
#define	MCCI_STM32H7_DMA1_STREAM_BASE(x)	\
	(MCCI_STM32H7_REG_DMA1 + MCCI_STM32H7_DMA_STREAM_BASE(x))
#define	MCCI_STM32H7_DMA2_STREAM_BASE(x)	\
	(MCCI_STM32H7_REG_DMA2 + MCCI_STM32H7_DMA_STREAM_BASE(x))

#define	MCCI_STM32H7_DMA_GET_STREAM(b)	((((b) & UINT32_C(0xFF)) - UINT32_C(0x10)) / UINT32_C(0x18))
///	@}

/// \name DMA_LISR and DMA_FISR bits
///	@{
#define MCCI_STM32H7_DMA_ISR_RSV28	UINT32_C(0xF0000000)	///< reserved, don't change
#define MCCI_STM32H7_DMA_ISR_TCIF3	(UINT32_C(1) << 27)	///< transfer complete interrupt flag
#define MCCI_STM32H7_DMA_ISR_HTIF3	(UINT32_C(1) << 26)	///< half transfer interrupt flag
#define MCCI_STM32H7_DMA_ISR_TEIF3	(UINT32_C(1) << 25)	///< transfer error interrupt flag
#define MCCI_STM32H7_DMA_ISR_DMEIF3	(UINT32_C(1) << 24)	///< direct mode error interrupt flag
#define MCCI_STM32H7_DMA_ISR_RSV23	(UINT32_C(1) << 23)	///< reserved, don't change
#define MCCI_STM32H7_DMA_ISR_FEIF3	(UINT32_C(1) << 22)	///< FIFO error interrupt flag
#define MCCI_STM32H7_DMA_ISR_TCIF2	(UINT32_C(1) << 21)	///< transfer complete interrupt flag
#define MCCI_STM32H7_DMA_ISR_HTIF2	(UINT32_C(1) << 20)	///< half transfer interrupt flag
#define MCCI_STM32H7_DMA_ISR_TEIF2	(UINT32_C(1) << 19)	///< transfer error interrupt flag
#define MCCI_STM32H7_DMA_ISR_DMEIF2	(UINT32_C(1) << 18)	///< direct mode error interrupt flag
#define MCCI_STM32H7_DMA_ISR_RSV17	(UINT32_C(1) << 17)	///< reserved, don't change
#define MCCI_STM32H7_DMA_ISR_FEIF2	(UINT32_C(1) << 16)	///< FIFO error interrupt flag
#define MCCI_STM32H7_DMA_ISR_RSV12	UINT32_C(0x0000F000)	///< reserved, don't change
#define MCCI_STM32H7_DMA_ISR_TCIF1	(UINT32_C(1) << 11)	///< transfer complete interrupt flag
#define MCCI_STM32H7_DMA_ISR_HTIF1	(UINT32_C(1) << 10)	///< half transfer interrupt flag
#define MCCI_STM32H7_DMA_ISR_TEIF1	(UINT32_C(1) << 9)	///< transfer error interrupt flag
#define MCCI_STM32H7_DMA_ISR_DMEIF1	(UINT32_C(1) << 8)	///< direct mode error interrupt flag
#define MCCI_STM32H7_DMA_ISR_RSV7	(UINT32_C(1) << 7)	///< reserved, don't change
#define MCCI_STM32H7_DMA_ISR_FEIF1	(UINT32_C(1) << 6)	///< FIFO error interrupt flag
#define MCCI_STM32H7_DMA_ISR_TCIF0	(UINT32_C(1) << 5)	///< transfer complete interrupt flag
#define MCCI_STM32H7_DMA_ISR_HTIF0	(UINT32_C(1) << 4)	///< half transfer interrupt flag
#define MCCI_STM32H7_DMA_ISR_TEIF0	(UINT32_C(1) << 3)	///< transfer error interrupt flag
#define MCCI_STM32H7_DMA_ISR_DMEIF0	(UINT32_C(1) << 2)	///< direct mode error interrupt flag
#define MCCI_STM32H7_DMA_ISR_RSV1	(UINT32_C(1) << 1)	///< reserved, don't change
#define MCCI_STM32H7_DMA_ISR_FEIF0	(UINT32_C(1) << 0)	///< FIFO error interrupt flag

