mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
#define MCCI_STM32H7_DMA_ISR_TCIF	(UINT32_C(1) << 5)	///< transfer complete interrupt flag
#define MCCI_STM32H7_DMA_ISR_HTIF	(UINT32_C(1) << 4)	///< half transfer interrupt flag
#define MCCI_STM32H7_DMA_ISR_TEIF	(UINT32_C(1) << 3)	///< transfer error interrupt flag
#define MCCI_STM32H7_DMA_ISR_DMEIF	(UINT32_C(1) << 2)	///< direct mode error interrupt flag
#define MCCI_STM32H7_DMA_ISR_FEIF	(UINT32_C(1) << 0)	///< FIFO error interrupt flag
#define MCCI_STM32H7_DMA_ISR_MASK	UINT32_C(0x3D)		///< ISR stream mask
///	@}

/// \name DMA_SCR bits
///	@{
#define MCCI_STM32H7_DMA_SCR_RSV25	UINT32_C(0xFE000000)	///< reserved, don't change
#define MCCI_STM32H7_DMA_SCR_MBURST	(UINT32_C(3) << 23)	///< memory burst transfer configuration
#define MCCI_STM32H7_DMA_SCR_MBURST_SINGLE	(UINT32_C(0) << 23)	///< single transfer
#define MCCI_STM32H7_DMA_SCR_MBURST_INCR4	(UINT32_C(1) << 23)	///< INCR4 (incremental burst of 4 beats)
#define MCCI_STM32H7_DMA_SCR_MBURST_INCR8	(UINT32_C(2) << 23)	///< INCR8 (incremental burst of 8 beats)
#define MCCI_STM32H7_DMA_SCR_MBURST_INCR16	(UINT32_C(3) << 23)	///< INCR16 (incremental burst of 16 beats)
#define MCCI_STM32H7_DMA_SCR_PBURST	(UINT32_C(3) << 21)	///< peripheral burst transfer configuration
#define MCCI_STM32H7_DMA_SCR_PBURST_SINGLE	(UINT32_C(0) << 21)	///< single transfer
#define MCCI_STM32H7_DMA_SCR_PBURST_INCR4	(UINT32_C(1) << 21)	///< INCR4 (incremental burst of 4 beats)
#define MCCI_STM32H7_DMA_SCR_PBURST_INCR8	(UINT32_C(2) << 21)	///< INCR8 (incremental burst of 8 beats)
#define MCCI_STM32H7_DMA_SCR_PBURST_INCR16	(UINT32_C(3) << 21)	///< INCR16 (incremental burst of 16 beats)
#define MCCI_STM32H7_DMA_SCR_TRBUFF	(UINT32_C(1) << 20)	///< Enable the DMA to handle bufferable transfers
#define MCCI_STM32H7_DMA_SCR_CT		(UINT32_C(1) << 19)	///< current target (only in double-buffer mode)
#define MCCI_STM32H7_DMA_SCR_DBM	(UINT32_C(1) << 18)	///< double-buffer mode
#define MCCI_STM32H7_DMA_SCR_PL		(UINT32_C(3) << 16)	///< priority level
#define MCCI_STM32H7_DMA_SCR_PL_LOW	(UINT32_C(0) << 16)	///< low
#define MCCI_STM32H7_DMA_SCR_PL_MEDIUM	(UINT32_C(0) << 16)	///< medium
#define MCCI_STM32H7_DMA_SCR_PL_HIGH	(UINT32_C(0) << 16)	///< high
#define MCCI_STM32H7_DMA_SCR_PL_VERY_HIGH	(UINT32_C(0) << 16)	///< very high
#define MCCI_STM32H7_DMA_SCR_PINCOS	(UINT32_C(1) << 15)	///< peripheral increment offset size
#define MCCI_STM32H7_DMA_SCR_MSIZE	(UINT32_C(3) << 13)	///< memory data size
#define MCCI_STM32H7_DMA_SCR_MSIZE_BYTE	(UINT32_C(0) << 13)	///< byte (8-bit)
#define MCCI_STM32H7_DMA_SCR_MSIZE_HALF	(UINT32_C(1) << 13)	///< hlaf-word (16-bit)
#define MCCI_STM32H7_DMA_SCR_MSIZE_WORD	(UINT32_C(2) << 13)	///< word (32-bit)
#define MCCI_STM32H7_DMA_SCR_PSIZE	(UINT32_C(3) << 11)	///< peripheral data size
#define MCCI_STM32H7_DMA_SCR_PSIZE_BYTE	(UINT32_C(0) << 11)	///< byte (8-bit)
#define MCCI_STM32H7_DMA_SCR_PSIZE_HALF	(UINT32_C(1) << 11)	///< hlaf-word (16-bit)
#define MCCI_STM32H7_DMA_SCR_PSIZE_WORD	(UINT32_C(2) << 11)	///< word (32-bit)
#define MCCI_STM32H7_DMA_SCR_MINC	(UINT32_C(1) << 10)	///< memory increment mode
#define MCCI_STM32H7_DMA_SCR_PINC	(UINT32_C(1) << 9)	///< peripheral increment mode
#define MCCI_STM32H7_DMA_SCR_CIRC	(UINT32_C(1) << 8)	///< circular mode
#define MCCI_STM32H7_DMA_SCR_DIR	(UINT32_C(3) << 6)	///< data transfer direction
#define MCCI_STM32H7_DMA_SCR_DIR_PERI_TO_MEM	(UINT32_C(0) << 6)	///< peripheral-to-memory
#define MCCI_STM32H7_DMA_SCR_DIR_MEM_TO_PERI	(UINT32_C(1) << 6)	///< memory-to-peripheral
#define MCCI_STM32H7_DMA_SCR_DIR_MEM_TO_MEM	(UINT32_C(2) << 6)	///< memory-to-memory
#define MCCI_STM32H7_DMA_SCR_PFCTRL	(UINT32_C(1) << 5)	///< peripheral flow controller
#define MCCI_STM32H7_DMA_SCR_TCIE	(UINT32_C(1) << 4)	///< transfer complete interrupt enable
#define MCCI_STM32H7_DMA_SCR_HTIE	(UINT32_C(1) << 3)	///< half transfer interrupt enable
#define MCCI_STM32H7_DMA_SCR_TEIE	(UINT32_C(1) << 2)	///< transfer error interrupt enable
#define MCCI_STM32H7_DMA_SCR_DMEIE	(UINT32_C(1) << 1)	///< direct mode error interrupt enable
#define MCCI_STM32H7_DMA_SCR_EN		(UINT32_C(1) << 0)	///< stream enable / flag stream ready when read low
///	@}

/// \name DMA_SFCR bits
///	@{
#define MCCI_STM32H7_DMA_SFCR_RSV8	UINT32_C(0xFFFFFF00)	///< reserved, don't change
#define MCCI_STM32H7_DMA_SFCR_FEIE	(UINT32_C(1) << 7)	///< FIFO error interrupt enable
#define MCCI_STM32H7_DMA_SFCR_RSV6	(UINT32_C(1) << 6)	///< reserved, don't change
#define MCCI_STM32H7_DMA_SFCR_FS	(UINT32_C(7) << 3)	///< FIFO status
#define MCCI_STM32H7_DMA_SFCR_FS_LESS_1P4	(UINT32_C(0) << 3)	///< 0 < fifo_level < 1/4
#define MCCI_STM32H7_DMA_SFCR_FS_LESS_1P2	(UINT32_C(1) << 3)	///< 1/4 <= fifo_level < 1/2
#define MCCI_STM32H7_DMA_SFCR_FS_LESS_3P4	(UINT32_C(2) << 3)	///< 1/2 <= fifo_level < 3/4
#define MCCI_STM32H7_DMA_SFCR_FS_LESS_FULL	(UINT32_C(3) << 3)	///< 3/4 <= fifo_level < full
#define MCCI_STM32H7_DMA_SFCR_FS_EMPTY	(UINT32_C(4) << 3)	///< FIFO is empty
#define MCCI_STM32H7_DMA_SFCR_FS_FULL	(UINT32_C(5) << 3)	///< FIFO is full
#define MCCI_STM32H7_DMA_SFCR_DMDIS	(UINT32_C(1) << 2)	///< direct mode disable
#define MCCI_STM32H7_DMA_SFCR_FTH	(UINT32_C(3) << 0)	///< FIFO threshold selection
#define MCCI_STM32H7_DMA_SFCR_FTH_1P4_FULL	(UINT32_C(0) << 0)	///< 1/4 full FIFO
#define MCCI_STM32H7_DMA_SFCR_FTH_1P2_FULL	(UINT32_C(1) << 0)	///< 1/4 full FIFO
#define MCCI_STM32H7_DMA_SFCR_FTH_3P4_FULL	(UINT32_C(2) << 0)	///< 1/4 full FIFO
#define MCCI_STM32H7_DMA_SFCR_FTH_FULL	(UINT32_C(3) << 0)	///< 1/4 full FIFO
///	@}


/****************************************************************************\
|
|	DMAMUX Control Registers
|
\****************************************************************************/

/// \name DMAMUX offsets
///	@{
#define	MCCI_STM32H7_DMAMUX1_C0CR	UINT32_C(0x00)	///< offset to DMAMUX1 request line multiplexer channel 0 configuration register
#define MCCI_STM32H7_DMAMUX1_C1CR	UINT32_C(0x04)	///< offset to DMAMUX1 request line multiplexer channel 1 configuration register
#define	MCCI_STM32H7_DMAMUX1_C2CR	UINT32_C(0x08)	///< offset to DMAMUX1 request line multiplexer channel 2 configuration register
#define MCCI_STM32H7_DMAMUX1_C3CR	UINT32_C(0x0C)	///< offset to DMAMUX1 request line multiplexer channel 3 configuration register
#define	MCCI_STM32H7_DMAMUX1_C4CR	UINT32_C(0x10)	///< offset to DMAMUX1 request line multiplexer channel 4 configuration register
#define MCCI_STM32H7_DMAMUX1_C5CR	UINT32_C(0x14)	///< offset to DMAMUX1 request line multiplexer channel 5 configuration register
#define	MCCI_STM32H7_DMAMUX1_C6CR	UINT32_C(0x18)	///< offset to DMAMUX1 request line multiplexer channel 6 configuration register
#define MCCI_STM32H7_DMAMUX1_C7CR	UINT32_C(0x1C)	///< offset to DMAMUX1 request line multiplexer channel 7 configuration register
#define	MCCI_STM32H7_DMAMUX1_C8CR	UINT32_C(0x20)	///< offset to DMAMUX1 request line multiplexer channel 8 configuration register
#define MCCI_STM32H7_DMAMUX1_C9CR	UINT32_C(0x24)	///< offset to DMAMUX1 request line multiplexer channel 9 configuration register
#define	MCCI_STM32H7_DMAMUX1_C10CR	UINT32_C(0x28)	///< offset to DMAMUX1 request line multiplexer channel 10 configuration register
#define MCCI_STM32H7_DMAMUX1_C11CR	UINT32_C(0x2C)	///< offset to DMAMUX1 request line multiplexer channel 11 configuration register
#define	MCCI_STM32H7_DMAMUX1_C12CR	UINT32_C(0x30)	///< offset to DMAMUX1 request line multiplexer channel 12 configuration register
#define MCCI_STM32H7_DMAMUX1_C13CR	UINT32_C(0x34)	///< offset to DMAMUX1 request line multiplexer channel 13 configuration register
#define	MCCI_STM32H7_DMAMUX1_C14CR	UINT32_C(0x38)	///< offset to DMAMUX1 request line multiplexer channel 14 configuration register
#define MCCI_STM32H7_DMAMUX1_C15CR	UINT32_C(0x3C)	///< offset to DMAMUX1 request line multiplexer channel 15 configuration register
#define	MCCI_STM32H7_DMAMUX1_CCR(x)	((x) * UINT32_C(0x04))	///< offset to DMAMUX1 request line multiplexer channel x configuration register

#define	MCCI_STM32H7_DMAMUX2_C0CR	UINT32_C(0x00)	///< offset to DMAMUX2 request line multiplexer channel 0 configuration register
#define MCCI_STM32H7_DMAMUX2_C1CR	UINT32_C(0x04)	///< offset to DMAMUX2 request line multiplexer channel 1 configuration register
#define	MCCI_STM32H7_DMAMUX2_C2CR	UINT32_C(0x08)	///< offset to DMAMUX2 request line multiplexer channel 2 configuration register
#define MCCI_STM32H7_DMAMUX2_C3CR	UINT32_C(0x0C)	///< offset to DMAMUX2 request line multiplexer channel 3 configuration register
#define	MCCI_STM32H7_DMAMUX2_C4CR	UINT32_C(0x10)	///< offset to DMAMUX2 request line multiplexer channel 4 configuration register
#define MCCI_STM32H7_DMAMUX2_C5CR	UINT32_C(0x14)	///< offset to DMAMUX2 request line multiplexer channel 5 configuration register
#define	MCCI_STM32H7_DMAMUX2_C6CR	UINT32_C(0x18)	///< offset to DMAMUX2 request line multiplexer channel 6 configuration register
#define MCCI_STM32H7_DMAMUX2_C7CR	UINT32_C(0x1C)	///< offset to DMAMUX2 request line multiplexer channel 7 configuration register
#define	MCCI_STM32H7_DMAMUX2_CCR(x)	((x) * UINT32_C(0x04))	///< offset to DMAMUX2 request line multiplexer channel x configuration register

#define	MCCI_STM32H7_DMAMUX1_CSR	UINT32_C(0x80)	///< offset to DMAMUX1 request line multiplexer interrupt channel status register
#define	MCCI_STM32H7_DMAMUX2_CSR	UINT32_C(0x80)	///< offset to DMAMUX2 request line multiplexer interrupt channel status register
#define	MCCI_STM32H7_DMAMUX1_CFR	UINT32_C(0x84)	///< offset to DMAMUX1 request line multiplexer interrupt clear flag register
#define	MCCI_STM32H7_DMAMUX2_CFR	UINT32_C(0x84)	///< offset to DMAMUX2 request line multiplexer interrupt clear flag register

#define	MCCI_STM32H7_DMAMUX1_RG0CR	UINT32_C(0x100)	///< offset to DMAMUX1 request generator channel 0 configuration register
#define	MCCI_STM32H7_DMAMUX1_RG1CR	UINT32_C(0x104)	///< offset to DMAMUX1 request generator channel 1 configuration register
#define	MCCI_STM32H7_DMAMUX1_RG2CR	UINT32_C(0x108)	///< offset to DMAMUX1 request generator channel 2 configuration register
#define	MCCI_STM32H7_DMAMUX1_RG3CR	UINT32_C(0x10C)	///< offset to DMAMUX1 request generator channel 3 configuration register
#define	MCCI_STM32H7_DMAMUX1_RG4CR	UINT32_C(0x110)	///< offset to DMAMUX1 request generator channel 4 configuration register
#define	MCCI_STM32H7_DMAMUX1_RG5CR	UINT32_C(0x114)	///< offset to DMAMUX1 request generator channel 5 configuration register
#define	MCCI_STM32H7_DMAMUX1_RG6CR	UINT32_C(0x118)	///< offset to DMAMUX1 request generator channel 6 configuration register
#define	MCCI_STM32H7_DMAMUX1_RG7CR	UINT32_C(0x11C)	///< offset to DMAMUX1 request generator channel 7 configuration register
#define	MCCI_STM32H7_DMAMUX1_RGCR(x)	(UINT32_C(0x100) + ((x) * UINT32_C(0x04)))	///< offset to DMAMUX1 request generator channel x configuration register

#define	MCCI_STM32H7_DMAMUX2_RG0CR	UINT32_C(0x100)	///< offset to DMAMUX2 request generator channel 0 configuration register
#define	MCCI_STM32H7_DMAMUX2_RG1CR	UINT32_C(0x104)	///< offset to DMAMUX2 request generator channel 1 configuration register
#define	MCCI_STM32H7_DMAMUX2_RG2CR	UINT32_C(0x108)	///< offset to DMAMUX2 request generator channel 2 configuration register
#define	MCCI_STM32H7_DMAMUX2_RG3CR	UINT32_C(0x10C)	///< offset to DMAMUX2 request generator channel 3 configuration register
#define	MCCI_STM32H7_DMAMUX2_RG4CR	UINT32_C(0x110)	///< offset to DMAMUX2 request generator channel 4 configuration register
#define	MCCI_STM32H7_DMAMUX2_RG5CR	UINT32_C(0x114)	///< offset to DMAMUX2 request generator channel 5 configuration register
#define	MCCI_STM32H7_DMAMUX2_RG6CR	UINT32_C(0x118)	///< offset to DMAMUX2 request generator channel 6 configuration register
#define	MCCI_STM32H7_DMAMUX2_RG7CR	UINT32_C(0x11C)	///< offset to DMAMUX2 request generator channel 7 configuration register
#define	MCCI_STM32H7_DMAMUX2_RGCR(x)	(UINT32_C(0x100) + ((x) * UINT32_C(0x04)))	///< offset to DMAMUX2 request generator channel x configuration register

#define	MCCI_STM32H7_DMAMUX1_RGSR	UINT32_C(0x140)	///< offset to DMAMUX1 request generator interrupt channel status register
#define	MCCI_STM32H7_DMAMUX2_RGSR	UINT32_C(0x140)	///< offset to DMAMUX2 request generator interrupt channel status register
#define	MCCI_STM32H7_DMAMUX1_RGCFR	UINT32_C(0x144)	///< offset to DMAMUX1 request generator interrupt clear flag register
#define	MCCI_STM32H7_DMAMUX2_RGCFR	UINT32_C(0x144)	///< offset to DMAMUX2 request generator interrupt clear flag register
///	@}

/// \name DMAMUX1_CxCR bits
///	@{
#define MCCI_STM32H7_DMAMUX1_CxCR_RSV27	UINT32_C(0xF8000000)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX1_CxCR_SYNC_ID	(UINT32_C(7) << 24)	///< Synchronization identification
#define MCCI_STM32H7_DMAMUX1_CxCR_SYNC_ID_N(n)	((n) << 24)	///<
#define MCCI_STM32H7_DMAMUX1_CxCR_NBREQ	(UINT32_C(0x1F) << 19)	///< Number of DMA requests minus 1 to forward
#define MCCI_STM32H7_DMAMUX1_CxCR_NBREQ_N(n)	((n) << 19)	///<
#define MCCI_STM32H7_DMAMUX1_CxCR_SPOL	(UINT32_C(3) << 17)	///< Synchronization polarity
#define MCCI_STM32H7_DMAMUX1_CxCR_SPOL_NO	(UINT32_C(0) << 17)	///< no event, i.e. no synchronization nor detection
#define MCCI_STM32H7_DMAMUX1_CxCR_SPOL_RISING	(UINT32_C(1) << 17)	///< rising edge
#define MCCI_STM32H7_DMAMUX1_CxCR_SPOL_FALLING	(UINT32_C(2) << 17)	///< falling edge
#define MCCI_STM32H7_DMAMUX1_CxCR_SPOL_BOTH	(UINT32_C(3) << 17)	///< rising and falling edges
#define MCCI_STM32H7_DMAMUX1_CxCR_SE	(UINT32_C(1) << 16)	///< Synchronization enable
#define MCCI_STM32H7_DMAMUX1_CxCR_RSV10	(UINT32_C(0x3F) << 10)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX1_CxCR_EGE	(UINT32_C(1) << 9)	///< Event generation enable
#define MCCI_STM32H7_DMAMUX1_CxCR_SOIE	(UINT32_C(1) << 8)	///< Synchronization overrun interrupt enable
#define MCCI_STM32H7_DMAMUX1_CxCR_RSV7	(UINT32_C(1) << 7)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX1_CxCR_DMAREQ_ID	(UINT32_C(0x7F) << 0)	///< DMA request identification
#define MCCI_STM32H7_DMAMUX1_CxCR_DMAREQ_ID_N(n)	((n) << 0)	///<
///	@}

