mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name DMAMUX2_CxCR bits
///	@{
#define MCCI_STM32H7_DMAMUX2_CxCR_RSV28	UINT32_C(0xF0000000)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX2_CxCR_SYNC_ID	(UINT32_C(0xF) << 24)	///< Synchronization identification
#define MCCI_STM32H7_DMAMUX2_CxCR_SYNC_ID_N(n)	((n) << 24)	///<
#define MCCI_STM32H7_DMAMUX2_CxCR_NBREQ	(UINT32_C(0x1F) << 19)	///< Number of DMA requests minus 1 to forward
#define MCCI_STM32H7_DMAMUX2_CxCR_NBREQ_N(n)	((n) << 19)	///<
#define MCCI_STM32H7_DMAMUX2_CxCR_SPOL	(UINT32_C(3) << 17)	///< Synchronization polarity
#define MCCI_STM32H7_DMAMUX2_CxCR_SPOL_NO	(UINT32_C(0) << 17)	///< no event, i.e. no synchronization nor detection
#define MCCI_STM32H7_DMAMUX2_CxCR_SPOL_RISING	(UINT32_C(1) << 17)	///< rising edge
#define MCCI_STM32H7_DMAMUX2_CxCR_SPOL_FALLING	(UINT32_C(2) << 17)	///< falling edge
#define MCCI_STM32H7_DMAMUX2_CxCR_SPOL_BOTH	(UINT32_C(3) << 17)	///< rising and falling edges
#define MCCI_STM32H7_DMAMUX2_CxCR_SE	(UINT32_C(1) << 16)	///< Synchronization enable
#define MCCI_STM32H7_DMAMUX2_CxCR_RSV10	(UINT32_C(0x3F) << 10)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX2_CxCR_EGE	(UINT32_C(1) << 9)	///< Event generation enable
#define MCCI_STM32H7_DMAMUX2_CxCR_SOIE	(UINT32_C(1) << 8)	///< Synchronization overrun interrupt enable
#define MCCI_STM32H7_DMAMUX2_CxCR_RSV7	(UINT32_C(7) << 5)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX2_CxCR_DMAREQ_ID	(UINT32_C(0x1F) << 0)	///< DMA request identification
#define MCCI_STM32H7_DMAMUX2_CxCR_DMAREQ_ID_N(n)	((n) << 0)	///<
///	@}

/// \name DMAMUX1_RGxCR bits
///	@{
#define MCCI_STM32H7_DMAMUX1_RGxCR_RSV24	UINT32_C(0xFF000000)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX1_RGxCR_GNBREQ	(UINT32_C(0x1F) << 19)	///< Number of DMA requests to be generated (minus 1)
#define MCCI_STM32H7_DMAMUX1_RGxCR_GNBREQ_N(n)	((n) << 19)	///<
#define MCCI_STM32H7_DMAMUX1_RGxCR_GPOL	(UINT32_C(3) << 17)	///< DMA request generator trigger polarity
#define MCCI_STM32H7_DMAMUX1_RGxCR_GPOL_NO	(UINT32_C(0) << 17)	///< no event, i.e. no synchronization nor detection
#define MCCI_STM32H7_DMAMUX1_RGxCR_GPOL_RISING	(UINT32_C(1) << 17)	///< rising edge
#define MCCI_STM32H7_DMAMUX1_RGxCR_GPOL_FALLING	(UINT32_C(2) << 17)	///< falling edge
#define MCCI_STM32H7_DMAMUX1_RGxCR_GPOL_BOTH	(UINT32_C(3) << 17)	///< rising and falling edges
#define MCCI_STM32H7_DMAMUX1_RGxCR_GE	(UINT32_C(1) << 16)	///< DMA request generator channel x enable
#define MCCI_STM32H7_DMAMUX1_RGxCR_RSV9	(UINT32_C(0x7F) << 9)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX1_RGxCR_OIE	(UINT32_C(1) << 8)	///< Trigger overrun interrupt enable
#define MCCI_STM32H7_DMAMUX1_RGxCR_RSV3	(UINT32_C(0x1F) << 3)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX1_RGxCR_SIG_ID	(UINT32_C(7) << 0)	///< Signal identification
#define MCCI_STM32H7_DMAMUX1_RGxCR_SIG_ID_N(n)	((n) << 0)	///<
///	@}

/// \name DMAMUX2_RGxCR bits
///	@{
#define MCCI_STM32H7_DMAMUX2_RGxCR_RSV24	UINT32_C(0xFF000000)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX2_RGxCR_GNBREQ	(UINT32_C(0x1F) << 19)	///< Number of DMA requests to be generated (minus 1)
#define MCCI_STM32H7_DMAMUX2_RGxCR_GNBREQ_N(n)	((n) << 19)	///<
#define MCCI_STM32H7_DMAMUX2_RGxCR_GPOL	(UINT32_C(3) << 17)	///< DMA request generator trigger polarity
#define MCCI_STM32H7_DMAMUX2_RGxCR_GPOL_NO	(UINT32_C(0) << 17)	///< no event, i.e. no synchronization nor detection
#define MCCI_STM32H7_DMAMUX2_RGxCR_GPOL_RISING	(UINT32_C(1) << 17)	///< rising edge
#define MCCI_STM32H7_DMAMUX2_RGxCR_GPOL_FALLING	(UINT32_C(2) << 17)	///< falling edge
#define MCCI_STM32H7_DMAMUX2_RGxCR_GPOL_BOTH	(UINT32_C(3) << 17)	///< rising and falling edges
#define MCCI_STM32H7_DMAMUX2_RGxCR_GE	(UINT32_C(1) << 16)	///< DMA request generator channel x enable
#define MCCI_STM32H7_DMAMUX2_RGxCR_RSV9	(UINT32_C(0x7F) << 9)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX2_RGxCR_OIE	(UINT32_C(1) << 8)	///< Trigger overrun interrupt enable
#define MCCI_STM32H7_DMAMUX2_RGxCR_RSV5	(UINT32_C(7) << 5)	///< reserved, don't change
#define MCCI_STM32H7_DMAMUX2_RGxCR_SIG_ID	(UINT32_C(0x1F) << 0)	///< Signal identification
#define MCCI_STM32H7_DMAMUX2_RGxCR_SIG_ID_N(n)	((n) << 0)	///<
///	@}


/****************************************************************************\
|
|	DCMI Control Registers
|
\****************************************************************************/

/// \name DCMI offsets
///	@{
#define	MCCI_STM32H7_DCMI_CR		UINT32_C(0x00)	///< offset to DCMI control register
#define MCCI_STM32H7_DCMI_SR		UINT32_C(0x04)	///< offset to DCMI status register
#define	MCCI_STM32H7_DCMI_RIS		UINT32_C(0x08)	///< offset to DCMI raw interrupt status register
#define MCCI_STM32H7_DCMI_IER		UINT32_C(0x0C)	///< offset to DCMI interrupt enable register
#define MCCI_STM32H7_DCMI_MIS		UINT32_C(0x10)	///< offset to DCMI masked interrupt status register
#define MCCI_STM32H7_DCMI_ICR		UINT32_C(0x14)	///< offset to DCMI interrupt clear register
#define MCCI_STM32H7_DCMI_ESCR		UINT32_C(0x18)	///< offset to DCMI embedded synchronization code register
#define MCCI_STM32H7_DCMI_ESUR		UINT32_C(0x1C)	///< offset to DCMI embedded synchronization unmask register
#define MCCI_STM32H7_DCMI_CWSTRT	UINT32_C(0x20)	///< offset to DCMI crop window start
#define MCCI_STM32H7_DCMI_CWSIZE	UINT32_C(0x24)	///< offset to DCMI crop window size
#define MCCI_STM32H7_DCMI_DR		UINT32_C(0x28)	///< offset to DCMI data register
///	@}

/// \name DCMI_CR bits
///	@{
#define MCCI_STM32H7_DCMI_CR_RSV21	UINT32_C(0xFFE00000)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_CR_OELS	(UINT32_C(1) << 20)	///< Odd/Even Line Select (Line Select Start)
#define MCCI_STM32H7_DCMI_CR_LSM	(UINT32_C(1) << 19)	///< Line Select mode
#define MCCI_STM32H7_DCMI_CR_OEBS	(UINT32_C(1) << 18)	///< Odd/Even Byte Select (Byte Select Start)
#define MCCI_STM32H7_DCMI_CR_BSM	(UINT32_C(3) << 16)	///< Byte Select mode
#define MCCI_STM32H7_DCMI_CR_BSM_N(n)	((n) << 16)		///<
#define MCCI_STM32H7_DCMI_CR_RSV15	(UINT32_C(1) << 15)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_CR_ENABLE	(UINT32_C(1) << 14)	///< DCMI enable
#define MCCI_STM32H7_DCMI_CR_RSV12	(UINT32_C(3) << 12)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_CR_EDM	(UINT32_C(3) << 10)	///< Extended data mode
#define MCCI_STM32H7_DCMI_CR_EDM_N(n)	((n) << 10)		///<
#define MCCI_STM32H7_DCMI_CR_FCRC	(UINT32_C(3) << 8)	///< Frame capture rate control
#define MCCI_STM32H7_DCMI_CR_FCRC_N(n)	((n) << 8)		///<
#define MCCI_STM32H7_DCMI_CR_VSPOL	(UINT32_C(1) << 7)	///< Vertical synchronization polarity
#define MCCI_STM32H7_DCMI_CR_HSPOL	(UINT32_C(1) << 6)	///< Horizontal synchronization polarity
#define MCCI_STM32H7_DCMI_CR_PCKPOL	(UINT32_C(1) << 5)	///< Pixel clock polarity
#define MCCI_STM32H7_DCMI_CR_ESS	(UINT32_C(1) << 4)	///< Embedded synchronization select
#define MCCI_STM32H7_DCMI_CR_JPEG	(UINT32_C(1) << 3)	///< JPEG format
#define MCCI_STM32H7_DCMI_CR_CROP	(UINT32_C(1) << 2)	///< Crop feature
#define MCCI_STM32H7_DCMI_CR_CM		(UINT32_C(1) << 1)	///< Capture mode
#define MCCI_STM32H7_DCMI_CR_CAPTURE	(UINT32_C(1) << 0)	///< Capture enable
///	@}

/// \name DCMI_SR bits
///	@{
#define MCCI_STM32H7_DCMI_SR_RSV3	UINT32_C(0xFFFFFFF8)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_SR_FNE	(UINT32_C(1) << 2)	///< FIFO not empty
#define MCCI_STM32H7_DCMI_SR_VSYNC	(UINT32_C(1) << 1)	///< Vertical synchronization
#define MCCI_STM32H7_DCMI_SR_HSYNC	(UINT32_C(1) << 0)	///< Horizontal synchronization
///	@}

/// \name DCMI_RIS bits
///	@{
#define MCCI_STM32H7_DCMI_RIS_RSV5	UINT32_C(0xFFFFFFE0)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_RIS_LINE	(UINT32_C(1) << 4)	///< Line raw interrupt status
#define MCCI_STM32H7_DCMI_RIS_VSYNC	(UINT32_C(1) << 3)	///< DCMI_VSYNC raw interrupt status
#define MCCI_STM32H7_DCMI_RIS_ERR	(UINT32_C(1) << 2)	///< Synchronization error raw interrupt status
#define MCCI_STM32H7_DCMI_RIS_OVR	(UINT32_C(1) << 1)	///< Overrun raw interrupt status
#define MCCI_STM32H7_DCMI_RIS_FRAME	(UINT32_C(1) << 0)	///< Capture complete raw interrupt status
///	@}

/// \name DCMI_IER bits
///	@{
#define MCCI_STM32H7_DCMI_IER_RSV5	UINT32_C(0xFFFFFFE0)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_IER_LINE	(UINT32_C(1) << 4)	///< Line interrupt enable
#define MCCI_STM32H7_DCMI_IER_VSYNC	(UINT32_C(1) << 3)	///< DCMI_VSYNC interrupt enable
#define MCCI_STM32H7_DCMI_IER_ERR	(UINT32_C(1) << 2)	///< Synchronization interrupt enable
#define MCCI_STM32H7_DCMI_IER_OVR	(UINT32_C(1) << 1)	///< Overrun interrupt enable
#define MCCI_STM32H7_DCMI_IER_FRAME	(UINT32_C(1) << 0)	///< Capture complete interrupt enable
///	@}

/// \name DCMI_MIS bits
///	@{
#define MCCI_STM32H7_DCMI_MIS_RSV5	UINT32_C(0xFFFFFFE0)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_MIS_LINE	(UINT32_C(1) << 4)	///< Line maskedinterrupt status
#define MCCI_STM32H7_DCMI_MIS_VSYNC	(UINT32_C(1) << 3)	///< DCMI_VSYNC maskedinterrupt status
#define MCCI_STM32H7_DCMI_MIS_ERR	(UINT32_C(1) << 2)	///< Synchronization maskedinterrupt status
#define MCCI_STM32H7_DCMI_MIS_OVR	(UINT32_C(1) << 1)	///< Overrun maskedinterrupt status
#define MCCI_STM32H7_DCMI_MIS_FRAME	(UINT32_C(1) << 0)	///< Capture complete maskedinterrupt status
///	@}

