mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name DCMI_ICR bits
///	@{
#define MCCI_STM32H7_DCMI_ICR_RSV5	UINT32_C(0xFFFFFFE0)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_ICR_LINE	(UINT32_C(1) << 4)	///< Line interrupt status clear
#define MCCI_STM32H7_DCMI_ICR_VSYNC	(UINT32_C(1) << 3)	///< DCMI_VSYNC interrupt status clear
#define MCCI_STM32H7_DCMI_ICR_ERR	(UINT32_C(1) << 2)	///< Synchronization raw interrupt status clear
#define MCCI_STM32H7_DCMI_ICR_OVR	(UINT32_C(1) << 1)	///< Overrun interrupt status clear
#define MCCI_STM32H7_DCMI_ICR_FRAME	(UINT32_C(1) << 0)	///< Capture complete interrupt status clear
///	@}

/// \name DCMI_ESCR bits
///	@{
#define MCCI_STM32H7_DCMI_ESCR_FEC	(UINT32_C(0xFF) << 24)	///< Frame end delimiter code
#define MCCI_STM32H7_DCMI_ESCR_FEC_N(n)	((n) << 24)		///<
#define MCCI_STM32H7_DCMI_ESCR_LEC	(UINT32_C(0xFF) << 16)	///< Line end delimiter code
#define MCCI_STM32H7_DCMI_ESCR_LEC_N(n)	((n) << 16)		///<
#define MCCI_STM32H7_DCMI_ESCR_LSC	(UINT32_C(0xFF) << 8)	///< Line start delimiter code
#define MCCI_STM32H7_DCMI_ESCR_LSC_N(n)	((n) << 8)		///<
#define MCCI_STM32H7_DCMI_ESCR_FSC	(UINT32_C(0xFF) << 0)	///< Frame start delimiter code
#define MCCI_STM32H7_DCMI_ESCR_FSC_N(n)	((n) << 0)		///<
///	@}

/// \name DCMI_ESUR bits
///	@{
#define MCCI_STM32H7_DCMI_ESUR_FEU	(UINT32_C(0xFF) << 24)	///< Frame end delimiter unmask
#define MCCI_STM32H7_DCMI_ESUR_FEU_N(n)	((n) << 24)		///<
#define MCCI_STM32H7_DCMI_ESUR_LEU	(UINT32_C(0xFF) << 16)	///< Line end delimiter unmask
#define MCCI_STM32H7_DCMI_ESUR_LEU_N(n)	((n) << 16)		///<
#define MCCI_STM32H7_DCMI_ESUR_LSU	(UINT32_C(0xFF) << 8)	///< Line start delimiter unmask
#define MCCI_STM32H7_DCMI_ESUR_LSU_N(n)	((n) << 8)		///<
#define MCCI_STM32H7_DCMI_ESUR_FSU	(UINT32_C(0xFF) << 0)	///< Frame start delimiter unmask
#define MCCI_STM32H7_DCMI_ESUR_FSU_N(n)	((n) << 0)		///<
///	@}

/// \name DCMI_CWSTRT bits
///	@{
#define MCCI_STM32H7_DCMI_CWSTRT_RSV29	(UINT32_C(7) << 29)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_CWSTRT_VST	(UINT32_C(0x1FFF) << 16)	///< Vertical start line count
#define MCCI_STM32H7_DCMI_CWSTRT_VST_N(n) ((n) << 16)		///<
#define MCCI_STM32H7_DCMI_CWSTRT_RSV14	(UINT32_C(3) << 14)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_CWSTRT_HOFFCNT	(UINT32_C(0x3FFF) << 0)	///< Horizontal offset count
#define MCCI_STM32H7_DCMI_CWSTRT_HOFFCNT_N(n)	((n) << 0)	///<
///	@}

/// \name DCMI_CWSIZE bits
///	@{
#define MCCI_STM32H7_DCMI_CWSIZE_RSV30	(UINT32_C(3) << 30)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_CWSIZE_VLINE	(UINT32_C(0x3FFF) << 16)	///< Vertical line count
#define MCCI_STM32H7_DCMI_CWSIZE_VLINE_N(n) ((n) << 16)		///<
#define MCCI_STM32H7_DCMI_CWSIZE_RSV14	(UINT32_C(3) << 14)	///< reserved, don't change
#define MCCI_STM32H7_DCMI_CWSIZE_CAPCNT	(UINT32_C(0x3FFF) << 0)	///< Capture count
#define MCCI_STM32H7_DCMI_CWSIZE_CAPCNT_N(n)	((n) << 0)	///<
///	@}


/****************************************************************************\
|
|	I2C Control Registers
|
\****************************************************************************/

/// \name I2C offsets
///	@{
#define	MCCI_STM32H7_I2C_CR1		UINT32_C(0x00)	///< offset to I2C control register 1
#define MCCI_STM32H7_I2C_CR2		UINT32_C(0x04)	///< offset to I2C control register 2
#define	MCCI_STM32H7_I2C_OAR1		UINT32_C(0x08)	///< offset to I2C own address 1 register
#define MCCI_STM32H7_I2C_OAR2		UINT32_C(0x0C)	///< offset to I2C own address 2 register
#define MCCI_STM32H7_I2C_TIMINGR	UINT32_C(0x10)	///< offset to I2C timing register
#define MCCI_STM32H7_I2C_TIMOUTR	UINT32_C(0x14)	///< offset to I2C timeout register
#define MCCI_STM32H7_I2C_ISR		UINT32_C(0x18)	///< offset to I2C interrupt and status register
#define MCCI_STM32H7_I2C_ICR		UINT32_C(0x1C)	///< offset to I2C interrupt clear register
#define MCCI_STM32H7_I2C_PECR		UINT32_C(0x20)	///< offset to I2C PEC register
#define MCCI_STM32H7_I2C_RXDR		UINT32_C(0x24)	///< offset to I2C receive data register
#define MCCI_STM32H7_I2C_TXDR		UINT32_C(0x28)	///< offset to I2C transmit data register
///	@}

/// \name I2C_CR1 bits
///	@{
#define MCCI_STM32H7_I2C_CR1_RSV24	UINT32_C(0xFF000000)	///< reserved, don't change
#define MCCI_STM32H7_I2C_CR1_PECEN	(UINT32_C(1) << 23)	///< PEC enable
#define MCCI_STM32H7_I2C_CR1_ALERTEN	(UINT32_C(1) << 22)	///< SMBus alert enable
#define MCCI_STM32H7_I2C_CR1_SMBDEN	(UINT32_C(1) << 21)	///< SMBus Device Default Address enable
#define MCCI_STM32H7_I2C_CR1_SMBHEN	(UINT32_C(1) << 20)	///< SMBus Host Address enable
#define MCCI_STM32H7_I2C_CR1_GCEN	(UINT32_C(1) << 19)	///< General call enable
#define MCCI_STM32H7_I2C_CR1_WUPEN	(UINT32_C(1) << 18)	///< Wakeup from Stop mode enable
#define MCCI_STM32H7_I2C_CR1_NOSTRETCH	(UINT32_C(1) << 17)	///< Clock stretching disable
#define MCCI_STM32H7_I2C_CR1_SBC	(UINT32_C(1) << 16)	///< Slave byte control
#define MCCI_STM32H7_I2C_CR1_RXDMAEN	(UINT32_C(1) << 15)	///< DMA reception requests enable
#define MCCI_STM32H7_I2C_CR1_TXDMAEN	(UINT32_C(1) << 14)	///< DMA transmission requests enable
#define MCCI_STM32H7_I2C_CR1_RSV13	(UINT32_C(1) << 13)	///< reserved, don't change
#define MCCI_STM32H7_I2C_CR1_ANFOFF	(UINT32_C(1) << 12)	///< Analog noise filter OFF
#define MCCI_STM32H7_I2C_CR1_DNF	(UINT32_C(0xF) << 8)	///< Digital noise filter
#define MCCI_STM32H7_I2C_CR1_DNF_N(n)	((n) << 8)		///<
#define MCCI_STM32H7_I2C_CR1_ERRIE	(UINT32_C(1) << 7)	///< Error interrupts enable
#define MCCI_STM32H7_I2C_CR1_TCIE	(UINT32_C(1) << 6)	///< Transfer Complete interrupt enable
#define MCCI_STM32H7_I2C_CR1_STOPIE	(UINT32_C(1) << 5)	///< Stop detection Interrupt enable
#define MCCI_STM32H7_I2C_CR1_NACKIE	(UINT32_C(1) << 4)	///< Not acknowledge received Interrupt enable
#define MCCI_STM32H7_I2C_CR1_ADDRIE	(UINT32_C(1) << 3)	///< Address match Interrupt enable (slave only)
#define MCCI_STM32H7_I2C_CR1_RXIE	(UINT32_C(1) << 2)	///< RX Interrupt enable
#define MCCI_STM32H7_I2C_CR1_TXIE	(UINT32_C(1) << 1)	///< TX Interrupt enable
#define MCCI_STM32H7_I2C_CR1_PE		(UINT32_C(1) << 0)	///< Peripheral enable
///	@}

