mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name I2C_CR2 bits
///	@{
#define MCCI_STM32H7_I2C_CR2_RSV27	UINT32_C(0xF8000000)	///< reserved, don't change
#define MCCI_STM32H7_I2C_CR2_PECBYTE	(UINT32_C(1) << 26)	///< Packet error checking byte
#define MCCI_STM32H7_I2C_CR2_AUTOEND	(UINT32_C(1) << 25)	///< Automatic end mode (master mode)
#define MCCI_STM32H7_I2C_CR2_RELOAD	(UINT32_C(1) << 24)	///< NBYTES reload mode
#define MCCI_STM32H7_I2C_CR2_NBYTES	(UINT32_C(0xFF) << 16)	///< Number of bytes
#define MCCI_STM32H7_I2C_CR2_NBYTES_N(n)	((n) << 16)	///<
#define MCCI_STM32H7_I2C_CR2_NACK	(UINT32_C(1) << 15)	///< NACK generation (slave mode)
#define MCCI_STM32H7_I2C_CR2_STOP	(UINT32_C(1) << 14)	///< Stop generation (master mode)
#define MCCI_STM32H7_I2C_CR2_START	(UINT32_C(1) << 13)	///< Start generation
#define MCCI_STM32H7_I2C_CR2_HEAD10R	(UINT32_C(1) << 12)	///< 10-bit address header only read direction (master receiver mode)
#define MCCI_STM32H7_I2C_CR2_ADD10	(UINT32_C(1) << 11)	///< 10-bit addressing mode (master mode)
#define MCCI_STM32H7_I2C_CR2_RD_WRN	(UINT32_C(1) << 10)	///< Transfer direction (master mode)
#define MCCI_STM32H7_I2C_CR2_SADD	(UINT32_C(0x3FF) << 0)	///< Slave address (master mode)
#define MCCI_STM32H7_I2C_CR2_SADD_N(n)	((n) << 0)		///<
///	@}

/// \name I2C_OAR1 bits
///	@{
#define MCCI_STM32H7_I2C_OAR1_RSV16	UINT32_C(0xFFFF0000)	///< reserved, don't change
#define MCCI_STM32H7_I2C_OAR1_OA1EN	(UINT32_C(1) << 15)	///< Own Address 1 enable
#define MCCI_STM32H7_I2C_OAR1_RSV11	(UINT32_C(0xF) << 11)	///<  reserved, don't change
#define MCCI_STM32H7_I2C_OAR1_OA1MODE	(UINT32_C(1) << 10)	///< Own Address 1 10-bit mode
#define MCCI_STM32H7_I2C_OAR1_OA1	(UINT32_C(0x3FF) << 0)	///< Interface own slave address
#define MCCI_STM32H7_I2C_OAR1_OA1_N(n)	((n) << 0)		///<
///	@}

/// \name I2C_OAR2 bits
///	@{
#define MCCI_STM32H7_I2C_OAR2_RSV16	UINT32_C(0xFFFF0000)	///< reserved, don't change
#define MCCI_STM32H7_I2C_OAR2_OA2EN	(UINT32_C(1) << 15)	///< Own Address 2 enable
#define MCCI_STM32H7_I2C_OAR2_RSV11	(UINT32_C(0xF) << 11)	///<  reserved, don't change
#define MCCI_STM32H7_I2C_OAR2_OA2MSK	(UINT32_C(7) << 8)	///< Own Address 2 masks
#define MCCI_STM32H7_I2C_OAR2_OA2MSK_N(n)	((n) << 8)	///<
#define MCCI_STM32H7_I2C_OAR2_OA2	(UINT32_C(0xFF) << 0)	///< Interface address
#define MCCI_STM32H7_I2C_OAR2_OA2_N(n)	((n) << 0)		///<
///	@}

/// \name I2C_TIMINGR bits
///	@{
#define MCCI_STM32H7_I2C_TIMINGR_PRESC	(UINT32_C(0xF) << 28)	///< Timing prescaler
#define MCCI_STM32H7_I2C_TIMINGR_PRESC_N(n)	((n) << 28)	///<
#define MCCI_STM32H7_I2C_TIMINGR_RSV24	(UINT32_C(0xF) << 24)	///< reserved, don't change
#define MCCI_STM32H7_I2C_TIMINGR_SCLDEL	(UINT32_C(0xF) << 20)	///< Data setup time
#define MCCI_STM32H7_I2C_TIMINGR_SCLDEL_N(n)	((n) << 20)	///<
#define MCCI_STM32H7_I2C_TIMINGR_SDADEL	(UINT32_C(0xF) << 16)	///< Data hold time
#define MCCI_STM32H7_I2C_TIMINGR_SDADEL_N(n)	((n) << 16)	///<
#define MCCI_STM32H7_I2C_TIMINGR_SCLH	(UINT32_C(0xFF) << 8)	///< SCL high period (master mode)
#define MCCI_STM32H7_I2C_TIMINGR_SCLH_N(n)	((n) << 8)	///<
#define MCCI_STM32H7_I2C_TIMINGR_SCLL	(UINT32_C(0xFF) << 0)	///< SCL low period (master mode)
#define MCCI_STM32H7_I2C_TIMINGR_SCLL_N(n)	((n) << 0)	///<
///	@}

/// \name I2C_TIMEOUTR bits
///	@{
#define MCCI_STM32H7_I2C_TIMEOUTR_TEXTEN	(UINT32_C(1) << 31)	///< Extended clock timeout enable
#define MCCI_STM32H7_I2C_TIMEOUTR_RSV28	(UINT32_C(7) << 28)	///< reserved, don't change
#define MCCI_STM32H7_I2C_TIMEOUTR_TIMEOUTB	(UINT32_C(0xFFF) << 16)	///< Bus timeout B
#define MCCI_STM32H7_I2C_TIMEOUTR_TIMEOUTB_N(n)	((n) << 16)	///<
#define MCCI_STM32H7_I2C_TIMEOUTR_TIMOUTEN	(UINT32_C(1) << 15)	///< Clock timeout enable
#define MCCI_STM32H7_I2C_TIMINGR_RSV13	(UINT32_C(3) << 13)	///< reserved, don't change
#define MCCI_STM32H7_I2C_TIMEOUTR_TIDLE	(UINT32_C(1) << 12)	///< Idle clock timeout detection
#define MCCI_STM32H7_I2C_TIMEOUTR_TIMEOUTA	(UINT32_C(0xFFF) << 0)	///< Bus Timeout A
#define MCCI_STM32H7_I2C_TIMEOUTR_TIMEOUTA_N(n)	((n) << 0)	///<
///	@}

/// \name I2C_ISR bits
///	@{
#define MCCI_STM32H7_I2C_ISR_RSV24	UINT32_C(0xFF000000)	///< reserved, don't change
#define MCCI_STM32H7_I2C_ISR_ADDCODE	(UINT32_C(0x7F) << 17)	///< Address match code (Slave mode)
#define MCCI_STM32H7_I2C_ISR_DIR	(UINT32_C(1) << 16)	///< Transfer direction (Slave mode)
#define MCCI_STM32H7_I2C_ISR_BUSY	(UINT32_C(1) << 15)	///< Bus busy
#define MCCI_STM32H7_I2C_ISR_RSV14	(UINT32_C(1) << 14)	///<  reserved, don't change
#define MCCI_STM32H7_I2C_ISR_ALERT	(UINT32_C(1) << 13)	///< SMBus alert
#define MCCI_STM32H7_I2C_ISR_TIMEOUT	(UINT32_C(1) << 12)	///< Timeout or tLOW detection flag
#define MCCI_STM32H7_I2C_ISR_PECERR	(UINT32_C(1) << 11)	///< PEC Error in reception
#define MCCI_STM32H7_I2C_ISR_OVR	(UINT32_C(1) << 10)	///< Overrun/Underrun (slave mode)
#define MCCI_STM32H7_I2C_ISR_ARLO	(UINT32_C(1) << 9)	///< Arbitration lost
#define MCCI_STM32H7_I2C_ISR_BERR	(UINT32_C(1) << 8)	///< Bus error
#define MCCI_STM32H7_I2C_ISR_TCR	(UINT32_C(1) << 7)	///< Transfer Complete Reload
#define MCCI_STM32H7_I2C_ISR_TC		(UINT32_C(1) << 6)	///< Transfer Complete (master mode)
#define MCCI_STM32H7_I2C_ISR_STOPF	(UINT32_C(1) << 5)	///< Stop detection flag
#define MCCI_STM32H7_I2C_ISR_NACKF	(UINT32_C(1) << 4)	///< Not Acknowledge received flag
#define MCCI_STM32H7_I2C_ISR_ADDR	(UINT32_C(1) << 3)	///< Address matched (slave mode)
#define MCCI_STM32H7_I2C_ISR_RXNE	(UINT32_C(1) << 2)	///< Receive data register not empty (receivers)
#define MCCI_STM32H7_I2C_ISR_TXIS	(UINT32_C(1) << 1)	///< Transmit interrupt status (transmitters)
#define MCCI_STM32H7_I2C_ISR_TXE	(UINT32_C(1) << 0)	///< Transmit data register empty (transmitters)
///	@}

/// \name I2C_ICR bits
///	@{
#define MCCI_STM32H7_I2C_ICR_RSV14	UINT32_C(0xFFFFC000)	///< reserved, don't change
#define MCCI_STM32H7_I2C_ICR_ALERTCF	(UINT32_C(1) << 13)	///< Alert flag clear
#define MCCI_STM32H7_I2C_ICR_TIMEOUTCF	(UINT32_C(1) << 12)	///< Timeout detection flag clear
#define MCCI_STM32H7_I2C_ICR_PECCF	(UINT32_C(1) << 11)	///< PEC Error flag clear
#define MCCI_STM32H7_I2C_ICR_OVRCF	(UINT32_C(1) << 10)	///< Overrun/Underrun flag clear
#define MCCI_STM32H7_I2C_ICR_ARLOCF	(UINT32_C(1) << 9)	///< Arbitration lost flag clear
#define MCCI_STM32H7_I2C_ICR_BERRCF	(UINT32_C(1) << 8)	///< Bus error flag clear
#define MCCI_STM32H7_I2C_ICR_RSV6	(UINT32_C(3) << 6)	///< reserved, don't change
#define MCCI_STM32H7_I2C_ICR_STOPCF	(UINT32_C(1) << 5)	///< STOP detection flag clear
#define MCCI_STM32H7_I2C_ICR_NACKCF	(UINT32_C(1) << 4)	///< Not Acknowledge flag clear
#define MCCI_STM32H7_I2C_ICR_ADDRCF	(UINT32_C(1) << 3)	///< Address matched flag clear
#define MCCI_STM32H7_I2C_ICR_RSV0	(UINT32_C(7) << 0)	///< reserved, don't change
///	@}

/// \name I2C_PECR bits
///	@{
#define MCCI_STM32H7_I2C_PECR_RSV8	UINT32_C(0xFFFFFF00)	///< reserved, don't change
#define MCCI_STM32H7_I2C_PECR_PEC	(UINT32_C(0xFF) << 0)	///< Packet error checking register
///	@}

