mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name I2C_RXDR bits
///	@{
#define MCCI_STM32H7_I2C_RXDR_RSV8	UINT32_C(0xFFFFFF00)	///< reserved, don't change
#define MCCI_STM32H7_I2C_RXDR_RXDATA	(UINT32_C(0xFF) << 0)	///< 8-bit receive data
///	@}

/// \name I2C_TXDR bits
///	@{
#define MCCI_STM32H7_I2C_TXDR_RSV8	UINT32_C(0xFFFFFF00)	///< reserved, don't change
#define MCCI_STM32H7_I2C_TXDR_TXDATA	(UINT32_C(0xFF) << 0)	///< 8-bit transmit data
///	@}


/****************************************************************************\
|
|	Timer Control Registers
|
\****************************************************************************/

/// \name Timer offsets
///	@{
#define	MCCI_STM32H7_TIM_CR1		UINT32_C(0x00)	///< offset to TIM control register 1
#define MCCI_STM32H7_TIM_CR2		UINT32_C(0x04)	///< offset to TIM control register 2
#define	MCCI_STM32H7_TIM_SMCR		UINT32_C(0x08)	///< offset to TIM slave mode control register
#define MCCI_STM32H7_TIM_DIER		UINT32_C(0x0C)	///< offset to TIM DMA/interrupt enable register
#define MCCI_STM32H7_TIM_SR		UINT32_C(0x10)	///< offset to TIM status register
#define MCCI_STM32H7_TIM_EGR		UINT32_C(0x14)	///< offset to TIM event generation register
#define MCCI_STM32H7_TIM_CCMR1		UINT32_C(0x18)	///< offset to TIM capture/compare mode register 1
#define MCCI_STM32H7_TIM_CCMR2		UINT32_C(0x1C)	///< offset to TIM capture/compare mode register 2
#define MCCI_STM32H7_TIM_CCER		UINT32_C(0x20)	///< offset to TIM capture/compare enable register
#define MCCI_STM32H7_TIM_CNT		UINT32_C(0x24)	///< offset to TIM counter register
#define MCCI_STM32H7_TIM_PSC		UINT32_C(0x28)	///< offset to TIM prescaler register
#define MCCI_STM32H7_TIM_ARR		UINT32_C(0x2C)	///< offset to TIM auto-reload register
#define MCCI_STM32H7_TIM_RCR		UINT32_C(0x30)	///< offset to TIM repetition counter register
#define MCCI_STM32H7_TIM_CCR1		UINT32_C(0x34)	///< offset to TIM capture/compare register 1
#define MCCI_STM32H7_TIM_CCR2		UINT32_C(0x38)	///< offset to TIM capture/compare register 2
#define MCCI_STM32H7_TIM_CCR3		UINT32_C(0x3C)	///< offset to TIM capture/compare register 3
#define MCCI_STM32H7_TIM_CCR4		UINT32_C(0x40)	///< offset to TIM capture/compare register 4
#define MCCI_STM32H7_TIM_BDTR		UINT32_C(0x44)	///< offset to TIM break and dead-time register
#define MCCI_STM32H7_TIM_DCR		UINT32_C(0x48)	///< offset to TIM DMA control register
#define MCCI_STM32H7_TIM_DMAR		UINT32_C(0x4C)	///< offset to TIM DMA address register
#define MCCI_STM32H7_TIM_CCMR3		UINT32_C(0x54)	///< offset to TIM capture/compare mode register 3
#define MCCI_STM32H7_TIM_CCR5		UINT32_C(0x58)	///< offset to TIM capture/compare register 5
#define MCCI_STM32H7_TIM_CCR6		UINT32_C(0x5C)	///< offset to TIM capture/compare register 6
#define MCCI_STM32H7_TIM_AF1		UINT32_C(0x60)	///< offset to TIM Alternate function option register 1
#define MCCI_STM32H7_TIM_AF2		UINT32_C(0x64)	///< offset to TIM Alternate function option register 2
#define MCCI_STM32H7_TIM_TISEL		UINT32_C(0x68)	///< offset to TIM timer input selection register
///	@}

/// \name TIM_CR1 bits
///	@{
#define MCCI_STM32H7_TIM_CR1_RSV12	UINT32_C(0xFFFFF000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CR1_UIFREMAP	(UINT32_C(1) << 11)	///< UIF status bit remapping
#define MCCI_STM32H7_TIM_CR1_RSV10	(UINT32_C(1) << 10)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CR1_CKD	(UINT32_C(0x3) << 8)	///< Clock division
#define MCCI_STM32H7_TIM_CR1_CKD_N(n)	((n) << 8)		///<
#define MCCI_STM32H7_TIM_CR1_ARPE	(UINT32_C(1) << 7)	///< Auto-reload preload enable
#define MCCI_STM32H7_TIM_CR1_CMS	(UINT32_C(0x3) << 5)	///< Center-aligned mode selection
#define MCCI_STM32H7_TIM_CR1_CMS_N(n)	((n) << 5)		///<
#define MCCI_STM32H7_TIM_CR1_DIR	(UINT32_C(1) << 4)	///< Direction
#define MCCI_STM32H7_TIM_CR1_OPM	(UINT32_C(1) << 3)	///< One pulse mode
#define MCCI_STM32H7_TIM_CR1_URS	(UINT32_C(1) << 2)	///< Update request source
#define MCCI_STM32H7_TIM_CR1_UDIS	(UINT32_C(1) << 1)	///< Update disable
#define MCCI_STM32H7_TIM_CR1_CEN	(UINT32_C(1) << 0)	///< Counter enable
///	@}

/// \name TIM_CR2 bits
///	@{
#define MCCI_STM32H7_TIM_CR2_RSV24	UINT32_C(0xFF000000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CR2_MMS2	(UINT32_C(0xF) << 20)	///< Master mode selection 2
#define MCCI_STM32H7_TIM_CR2_MMS2_N(n)	((n) << 20)		///<
#define MCCI_STM32H7_TIM_CR2_RSV19	(UINT32_C(1) << 19)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CR2_OIS6	(UINT32_C(1) << 18)	///< Output Idle state 6 (OC6 output)
#define MCCI_STM32H7_TIM_CR2_RSV17	(UINT32_C(1) << 17)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CR2_OIS5	(UINT32_C(1) << 16)	///< Output Idle state 5 (OC5 output)
#define MCCI_STM32H7_TIM_CR2_RSV15	(UINT32_C(1) << 15)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CR2_OIS4	(UINT32_C(1) << 14)	///< Output Idle state 4 (OC4 output)
#define MCCI_STM32H7_TIM_CR2_OIS3N	(UINT32_C(1) << 13)	///< Output Idle state 3 (OC3N output)
#define MCCI_STM32H7_TIM_CR2_OIS3	(UINT32_C(1) << 12)	///< Output Idle state 3 (OC3 output)
#define MCCI_STM32H7_TIM_CR2_OIS2N	(UINT32_C(1) << 11)	///< Output Idle state 2 (OC2N output)
#define MCCI_STM32H7_TIM_CR2_OIS2	(UINT32_C(1) << 10)	///< Output Idle state 2 (OC2 output)
#define MCCI_STM32H7_TIM_CR2_OIS1N	(UINT32_C(1) << 9)	///< Output Idle state 1 (OC1N output)
#define MCCI_STM32H7_TIM_CR2_OIS1	(UINT32_C(1) << 8)	///< Output Idle state 1 (OC1 output)
#define MCCI_STM32H7_TIM_CR2_TI1S	(UINT32_C(1) << 7)	///< TI1 selection
#define MCCI_STM32H7_TIM_CR2_MMS	(UINT32_C(0x7) << 4)	///< Master mode selection
#define MCCI_STM32H7_TIM_CR2_MMS_N(n)	((n) << 4)		///<
#define MCCI_STM32H7_TIM_CR2_CCDS	(UINT32_C(1) << 3)	///< Capture/compare DMA selection
#define MCCI_STM32H7_TIM_CR2_CCUS	(UINT32_C(1) << 2)	///< Capture/compare control update selection
#define MCCI_STM32H7_TIM_CR2_RSV1	(UINT32_C(1) << 1)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CR2_CCPC	(UINT32_C(1) << 0)	///< Capture/compare preloaded control
///	@}

/// \name TIM_SMCR bits
///	@{
#define MCCI_STM32H7_TIM_SMCR_RSV22	UINT32_C(0xFFC00000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_SMCR_TS3	(UINT32_C(0x3) << 20)	///< Trigger selection
#define MCCI_STM32H7_TIM_SMCR_TS3_N(n)	((n) << 20)		///<
#define MCCI_STM32H7_TIM_SMCR_RSV17	(UINT32_C(7) << 17)	///< reserved, don't change
#define MCCI_STM32H7_TIM_SMCR_SMS3	(UINT32_C(1) << 16)	///< Slave mode selection
#define MCCI_STM32H7_TIM_SMCR_ETP	(UINT32_C(1) << 15)	///< External trigger polarity
#define MCCI_STM32H7_TIM_SMCR_ECE	(UINT32_C(1) << 14)	///< External clock enable
#define MCCI_STM32H7_TIM_SMCR_ETPS	(UINT32_C(0x3) << 12)	///< External trigger prescaler
#define MCCI_STM32H7_TIM_SMCR_ETPS_N(n)	((n) << 12)		///<
#define MCCI_STM32H7_TIM_SMCR_ETF	(UINT32_C(0xF) << 8)	///< External trigger filter
#define MCCI_STM32H7_TIM_SMCR_ETF_N(n)	((n) << 8)		///<
#define MCCI_STM32H7_TIM_SMCR_MSM	(UINT32_C(1) << 7)	///< Master/slave mode
#define MCCI_STM32H7_TIM_SMCR_TS0	(UINT32_C(0x7) << 4)	///< Trigger selection
#define MCCI_STM32H7_TIM_SMCR_TS0_N(n)	((n) << 4)		///<
#define MCCI_STM32H7_TIM_SMCR_RSV3	(UINT32_C(1) << 3)	///< reserved, don't change
#define MCCI_STM32H7_TIM_SMCR_SMS0	(UINT32_C(0x7) << 0)	///< Slave mode selection
#define MCCI_STM32H7_TIM_SMCR_SMS0_N(n)	((n) << 0)		///<

