mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
#define MCCI_STM32H7_TIM_SMCR_TS	(MCCI_STM32H7_TIM_SMCR_TS3 | MCCI_STM32H7_TIM_SMCR_TS0)	///< Trigger selection
#define MCCI_STM32H7_TIM_SMCR_TS_N(n)	(MCCI_STM32H7_TIM_SMCR_TS3_N((n) >> 3) | MCCI_STM32H7_TIM_SMCR_TS0_N((n) & UINT32_C(0x7)))
#define MCCI_STM32H7_TIM_SMCR_SMS	(MCCI_STM32H7_TIM_SMCR_SMS3 | MCCI_STM32H7_TIM_SMCR_SMS0)	///< Trigger selection
#define MCCI_STM32H7_TIM_SMCR_SMS_N(n)	((((n) >> 3) << 16) | MCCI_STM32H7_TIM_SMCR_SMS0_N((n) & UINT32_C(0x7)))
///	@}

/// \name TIM_DIER bits
///	@{
#define MCCI_STM32H7_TIM_DIER_RSV15	UINT32_C(0xFFFF8000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_DIER_TDE	(UINT32_C(1) << 14)	///< Trigger DMA request enable
#define MCCI_STM32H7_TIM_DIER_COMDE	(UINT32_C(1) << 13)	///< COM DMA request enable
#define MCCI_STM32H7_TIM_DIER_CC4DE	(UINT32_C(1) << 12)	///< Capture/Compare 4 DMA request enable
#define MCCI_STM32H7_TIM_DIER_CC3DE	(UINT32_C(1) << 11)	///< Capture/Compare 3 DMA request enable
#define MCCI_STM32H7_TIM_DIER_CC2DE	(UINT32_C(1) << 10)	///< Capture/Compare 2 DMA request enable
#define MCCI_STM32H7_TIM_DIER_CC1DE	(UINT32_C(1) << 9)	///< Capture/Compare 1 DMA request enable
#define MCCI_STM32H7_TIM_DIER_UDE	(UINT32_C(1) << 8)	///< Update DMA request enable
#define MCCI_STM32H7_TIM_DIER_BIE	(UINT32_C(1) << 7)	///< Break interrupt enable
#define MCCI_STM32H7_TIM_DIER_TIE	(UINT32_C(1) << 6)	///< Trigger interrupt enable
#define MCCI_STM32H7_TIM_DIER_COMIE	(UINT32_C(1) << 5)	///< COM interrupt enable
#define MCCI_STM32H7_TIM_DIER_CC4IE	(UINT32_C(1) << 4)	///< Capture/Compare 4 interrupt enable
#define MCCI_STM32H7_TIM_DIER_CC3IE	(UINT32_C(1) << 3)	///< Capture/Compare 3 interrupt enable
#define MCCI_STM32H7_TIM_DIER_CC2IE	(UINT32_C(1) << 2)	///< Capture/Compare 2 interrupt enable
#define MCCI_STM32H7_TIM_DIER_CC1IE	(UINT32_C(1) << 1)	///< Capture/Compare 1 interrupt enable
#define MCCI_STM32H7_TIM_DIER_UIE	(UINT32_C(1) << 0)	///< Update interrupt enable
///	@}

/// \name TIM_SR bits
///	@{
#define MCCI_STM32H7_TIM_SR_RSV18	UINT32_C(0xFFFC0000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_SR_CC6IF	(UINT32_C(1) << 17)	///< Compare 6 interrupt flag
#define MCCI_STM32H7_TIM_SR_CC5IF	(UINT32_C(1) << 16)	///< Compare 5 interrupt flag
#define MCCI_STM32H7_TIM_SR_RSV14	(UINT32_C(3) << 14)	///< reserved, don't change
#define MCCI_STM32H7_TIM_SR_SBIF	(UINT32_C(1) << 13)	///< System Break interrupt flag
#define MCCI_STM32H7_TIM_SR_CC4OF	(UINT32_C(1) << 12)	///< Capture/Compare 4 overcapture flag
#define MCCI_STM32H7_TIM_SR_CC3OF	(UINT32_C(1) << 11)	///< Capture/Compare 3 overcapture flag
#define MCCI_STM32H7_TIM_SR_CC2OF	(UINT32_C(1) << 10)	///< Capture/Compare 2 overcapture flag
#define MCCI_STM32H7_TIM_SR_CC1OF	(UINT32_C(1) << 9)	///< Capture/Compare 1 overcapture flag
#define MCCI_STM32H7_TIM_SR_B2IF	(UINT32_C(1) << 8)	///< Break 2 interrupt flag
#define MCCI_STM32H7_TIM_SR_BIF		(UINT32_C(1) << 7)	///< Break interrupt flag
#define MCCI_STM32H7_TIM_SR_TIF		(UINT32_C(1) << 6)	///< Trigger interrupt flag
#define MCCI_STM32H7_TIM_SR_COMIF	(UINT32_C(1) << 5)	///< COM interrupt flag
#define MCCI_STM32H7_TIM_SR_CC4IF	(UINT32_C(1) << 4)	///< Capture/Compare 4 interrupt flag
#define MCCI_STM32H7_TIM_SR_CC3IF	(UINT32_C(1) << 3)	///< Capture/Compare 3 interrupt flag
#define MCCI_STM32H7_TIM_SR_CC2IF	(UINT32_C(1) << 2)	///< Capture/Compare 2 interrupt flag
#define MCCI_STM32H7_TIM_SR_CC1IF	(UINT32_C(1) << 1)	///< Capture/Compare 1 interrupt flag
#define MCCI_STM32H7_TIM_SR_UIF		(UINT32_C(1) << 0)	///< Update interrupt flag
///	@}

/// \name TIM_EGR bits
///	@{
#define MCCI_STM32H7_TIM_EGR_RSV8	UINT32_C(0xFFFFFE00)	///< reserved, don't change
#define MCCI_STM32H7_TIM_EGR_B2G	(UINT32_C(1) << 8)	///< Break 2 generation
#define MCCI_STM32H7_TIM_EGR_BG		(UINT32_C(1) << 7)	///< Break generation
#define MCCI_STM32H7_TIM_EGR_TG		(UINT32_C(1) << 6)	///< Trigger generation
#define MCCI_STM32H7_TIM_EGR_COMG	(UINT32_C(1) << 5)	///< COM generation
#define MCCI_STM32H7_TIM_EGR_CC4G	(UINT32_C(1) << 4)	///< Capture/Compare 4 generation
#define MCCI_STM32H7_TIM_EGR_CC3G	(UINT32_C(1) << 3)	///< Capture/Compare 3 generation
#define MCCI_STM32H7_TIM_EGR_CC2G	(UINT32_C(1) << 2)	///< Capture/Compare 2 generation
#define MCCI_STM32H7_TIM_EGR_CC1G	(UINT32_C(1) << 1)	///< Capture/Compare 1 generation
#define MCCI_STM32H7_TIM_EGR_UG		(UINT32_C(1) << 0)	///< Update generation
///	@}

/// \name TIM_CNT bits
///	@{
#define MCCI_STM32H7_TIM_CNT_UIFCPY	(UINT32_C(1) << 8)	///< UIF copy
#define MCCI_STM32H7_TIM_CNT_RSV16	UINT32_C(0x7FFF0000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CNT_CNT	(UINT32_C(0xFFFF) << 0)	///< Counter value
///	@}

/// \name TIM_PSC bits
///	@{
#define MCCI_STM32H7_TIM_PSC_RSV16	UINT32_C(0xFFFF0000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_PSC_PSC	(UINT32_C(0xFFFF) << 0)	///< Prescaler value
///	@}

/// \name TIM_ARR bits
///	@{
#define MCCI_STM32H7_TIM_ARR_RSV16	UINT32_C(0xFFFF0000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_ARR_ARR	(UINT32_C(0xFFFF) << 0)	///< Auto-reload value
///	@}

/// \name TIM_RCR bits
///	@{
#define MCCI_STM32H7_TIM_RCR_RSV16	UINT32_C(0xFFFF0000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_RCR_REP	(UINT32_C(0xFFFF) << 0)	///< Repetition counter value
///	@}

/// \name TIM_CCRx bits
///	@{
#define MCCI_STM32H7_TIM_CCR_RSV16	UINT32_C(0xFFFF0000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_CCR_CCR	(UINT32_C(0xFFFF) << 0)	///< Capture/Compare value
///	@}

/// \name TIM_AF1 bits
///	@{
#define MCCI_STM32H7_TIM_AF1_RSV18	UINT32_C(0xFFFC0000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_AF1_ETRSEL	(UINT32_C(0xF) << 14)	///< ETR source selection
#define MCCI_STM32H7_TIM_AF1_ETRSEL_N(n) ((n) << 14)		///
#define MCCI_STM32H7_TIM_AF1_RSV12	(UINT32_C(3) << 12)	///< reserved, don't change
#define MCCI_STM32H7_TIM_AF1_BKCMP2P	(UINT32_C(1) << 11)	///< BRK COMP2 input polarity
#define MCCI_STM32H7_TIM_AF1_BKCMP1P	(UINT32_C(1) << 10)	///< BRK COMP1 input polarity
#define MCCI_STM32H7_TIM_AF1_BKINP	(UINT32_C(1) << 9)	///< BRK BKIN input polarity
#define MCCI_STM32H7_TIM_AF1_BKDF1BK2E	(UINT32_C(1) << 8)	///< BRK dfsdm1_break[2] enable
#define MCCI_STM32H7_TIM_AF1_RSV3	(UINT32_C(0x1F) << 3)	///< reserved, don't change
#define MCCI_STM32H7_TIM_AF1_BKCMP2E	(UINT32_C(1) << 2)	///< BRK COMP2 enable
#define MCCI_STM32H7_TIM_AF1_BKCMP1E	(UINT32_C(1) << 1)	///< BRK COMP1 enable
#define MCCI_STM32H7_TIM_AF1_BKINE	(UINT32_C(1) << 0)	///< BRK BKIN input enable
///	@}

/// \name TIM_AF2 bits
///	@{
#define MCCI_STM32H7_TIM_AF2_RSV12	UINT32_C(0xFFFFF000)	///< reserved, don't change
#define MCCI_STM32H7_TIM_AF2_BKCMP2P	(UINT32_C(1) << 11)	///< BRK COMP2 input polarity
#define MCCI_STM32H7_TIM_AF2_BKCMP1P	(UINT32_C(1) << 10)	///< BRK COMP1 input polarity
#define MCCI_STM32H7_TIM_AF2_BKINP	(UINT32_C(1) << 9)	///< BRK BKIN input polarity
#define MCCI_STM32H7_TIM_AF2_BKDF1BK2E	(UINT32_C(1) << 8)	///< BRK dfsdm1_break[2] enable
#define MCCI_STM32H7_TIM_AF2_RSV3	(UINT32_C(0x1F) << 3)	///< reserved, don't change
#define MCCI_STM32H7_TIM_AF2_BKCMP2E	(UINT32_C(1) << 2)	///< BRK COMP2 enable
#define MCCI_STM32H7_TIM_AF2_BKCMP1E	(UINT32_C(1) << 1)	///< BRK COMP1 enable
#define MCCI_STM32H7_TIM_AF2_BKINE	(UINT32_C(1) << 0)	///< BRK BKIN input enable
///	@}

