mcci-catena/bootloader/platform/soc/stm32h7/i/mcci_stm32h7xx.h
/// \name TIM_TISEL bits
///	@{
#define MCCI_STM32H7_TIM_TISEL_RSV28	(UINT32_C(0xF) << 28)	///< reserved, don't change
#define MCCI_STM32H7_TIM_TISEL_TI4SEL	(UINT32_C(0xF) << 24)	///< selects TI4[0] to TI4[15] input
#define MCCI_STM32H7_TIM_TISEL_TI4SEL_N(n)	((n) << 24)	///
#define MCCI_STM32H7_TIM_TISEL_RSV20	(UINT32_C(0xF) << 20)	///< reserved, don't change
#define MCCI_STM32H7_TIM_TISEL_TI3SEL	(UINT32_C(0xF) << 16)	///< selects TI3[0] to TI3[15] input
#define MCCI_STM32H7_TIM_TISEL_TI3SEL_N(n)	((n) << 16)	///
#define MCCI_STM32H7_TIM_TISEL_RSV12	(UINT32_C(0xF) << 12)	///< reserved, don't change
#define MCCI_STM32H7_TIM_TISEL_TI2SEL	(UINT32_C(0xF) << 8)	///< selects TI2[0] to TI2[15] input
#define MCCI_STM32H7_TIM_TISEL_TI2SEL_N(n)	((n) << 8)	///
#define MCCI_STM32H7_TIM_TISEL_RSV4	(UINT32_C(0xF) << 4)	///< reserved, don't change
#define MCCI_STM32H7_TIM_TISEL_TI1SEL	(UINT32_C(0xF) << 0)	///< selects TI1[0] to TI1[15] input
#define MCCI_STM32H7_TIM_TISEL_TI1SEL_N(n)	((n) << 0)	///
///	@}

/****************************************************************************\
|
|	Interrupt Number Definition
|
\****************************************************************************/

/// \name STM32Hxx interrupt numbers
///	@{
#define	MCCI_STM32H7_IRQ_WWDG			UINT32_C(0)	///< Window WatchDog Interrupt ( wwdg1_it, wwdg2_it)
#define	MCCI_STM32H7_IRQ_PVD_PVM		UINT32_C(1)	///< PVD/PVM through EXTI Line detection Interrupt
#define	MCCI_STM32H7_IRQ_RTC_TAMP_STAMP_CSS_LSE	UINT32_C(2)	///< Tamper, TimeStamp,	CSS and	LSE interrupts through the EXTI	line
#define	MCCI_STM32H7_IRQ_RTC_WKUP		UINT32_C(3)	///< RTC Wakeup	interrupt through the EXTI line
#define	MCCI_STM32H7_IRQ_FLASH			UINT32_C(4)	///< FLASH global Interrupt
#define	MCCI_STM32H7_IRQ_RCC			UINT32_C(5)	///< RCC global	Interrupt
#define	MCCI_STM32H7_IRQ_EXTI0			UINT32_C(6)	///< EXTI Line0	Interrupt
#define	MCCI_STM32H7_IRQ_EXTI1			UINT32_C(7)	///< EXTI Line1	Interrupt
#define	MCCI_STM32H7_IRQ_EXTI2			UINT32_C(8)	///< EXTI Line2	Interrupt
#define	MCCI_STM32H7_IRQ_EXTI3			UINT32_C(9)	///< EXTI Line3	Interrupt
#define	MCCI_STM32H7_IRQ_EXTI4			UINT32_C(10)	///< EXTI Line4	Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream0		UINT32_C(11)	///< DMA1 Stream 0 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream1		UINT32_C(12)	///< DMA1 Stream 1 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream2		UINT32_C(13)	///< DMA1 Stream 2 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream3		UINT32_C(14)	///< DMA1 Stream 3 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream4		UINT32_C(15)	///< DMA1 Stream 4 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream5		UINT32_C(16)	///< DMA1 Stream 5 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream6		UINT32_C(17)	///< DMA1 Stream 6 global Interrupt
#define	MCCI_STM32H7_IRQ_ADC			UINT32_C(18)	///< ADC1 and  ADC2 global Interrupts
#define	MCCI_STM32H7_IRQ_FDCAN1_IT0		UINT32_C(19)	///< FDCAN1 Interrupt line 0
#define	MCCI_STM32H7_IRQ_FDCAN2_IT0		UINT32_C(20)	///< FDCAN2 Interrupt line 0
#define	MCCI_STM32H7_IRQ_FDCAN1_IT1		UINT32_C(21)	///< FDCAN1 Interrupt line 1
#define	MCCI_STM32H7_IRQ_FDCAN2_IT1		UINT32_C(22)	///< FDCAN2 Interrupt line 1
#define	MCCI_STM32H7_IRQ_EXTI9_5		UINT32_C(23)	///< External Line[9:5]	Interrupts
#define	MCCI_STM32H7_IRQ_TIM1_BRK		UINT32_C(24)	///< TIM1 Break	Interrupt
#define	MCCI_STM32H7_IRQ_TIM1_UP		UINT32_C(25)	///< TIM1 Update Interrupt
#define	MCCI_STM32H7_IRQ_TIM1_TRG_COM		UINT32_C(26)	///< TIM1 Trigger and Commutation Interrupt
#define	MCCI_STM32H7_IRQ_TIM1_CC		UINT32_C(27)	///< TIM1 Capture Compare Interrupt
#define	MCCI_STM32H7_IRQ_TIM2			UINT32_C(28)	///< TIM2 global Interrupt
#define	MCCI_STM32H7_IRQ_TIM3			UINT32_C(29)	///< TIM3 global Interrupt
#define	MCCI_STM32H7_IRQ_TIM4			UINT32_C(30)	///< TIM4 global Interrupt
#define	MCCI_STM32H7_IRQ_I2C1_EV		UINT32_C(31)	///< I2C1 Event	Interrupt
#define	MCCI_STM32H7_IRQ_I2C1_ER		UINT32_C(32)	///< I2C1 Error	Interrupt
#define	MCCI_STM32H7_IRQ_I2C2_EV		UINT32_C(33)	///< I2C2 Event	Interrupt
#define	MCCI_STM32H7_IRQ_I2C2_ER		UINT32_C(34)	///< I2C2 Error	Interrupt
#define	MCCI_STM32H7_IRQ_SPI1			UINT32_C(35)	///< SPI1 global Interrupt
#define	MCCI_STM32H7_IRQ_SPI2			UINT32_C(36)	///< SPI2 global Interrupt
#define	MCCI_STM32H7_IRQ_USART1			UINT32_C(37)	///< USART1 global Interrupt
#define	MCCI_STM32H7_IRQ_USART2			UINT32_C(38)	///< USART2 global Interrupt
#define	MCCI_STM32H7_IRQ_USART3			UINT32_C(39)	///< USART3 global Interrupt
#define	MCCI_STM32H7_IRQ_EXTI15_10		UINT32_C(40)	///< External Line[15:10] Interrupts
#define	MCCI_STM32H7_IRQ_RTC_Alarm		UINT32_C(41)	///< RTC Alarm (A and B) through EXTI Line Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM2			UINT32_C(42)	///< DFSDM2 global Interrupt
#define	MCCI_STM32H7_IRQ_TIM8_BRK_TIM12		UINT32_C(43)	///< TIM8 Break	Interrupt and TIM12 global interrupt
#define	MCCI_STM32H7_IRQ_TIM8_UP_TIM13		UINT32_C(44)	///< TIM8 Update Interrupt and TIM13 global interrupt
#define	MCCI_STM32H7_IRQ_TIM8_TRG_COM_TIM14	UINT32_C(45)	///< TIM8 Trigger and Commutation Interrupt and	TIM14 global interrupt
#define	MCCI_STM32H7_IRQ_TIM8_CC		UINT32_C(46)	///< TIM8 Capture Compare Interrupt
#define	MCCI_STM32H7_IRQ_DMA1_Stream7		UINT32_C(47)	///< DMA1 Stream7 Interrupt
#define	MCCI_STM32H7_IRQ_FMC			UINT32_C(48)	///< FMC global	Interrupt
#define	MCCI_STM32H7_IRQ_SDMMC1			UINT32_C(49)	///< SDMMC1 global Interrupt
#define	MCCI_STM32H7_IRQ_TIM5			UINT32_C(50)	///< TIM5 global Interrupt
#define	MCCI_STM32H7_IRQ_SPI3			UINT32_C(51)	///< SPI3 global Interrupt
#define	MCCI_STM32H7_IRQ_UART4			UINT32_C(52)	///< UART4 global Interrupt
#define	MCCI_STM32H7_IRQ_UART5			UINT32_C(53)	///< UART5 global Interrupt
#define	MCCI_STM32H7_IRQ_TIM6_DAC		UINT32_C(54)	///< TIM6 global and DAC1&2 underrun error  interrupts
#define	MCCI_STM32H7_IRQ_TIM7			UINT32_C(55)	///< TIM7 global interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream0		UINT32_C(56)	///<   DMA2 Stream 0 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream1		UINT32_C(57)	///<   DMA2 Stream 1 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream2		UINT32_C(58)	///<   DMA2 Stream 2 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream3		UINT32_C(59)	///<   DMA2 Stream 3 global Interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream4		UINT32_C(60)	///<   DMA2 Stream 4 global Interrupt
#define	MCCI_STM32H7_IRQ_FDCAN_CAL		UINT32_C(63)	///< FDCAN Calibration unit Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT4		UINT32_C(64)	///< DFSDM Filter4 Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT5		UINT32_C(65)	///< DFSDM Filter5 Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT6		UINT32_C(66)	///< DFSDM Filter6 Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT7		UINT32_C(67)	///< DFSDM Filter7 Interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream5		UINT32_C(68)	///< DMA2 Stream 5 global interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream6		UINT32_C(69)	///< DMA2 Stream 6 global interrupt
#define	MCCI_STM32H7_IRQ_DMA2_Stream7		UINT32_C(70)	///< DMA2 Stream 7 global interrupt
#define	MCCI_STM32H7_IRQ_USART6			UINT32_C(71)	///< USART6 global interrupt
#define	MCCI_STM32H7_IRQ_I2C3_EV		UINT32_C(72)	///< I2C3 event	interrupt
#define	MCCI_STM32H7_IRQ_I2C3_ER		UINT32_C(73)	///< I2C3 error	interrupt
#define	MCCI_STM32H7_IRQ_OTG_HS_EP1_OUT		UINT32_C(74)	///< USB OTG HS	End Point 1 Out	global interrupt
#define	MCCI_STM32H7_IRQ_OTG_HS_EP1_IN		UINT32_C(75)	///< USB OTG HS	End Point 1 In global interrupt
#define	MCCI_STM32H7_IRQ_OTG_HS_WKUP		UINT32_C(76)	///< USB OTG HS	Wakeup through EXTI interrupt
#define	MCCI_STM32H7_IRQ_OTG_HS			UINT32_C(77)	///< USB OTG HS	global interrupt
#define	MCCI_STM32H7_IRQ_DCMI_PSSI		UINT32_C(78)	///< DCMI and PSSI global interrupt
#define	MCCI_STM32H7_IRQ_CRYP			UINT32_C(79)	///< CRYP crypto global	interrupt
#define	MCCI_STM32H7_IRQ_HASH_RNG		UINT32_C(80)	///< HASH and RNG global interrupt
#define	MCCI_STM32H7_IRQ_FPU			UINT32_C(81)	///< FPU global	interrupt
#define	MCCI_STM32H7_IRQ_UART7			UINT32_C(82)	///< UART7 global interrupt
#define	MCCI_STM32H7_IRQ_UART8			UINT32_C(83)	///< UART8 global interrupt
#define	MCCI_STM32H7_IRQ_SPI4			UINT32_C(84)	///< SPI4 global Interrupt
#define	MCCI_STM32H7_IRQ_SPI5			UINT32_C(85)	///< SPI5 global Interrupt
#define	MCCI_STM32H7_IRQ_SPI6			UINT32_C(86)	///< SPI6 global Interrupt
#define	MCCI_STM32H7_IRQ_SAI1			UINT32_C(87)	///< SAI1 global Interrupt
#define	MCCI_STM32H7_IRQ_LTDC			UINT32_C(88)	///< LTDC global Interrupt
#define	MCCI_STM32H7_IRQ_LTDC_ER		UINT32_C(89)	///< LTDC Error	global Interrupt
#define	MCCI_STM32H7_IRQ_DMA2D			UINT32_C(90)	///< DMA2D global Interrupt
#define	MCCI_STM32H7_IRQ_SAI2			UINT32_C(91)	///< SAI2 global Interrupt
#define	MCCI_STM32H7_IRQ_OCTOSPI1		UINT32_C(92)	///< OCTOSPI1 global interrupt
#define	MCCI_STM32H7_IRQ_LPTIM1			UINT32_C(93)	///< LP	TIM1 interrupt
#define	MCCI_STM32H7_IRQ_CEC			UINT32_C(94)	///< HDMI-CEC global Interrupt
#define	MCCI_STM32H7_IRQ_I2C4_EV		UINT32_C(95)	///< I2C4 Event	Interrupt
#define	MCCI_STM32H7_IRQ_I2C4_ER		UINT32_C(96)	///< I2C4 Error	Interrupt
#define	MCCI_STM32H7_IRQ_SPDIF_RX		UINT32_C(97)	///< SPDIF-RX global Interrupt
#define	MCCI_STM32H7_IRQ_DMAMUX1_OVR		UINT32_C(102)	///< DMAMUX1 Overrun interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT0		UINT32_C(110)	///< DFSDM Filter1 Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT1		UINT32_C(111)	///< DFSDM Filter2 Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT2		UINT32_C(112)	///< DFSDM Filter3 Interrupt
#define	MCCI_STM32H7_IRQ_DFSDM1_FLT3		UINT32_C(113)	///< DFSDM Filter4 Interrupt
#define	MCCI_STM32H7_IRQ_SWPMI1			UINT32_C(115)	///< Serial Wire Interface 1 global interrupt
#define	MCCI_STM32H7_IRQ_TIM15			UINT32_C(116)	///< TIM15 global Interrupt
#define	MCCI_STM32H7_IRQ_TIM16			UINT32_C(117)	///< TIM16 global Interrupt
#define	MCCI_STM32H7_IRQ_TIM17			UINT32_C(118)	///< TIM17 global Interrupt
#define	MCCI_STM32H7_IRQ_MDIOS_WKUP		UINT32_C(119)	///< MDIOS Wakeup  Interrupt
#define	MCCI_STM32H7_IRQ_MDIOS			UINT32_C(120)	///< MDIOS global Interrupt
#define	MCCI_STM32H7_IRQ_JPEG			UINT32_C(121)	///< JPEG global Interrupt
#define	MCCI_STM32H7_IRQ_MDMA			UINT32_C(122)	///< MDMA global Interrupt
#define	MCCI_STM32H7_IRQ_SDMMC2			UINT32_C(124)	///< SDMMC2 global Interrupt
#define	MCCI_STM32H7_IRQ_HSEM1			UINT32_C(125)	///< HSEM1 global Interrupt
#define	MCCI_STM32H7_IRQ_DAC2			UINT32_C(127)	///< DAC2 global Interrupt
#define	MCCI_STM32H7_IRQ_DMAMUX2_OVR		UINT32_C(128)	///< DMAMUX2 Overrun interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel0		UINT32_C(129)	///< BDMA2 Channel 0 global Interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel1		UINT32_C(130)	///< BDMA2 Channel 1 global Interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel2		UINT32_C(131)	///< BDMA2 Channel 2 global Interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel3		UINT32_C(132)	///< BDMA2 Channel 3 global Interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel4		UINT32_C(133)	///< BDMA2 Channel 4 global Interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel5		UINT32_C(134)	///< BDMA2 Channel 5 global Interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel6		UINT32_C(135)	///< BDMA2 Channel 6 global Interrupt
#define	MCCI_STM32H7_IRQ_BDMA2_Channel7		UINT32_C(136)	///< BDMA2 Channel 7 global Interrupt
#define	MCCI_STM32H7_IRQ_COMP			UINT32_C(137)	///< COMP global Interrupt
#define	MCCI_STM32H7_IRQ_LPTIM2			UINT32_C(138)	///< LP	TIM2 global interrupt
#define	MCCI_STM32H7_IRQ_LPTIM3			UINT32_C(139)	///< LP	TIM3 global interrupt
#define	MCCI_STM32H7_IRQ_UART9			UINT32_C(140)	///< UART9 global interrupt
#define	MCCI_STM32H7_IRQ_USART10		UINT32_C(141)	///< USART10 global interrupt
#define	MCCI_STM32H7_IRQ_LPUART1		UINT32_C(142)	///< LP	UART1 interrupt
#define	MCCI_STM32H7_IRQ_WWDG_RST		UINT32_C(143)	///< Window Watchdog Event interrupt
#define	MCCI_STM32H7_IRQ_CRS			UINT32_C(144)	///< Clock Recovery Global Interrupt
#define	MCCI_STM32H7_IRQ_ECC			UINT32_C(145)	///< ECC diagnostic Global Interrupt
#define	MCCI_STM32H7_IRQ_DTS			UINT32_C(147)	///< Digital Temperature Sensor	Global Interrupt
#define	MCCI_STM32H7_IRQ_WAKEUP_PIN		UINT32_C(149)	///< Interrupt for all 6 wake-up pins
#define	MCCI_STM32H7_IRQ_OCTOSPI2		UINT32_C(150)	///< OctoSPI2 global interrupt
#define	MCCI_STM32H7_IRQ_OTFDEC1		UINT32_C(151)	///< OTFDEC1 global interrupt
#define	MCCI_STM32H7_IRQ_OTFDEC2		UINT32_C(152)	///< OTFDEC2 global interrupt
#define	MCCI_STM32H7_IRQ_GFXMMU			UINT32_C(153)	///< GFXMMU global interrupt
#define	MCCI_STM32H7_IRQ_BDMA1			UINT32_C(154)	///< BDMA1 for DFSM global interrupt
///	@}

/****************************************************************************\
|
|	End of file
|
\****************************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* _mcci_stm32h7xx_h_ */
